{"pages":[{"title":"who am I ?","text":"个人简介 -&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;90后的IT项目经理，全栈工程师，爱好研究各种IT技术计算机科学与技术专业，软件工程方向从事博客网站搭建、系统运维管控、OA系统需求对接、数据可视化等相关工作参加过各种软件开发及项目管理培训课程，已获得PMP和ACP资格认证目前致力于产品方面的研究，探索便捷的开发模式 博客信息 网站原版使用Icarus主题 在原版基础上更新为Icarus-amazing，追求尽可能的简洁，清晰，易用，美观。 本站基于新主题进行了部分个性化功能的修改，欢迎大家探索。 本站推荐使用谷歌浏览器进行访问。 更新日志： –2021.07.20: 试用gitbook笔记站点，开放我的笔记,后续用来记录项目开发故事–2021.07.16: 可同步提供服务的镜像站，由Netlify提供自动化构建及发布–2021.05.21~2021.07.20：开发上线Typecho个人博客网站，由阿里云提供服务，域名已完成备案，后续将作为个人编程开发站点–2021.05.01~2021.05.20：基于gh-pages分支配置Vue后台管理系统作为子项目展示(后续将替换为个人项目管理系统)–2021.04.16~2021.04.30：更新敏捷相关文章内容，评论系统由gitalk调整为valine，标题菜单美化，移动端适配等–2021.04.09~2021.04.15：博客背景功能调整，更新夜晚模式星空效果，白天模式改为随机图片切换效果–2021.04.08：敏捷相关文章内容重构，增加术语表，便于理解内容–2021.04.07：首页摘要展示，增加文章置顶功能，修改部分文章内容–2021.04.05：修改hello-world文章内容为Hexo常用命令,增加看板娘，美化部分界面效果–2021.04.03：播放器音乐更换，CDN使用jsdelivr给图片加速–2021.04.02：开发关于页功能，增加博主及博客介绍–2021.04.01：开发各类菜单功能页（相册、友链、Steam等）–2021.03.31：发布并完善博文内容，测试博文发布及修改–2021.03.31：安装hexo-douban插件，支持电影、游戏、阅读页数据展示–2021.03.29：安装hexo-bangumi插件，支持追番页数据展示–2021.03.28：本地修改文章并开发新页面，测试本地内容推送到Github–2019.03.27：本站项目代码上传Githbub进行托管，参见仓库地址–2021.03.26：研究博客图床，使用picgo作为博客图片的上传工具–2021.03.25：评论功能部署及测试，修改对应的配置–2021.03.24：使用hexo c/g/d 命令构建发布博客，研究hexo相关功能插件–2021.03.23：更新amazing适配主题文件并修改部分参数配置–2021.03.22：完善博客基础信息，研究gitalk评论系统–2021.03.21：完善博客个人资料，准备LOGO等–2021.03.20：使用Icarus主题，第一次发布上线–2021.03.06：Github相关功能配置，构建仓库，申请博客SSL加密认证等–2021.03.04：本地构建并发布第一篇博文，测试相关博客功能–2021.03.03：拉取hexo博客文件，本地部署博客系统–2021.03.01：使用Ubuntu作为博客服务端，搭建博客基础环境，此站后续将作为个人项目管理站点 计划2021计划新的开始，新的征程 10-12月Cobit IT治理课程学习计划CISA 国际信息系统审计师课程学习计划ITIL 4 专家级课程学习计划Prince2 受控项目管理学习计划 9月网络通信相关课程的学习Jira的使用，完善Jupiter计划路线图数据可视化项目正式交付运营ITIL 4专家级CDS课程学习Jupiter网站体系建设初步完成（四大领域及一核心） 8月了解企业级监控Prpmetheus+Grafanadocker-compose容器化实践ITIL 4基础级课程学习及考试（通过ITIL 4基础级认证）初步了解PgMP项目集管理帆软数据可视化项目收尾工作迁移虚拟机Halo博客项目于腾讯云（版本升级、主题升级） 7月Serverless云函数构建WordPress项目实践深入了解React组件原理，看源码实现Coding及Netlify持续部署实践PDF文件阅览、番茄钟等实用插件试用NPDP产品经理认证相关资料整理帆软数据可视化项目研发测试 6月参加ACP敏捷项目管理考试了解数仓架构、日志数据分析了解自动化测试流程研究谷歌浏览器插件了解分布式微服务系统架构开发流程 5月阿里云新站点的基础功能开发了解Scrum、看板等敏捷管理模式了解数据仓库、大数据中间件帆软数据可视化技术预研基于Vue构建个人项目管理系统 4月架构师课程学习（对标阿里P6）敏捷项目管理课程学习（ACP资格认证）前端全栈课程学习（对标阿里P7）博客评论功能优化 3月Hexo博客功能正式上线，不定期维护研究Github相关功能构建自动化发布流水线熟悉Devops相关概念","link":"/about/index.html"},{"title":"我的相册","text":"📸My album（不定期更新） 图片搜集于互联网，侵权请留言，会尽快处理😊。","link":"/album/index.html"},{"title":"我的友链","text":"🔗My links（不定期更新小伙伴） 申请友链须知 优先和拥有原创作品的合规网站进行交换，需要遵守道德法律。 申请需提供：站点名称、站点链接、站点描述、logo或头像（不要设置防盗链）。 友链排名不分先后，如有更新友链信息还请留言告知。 会定期清理已无法正常访问的站点，不再另行通知。 本站不存储友链图片，如果友链图片更换过的请留言告知。 本站友链信息如下，申请友链前请先添加本站信息： 网站图标：https://cdn.jsdelivr.net/gh/Jupiter-1992/Feather@master/profile.png 网站名称：Feather 网站地址：https://jupiter-1992.github.io 网站简介：种其因者，须食其果 加载中，稍等几秒...","link":"/links/index.html"},{"title":"我的留言","text":"💬My message 欢迎来到我的小站,感谢大家的支持","link":"/message/index.html"},{"title":"我的音乐","text":"🎵My music（不定期更新） 温馨提示：选择喜欢的音乐双击播放，由于版权原因部分不能播放。如果喜欢歌单收藏一下，去网易云都能播放哟！","link":"/music/index.html"}],"posts":[{"title":"项目集管理学习笔记","text":"一、项目集管理绩效域1.项目集管理绩效领域的定义项目集管理绩效领域是对活动或职能相关领域的补充分组，这些活动或职能在项目集管理工作的整个范围内，专门描述和区分一个绩效领域中的活动这些绩效领域在项目集持续期间同时存在，项目集经理和项目集团队就是在这些领域中开展各自的工作在项目集的整个过程中，每个项目集都需要在这些绩效领域中进行一些活动。这些领域中的工作本质上是迭代的，并且经常重复 1.1五个绩效域1.项目集战略一致识别项目集输出和成果，以便与组织的目标和目的保持一致的绩效领域2.项目集收益管理定义、创建、最大化和交付项目集 所提供的收益的绩效领域3.项目集相关方参与识别和分析相关方需求，管理期望和沟通，以促进相关方支持的绩效领域4.项目集治理促进和执行项目集决策，为支持项目集而指定实践，并维护项目集监督的绩效领域5.项目集生命周期管理为促进有效的项目集定义、项目集交付和项目集收尾，从而管理所需项目集活动的绩效领域 2.项目集管理绩效领域的交互在整个项目集过程期间，五个项目集管理绩效领域都将彼此交互，交互的何种程度以及何时发生，将取决于项目集及其组件在项目集实施中，项目集经理要在这些领域中投入时间这五个绩效领域反映了更高级别的业务职能，而这些职能对于项目集经理的角色都是必不可少的，无论组织规模、行业或业务重点、地理位置为何，均不例外 3.组织战略、项目组合管理和项目集管理的联系通常，在组织战略规划工作中，项目集会找到起点，在此过程中，组织全部投资会被评估、优先级排序，并与组织的运营战略保持一致随着业务环境或组织战略的改变，组织通过项目组合审查来继续评估工作，加强符合预期收益和组织目标的项目组合的组件，停止与组织目标不一致的计划在组织的项目组合审查过程中，将对项目集进行评估，以确保其继续支持该组织的战略和目标，并按预期执行 4.项目组合和项目集的区别4.1项目管理聚焦可交付成果：产品或服务的交付；范围、成本、进度；对产品质量负责；可交付成果，实现1+1=2 4.2项目集管理聚焦收益：根据业务需求设立；有多个相互关联的项目组成；使项目与项目集总体规划收益保持一致；注重收益最大化，实现1+1&gt;2 4.3项目组合管理达成战略目标：由业务主导；与业务目标对齐；业务价值一致性（风险/收益）；项目/项目集的选择；项目组合优化,实现价值最大化 4.4关联性项目集：在项目集中，各项工作是相互依赖的，因此，实现全部预期收益取决于项目集范围内所有组件的交付项目组合：在项目组合中，典型的工作分组包括：1.来自同一个资源池的人员的工作2.交付给同一个客户的工作3.同一会计期间内进行的工作4.在相同地理区域相同战略业务部门所执行的工作 4.5时间项目集：项目集是临时的，其所包含的时间概念是工作的一个方面尽管项目集可能跨越数年或数十年，但其特征是，存在一个明确定义的起点，一个未来的终点项目组合：为了制定决策而进行定期审查的项目组合并不会被限制在特定日期内结束在项目组合中定义的各种计划和工作要素通常不会直接相互关联，也不依赖彼此以实现收益 5.项目集和项目的区别项目集更多的要思考战略而不是战术方面项目集以收益为导向而不是项目的可交付成果项目集绩效域的转变：更多要考虑面而不是点的问题项目铁三角：以质量为核心，进度、成本、范围项目集铁三角：以战略为核心，收益、治理、相关方 5.1不确定性单个项目相对来说更为确定，预期输出也更为确定由于成果尚不清晰，在项目集开始时，不确定性尤其高，刚开始可能并没有完整的范围、预算或时间表通过项目集处理不确定性的能力来解决，这种能力也会给项目集的方向和成果带来不确定性在项目集中，范围和内容不断进行细化、阐明和调整，以确保与预期收益保持一致，这导致项目集环境在最初是不确定的在项目集成果和预期收益背景下，这些单独的组件可能并不会对预期成果做出任何贡献，这就给项目集可能实现的成果带来了不确定性 5.2.管理变更项目的变更通常是局部的，涉及战术层面项目的变更管理帮助项目经理、团队和相关方监督和控制偏差，同时保护批准的计划输出的属性和特征，同时管理已知风险（预期事件）和未知风险（意外事件）造成的偏差影响项目集经理需要考虑两种不同的变更类型，被称为内部变更和外部变更项目集的变更管理需要对项目集目标和预期收益具备战略洞察力以及理解能力，在项目集层面以一种截然不同的方式实施变更与项目一样，项目集组件利用变更管理来理解和控制各自的进度、成本和输出的可变性项目集经理还可以创建新组件或取消现有组件，这种变更是为了确保优化收益的交付 5.3复杂性项目复杂性主要包括组织复杂性和动态复杂性等内容项目集复杂性主要包括治理、相关方、定义、收益交付、相互依赖关系、资源、范围、变更、风险等诸多内容 二、项目集战略一致项目集应与组织战略保持一致，并促进组织收益的实现。为此，项目集经理需要彻底了解项目集如何实现项目组合和组织的战略、目标与目的，以及为了与组织的长期目标保持一致，项目集所需要的技能 1.项目集商业论证项目集战略一致从项目集商业论证开始在项目集定义阶段，项目集经理与关键发起人和相关方合作，进行项目集的商业论证项目集发起人通常负责项目商业论证文件的制定和维护项目集经理通常负责帮助起草，并提供建议和意见 2.项目集章程定义及作用：商业论证批准后，项目集指导委员会将通过批准项目集章程的形式批准项目集。项目集章程是源自商业论证的一个文档，它指定并授权项目集经理，定义项目集的范围和目的，呈交给治理机构以获得批准、资金和授权项目集章程正式表述了组织的愿景、使命和项目集将产生的预期收益；它还明确了项目集特定的目的与目标符合组织战略计划，并支持商业论证除了规定项目集实施过程中的项目集组件管理与监督框架外，项目集章程还授权项目集经理领导其他将启动的子项目集、项目与相关活动项目集章程是可交付成果中的一个文档，将被用来衡量项目集的成功与否项目集章程可包括：项目集章程的关键要素包括项目集范围、假设、制约因素、高层级风险、高层级收益、目的和目标、成功因素、时间、重要相关方以及将项目集与商业论证联系在一起的其他条款，从而实现项目集战略一致合理性：项目集为什么重要，它将达成什么目标？愿景：项目集的最终状态是什么？它将如何使组织收益？战略一致：关键战略驱动因素是什么？项目集与组织战略目标和其他任何正在实施的战略计划有何关系？收益：实现项目集目标和收益所需的关键成果是什么？范围：项目集包括哪些内容？哪些内容被认为超出了高层级范围？收益战略：确保实现计划收益的方法是什么？假设条件和制约因素：需要考虑哪些假设、制约因素、依赖关系和外部因素？它们如何塑造或限制项目集的目标？组件：怎样配置项目和其他项目集组件才能交付项目集和预期收益风险和问题：项目集路线图编制过程中发现的初步风险和问题有哪些？时间表：项目集总共持续多长时间（包括所有关键里程碑日）？所需资源：估算的项目集成本与资源需求（即人员、培训、差旅等）有多少？相关方考虑因素：关键相关方有哪些？谁是最重要的相关方？促进他们参与的初步策略是什么？这些信息将有助于制定沟通管理计划项目集治理：管理、控制和支持项目集的建议治理机构是什么？指导和监督项目集组件的建议治理机构（包括报告要求）是什么？项目集经理拥有哪些职权？该信息将在项目集治理计划中更新 3.项目集路线图定义及作用：项目集路线图按时间顺序展现项目集的预期方向，以图形方式描述主要里程碑与决策点之间的依赖关系，它反映了商业战略与项目集工作之间的联系项目集路线图要素类似于项目进度计划，路线图列出主要项目集事件，旨在规划和制定更多详细的进度计划项目集路线图可以是管理项目集组织的一个有价值的工具，用于评估项目集达成其预期收益的进度 4.环境评估项目集受到的内外部影响往往会对项目集的成功产生重大的影响。项目集受到的外部影响可能来自大型组织内部，也可能来自组织外部。项目集经理应该识别这些影响，并在项目集管理中考虑它们，以确保与相关方始终保持一致，与组织的战略目的和目标始终保持一致，从而确保项目集的整体成功PESTEL分析 4.1事业环境因素项目集外部的事业环境因素会影响项目集的评选、设计、资金与管理事业环境因素是指项目团队不能立即控制的，将对项目集产生影响、限制或指导作用的各种条件环境因素可能包括但不限于商业环境、监管、市场、立法、资金、资源、行业、科技、健康、安全和环境、政治影响、经济、审计、文化多样性、地理多样性、新的业务流程标准和实践、发现和发明等 4.2环境分析可用于评估项目集商业论证和项目集管理计划的有效性对一个或多个环境分析结果的考虑，能够使项目集经理强调可能影响项目集的因素，并通知风险管理部门可由项目集经理实施或委托实施比较优势分析、可行性研究、SWOT分析、假设分析、历史信息分析 5.项目集风险管理战略项目集路线图的成功交付，与组织战略的一致性，在环境评估中发现的环境因素，都依赖于定义良好的项目集风险战略。它们驱动项目集风险管理活动（积极识别、监督、分析、接受、减轻、规避或退役项目集风险），以确保项目集与组织战略保持一致 5.1战略一致性的风险管理战略一致包括项目集路线图及其支持目标与组织战略的一致，这就需要有一个项目集风险管理战略，以确保对任何可能导致项目集偏离组织战略的风险进行有效管理。这种风险管理战略包括定义项目集风险临界值，执行初步项目集风险评估，制定高层级项目集风险应对战略，以及确定将如何与组织战略层沟通风险战略一致要求项目集风险临界值考虑包括风险偏好在内的组织战略，这是对组织的风险接受度与风险应对的意愿的评估 5.2项目集风险临界值风险临界值是一种项目集目标的可接受差异水平的度量，它反映了组织和项目集相关方的风险偏好项目集风险战略的一个关键要素就是建立和监督项目集风险临界值。项目集风险临界值示例包括：•记录风险登记册中某风险的风险敞口最低水平•定性（高、中、低等）或定量（数值）风险等级的定义•项目集可以管理的风险敞口的最高水平（超出该敞口将会触发升级） 5.3项目集风险初步评估项目集风险管理贯穿于整个项目集生命周期，在项目集定义阶段进行的项目集风险初步评估为识别组织战略一致性风险提供了一个独特的机会在制定项目集路线图和审查环境因素时，就要考虑相关风险。因此，至关重要的是在项目集风险初步评估中就要识别战略一致风险，其中包括但不限于任何不确定的事件或条件，它们的发生可能会导致：•项目集目标不支持组织的目标•项目集路线图与组织路线图不一致•项目集路线图不支持项目组合路线图•项目集目标不支持项目组合目标•项目集资源需求与组织的能力和容量水平不匹配 5.4项目集风险应对战略项目集风险应对战略将风险临界值和风险初步评估要素纳入计划，根据该计划，项目集在整个生命周期都能持续进行有效的风险管理对于每一种被识别的风险，风险临界值都可用于根据一系列评级标准来确定特定的应对战略。例如，对于一个可以接受5%的进度偏差的组织•风险临界值——进度计划延迟5%•风险评级——无重大风险•应对战略——接受可靠的项目集风险管理战略针对每种风险等级制定特定的风险应对战略，这些风险等级反映了项目集的风险临界值 三、项目集收益管理收益,作为项目集交付成果的结果，是由组织和其他相关方所实现的收益和资产。有些收益相对确定，容易量化，可能包括具体或有限的条件，如实现一个组织财务目标（例如，收入或毛利率增长20%），或创建一个实体产品，或供消费或使用的服务。有些收益则可能不容易量化，会产生不够确定的成果。不够确定的项目集成果的例子可包括提高员工士气或客户满意度，还包括降低不良健康状况或疾病发生率。 1.收益识别收益识别阶段的目的是分析有关组织和商业战略、内部和外部影响以及项目集驱动因素的可用信息。以便识别和审核项目集相关方预期实现的收益。战略决策机构（通常为项目集指导委员会）可发布一个项目集章程，其定义了项目集预期要实现的战略目标和收益。收益识别活动包括：定义项目集的目标和成功要素，识别并量化商业收益。 1.1收益登记册收益登记册汇集并列出项目集计划的收益，用于在项目集的整个持续时间内测量和沟通收益的交付。收益登记册通常包括： 1.1收益登记册计划收益列表•计划收益与项目集组件的对应关系，如项目集路线图中反映的那样；•如何衡量每一项收益的描述；•评估收益达成情况的关键绩效指标和临界值；•达成收益的风险评估和概率；•每项收益的状态或进展指标；•达成收益的目标日期和里程碑；•负责交付每项收益的人员、小组或组织；•按照收益计划制定度量进展情况的流程；•跟踪和沟通必要的进展情况，以记录项目集进展和向相关方报告。 2.收益分析和规划收益分析和规划阶段的目的是制定项目集收益管理计划，并开发收益测量指标和框架，用于监控项目集中各个组件和收益测量。收益分析和规划的活动包括：•制定收益管理计划，用于指导项目集剩余阶段的工作；•定义项目集各组件及其相互依赖关系并进行优先级排序；•定义关键绩效指标和及相关量化指标，以需要有效地监督项目集收益的交付；•制定项目集绩效基准，并向项目集重要相关方沟通项目集绩效指标；•随着已知信息的增多，更新正面和负面风险。 2.1收益管理计划收益管理计划是对创造、最大化和维持项目或项目集收益的过程进行定义的书面文件。收益管理计划正式记录了实现项目集计划收益所必需的活动。它识别收益如何及何时有望向组织交付收益，还规定了确保随着时间的推移收益完全实现所需到位的机制。收益管理计划应：•定义各项收益和相关假设，决定如何达成各项收益；•将各组件的输出与计划过的项目集成果联系起来；•定义衡量收益的指标（包括关键绩效指标）和测量收益的程序；•定义管理收益所需的角色和职责；•定义如何将结果收益和能力将如何移交进入运营状态，以实现收益；•定义如何将结果能力移交个人，团体或组织，由他们负责维持收益；•提供整体收益管理工作所需的流程。 2.2收益管理和项目集路线图项目集收益管理制定项目集架构，该架构描绘了各组件应如何交付能力和成果，以实现项目集收益。项目集路线图定义项目集组件的结构，识别各组件之间的关系，制定治理其结论的规则。项目集路线图描述项目集不断变化的方面，包括增量收益交付。 2.3收益登记册更新收益登记册新建于收益识别阶段，在收益分析和规划过程中更新。此时，根据项目集路线图将项目集收益与项目集组件部分对应起来。收益登记册随后由适当的相关方审查，以便定义和批准关键绩效指标和其他测量指标，这些指标将被用于监督项目集的绩效。 3.收益交付收益交付阶段确保有一套指定的报告或测量指标，用来向项目集管理办公室、项目集指导委员会、项目集发起人和其他项目集相关方报告。通过收益指标的持续监督和报告，相关方可以评估项目集的整体健康状况，并采取适当的措施以确保收益得到成功交付。收益管理是一个迭代的过程。特别是收益分析、收益规划与收益交付这三者之间是一种循环的关系。随着条件的变化，可能要持续不断地重新审视收益分析和规划。 3.1收益和项目集组件项目集各组件应在适当的时候启动，并将其输出整合到项目集中，使其成为一个整体。这些组件的启动和收尾都是项目集路线图和时间表中的重要里程碑。里程碑标志着增量收益的达成和交付。收益管理计划为了与项目集的节奏保持同步而进行修改，项目集路线图也应该随之更新。 3.2收益和项目集治理有效的治理有助于确保为组织实现并交付承诺的成果，从而实现预期收益。结果收益审查，要求对比计划收益与实际收益，而实际收益是根据包括关键绩效指标在内的各方面因素而分析得到的。在收益交付阶段，特别要分析和评估以下方面：战略一致。关注确保企业与项目集计划之间的联系；定义、保持和验证项目集价值定位；项目集管理与企业运营管理保持一致。对于关注内部的项目集，收益实现流程衡量新收益对组织运营流程的影响，以确保将引入变更后产生的负面影响和可能的破坏性降低到最小。价值交付。重点确保项目集能够交付预期收益。可能会有机会窗口来实现特定的计划收益并使之产生真正的价值。项目集经理、项目集指导委员会和重要相关方可确定机会窗口条件是否满足，或是否受到项目集或组件的实际活动的限制（例如，延误、成本超支或范围缩小）。投资也可能具有时间价值，其中，各组件进度计划的变化会产生额外的财务影响。 4.收益移交收益移交阶段的目的是确保项目集收益移交至运营领域，并能在移交后继续维持。当组织、社区或其他项目受益人能够利用这些收益时，价值就被交付了。收益移交的活动包括：验证项目集及其组件的整合、移交和收尾是否满足或超过为了实现项目集的战略目标而规定的收益实现标准；制定移交计划，以促进收益在向受影响的运营领域移交时能够持续实现。•移交范围得以定义•项目集收益的衡量•维持计划得以制定•移交得以实施 5.收益维持收益维持阶段的目的是，当项目集结束后，由接收组织持续进行维护工作，以确保持续生成项目集所交付的改进与成果。项目集关闭后，由项目集提供的维持收益的职责可能会移交给另一个组织或另一项目集。收益可以通过运营、维护、新组件或其他工作来持续。收益维持计划应在项目集收尾前制定，用以识别必要的风险、流程、措施、衡量指标和必要的工具，以确保持续地实现交付收益。 四、项目集相关方参与项目集相关方参与是识别和分析相关方需求、管理期望和沟通，以促进相关方支持的绩效领域。相关方是指能够影响项目、项目集或项目组合的决策、活动或结果的个人、小组或组织，以及会受到或自认为会受到项目、项目集或项目组合的决策、活动或结果影响的个人、小组或组织。相关方可能来自项目内部，也可能来自项目外部，对项目集成果的影响可能积极，也可能消极。项目集经理和项目经理需要了解相关方的影响和影响力程度，以便了解和应对项目集与项目不断变化的环境。应对相关方进行识别、分析、分类和监督。与项目集资源不同，不是所有的相关方都可以直接管理，但他们的期望是可以管理的。很多情况下，外部相关方的影响力比项目集经理、项目集团队，甚至项目集发起人都更大。鉴于平衡相关方的利益对实现项目集收益可能产生的影响，或者相关方的利益存在内在冲突的性质，平衡这些利益非常重要。当在组织结构上没有从属关系时，人们倾向于抵制直接管理。因此，大多数项目集管理文献关注的都是相关方参与的概念，而不是相关方管理。 1.项目集相关方重要项目集相关方的例子包括但不限于：项目集发起人、项目集指导委员会、项目组合经理、项目集经理、项目经理、项目集团队成员、项目团队成员、出资组织、执行组织、项目集管理办公室、客户、潜在客户、供应商、监管机构、受影响的个人或组织、其他群体 1.1项目集相关方识别项目集相关方识别的目的是在相关方登记册中系统地识别所有重要相关方（或相关方群体）。这个登记册中列出了相关方，并进行相应分类，分类依据为相关方与项目集的关系、他们对项目集结果的影响能力、他们对项目集的支持程度以及项目集经理认为可能会影响相关方认识和项目集成果的其他特征或属性。相关方登记册的建立和维护应该使项目集团队成员易于参考，以便他们在报告、分配项目集可交付成果以及进行正式和非正式的沟通时使用。 1.2项目集相关方分析在相关方登记册中列入所有重要相关方后，项目集经理将对其进行分类并着手分析。分类将突出不同相关方的需求、期望或影响的差异。为了更好地理解组织文化、政治、与项目集相关的关注点以及项目集的总体影响，应从相关方获得关键信息。这些信息可以通过历史信息、个人访谈、焦点小组、问卷调查或调查获得。对于复杂的项目集，项目集经理可以编制一个相关方示意图，用于直观地表示所有相关方当前和期望的支持和影响之间的相互关系。用于相关方分析的另一种分类模型是权利/利益矩阵。它根据相关方的权限级别（权力）和他们对项目集成果的关注程度（利益）对相关方进行分组。 1.3项目集相关方参与规划项目集相关方参与计划规定了项目集相关方在整个项目集持续期间将如何参与。通过考虑组织战略计划、项目集章程和项目集商业论证，分析相关方登记册和相关方示意图，从而了解项目集将要运行的环境。作为相关方分析和相关方参与计划的一个组成部分，应关注相关方的以下几个方面：•对组织文化和变革的接受度•对项目集及其发起人的态度•适合相关方具体参与的相关阶段•对项目集收益交付的期望•对项目集收益的支持或反对程度•影响项目集成果的能力这项工作的成果是相关方参与计划，其中包括根据当前情况制定的、相关方有效参与的详细战略。该计划包括相关方参与的指导方针，并针对相关方如何参与项目集各组件提供了有关见解。该计划定义了衡量相关方参与活动的绩效指标。这些衡量指标可包括参加会议和其他沟通渠道的次数措施，主动或被动地支持或反对的程度，也可以努力去量化达成预定目标的有效性。应向项目集组件项目、子项目集和其他项目集活动提供相关方参与指导方针。 1.4项目集相关方参与相关方参与是一个持续的项目集活动，因为随着项目集的进展和收益交付，相关方的列表、态度以及意见都会发生变化。在整个项目集期间，项目集经理的主要角色之一是确保所有的相关方都能充分、适当地参与其中。识别相关方，映射他们的利益，并规划相关方参与将为这个过程提供直接支持。应经常参考和评估相关方登记册、相关方映射图和相关方参与计划，并根据需要进行更新。与相关方交互、促进相关方参与可使项目集团队在项目集收益及其与组织战略目标的相关性方面与相关方沟通。必要时，项目集经理可利用强大的沟通、谈判和冲突解决技巧，帮助平息相关方对项目集及其收益的反对。在相关方或相关方群体之间的期望发生冲突时，具有多样化相关方的大型项目集可能需要促进相关方及相关方群体的谈判。为了帮助相关方建立对项目收益交付的共同的高层级期望，项目集经理应向相关方提供项目集章程和项目集商业论证中包含的适当信息，其中可附上执行概要，以总结风险、依赖关系和收益的细节。 1.5项目集相关方沟通有效的沟通将在不同的相关方之间架起一座桥梁，这些相关方可能具有不同的文化和组织背景、不同的专业水平以及不同的观点和兴趣，所有这些都可能对项目集收益的交付造成冲击或影响。沟通是项目集相关方参与的核心。它是执行项目集工作并最终为组织带来收益的关键。这个关键组成部分是项目集团队成员之间进行信息共享、协商和协作的一个工具，其目的是推动项目集工作的实施。在项目集整个生命周期中，项目集经理都应该积极促进相关方参与，尤其是要关注那些权力和影响力大的重要相关方。可针对相关方登记册所列出的不同相关方而制定响应的战略。这反映了沟通的要求，例如应沟通哪些信息，包括语言、形式、内容和详细程度。它还可以形成一个反馈闭环，以讨论项目集变更和升级过程。由此产生的沟通方式的目标是获得相关方对项目集战略以及项目集收益交付的支持。某些相关方天生对项目集很好奇，并且经常提出问题。应该捕捉这些问题并发布答案，使多个相关方从中获益。很多情况下，针对特定相关方受众的文档可能需要以不同的形式呈现。重要的是，要为制定决策的相关方提供足够的信息，以便使他们能够在正确的时间做出正确的决策，推动项目集向前发展。项目集经理应持续监督变更，并根据需要更新相关方的参与活动和可交付成果。在许多项目集管理活动中，与某些相关方的沟通是与生俱来的。项目集经理应不断地监督和改善环境，以满足相关方沟通的需求。 五、项目集治理项目集治理是实现和执行项目集决策，为支持项目集而制定实践，并维持项目集监督的绩效领域。项目集治理包括为了满足组织战略和运营目标的要求，对项目集实施监督、管理和支持的框架、职能和流程。项目集治理的重点是通过建立系统和方法，供发起组织定义、授权、监督和支持项目集及其战略，从而实现项目集收益的交付。 1.项目集治理1.1项目集治理计划为了促进设计与实施有效的治理，许多组织都对每个项目集的治理框架、职能和流程进行文档化描述，项目集治理计划对这些描述进行总结。项目集治理计划的目的是描述用于监督、管理和支持给定项目集的系统和方法，以及为确保这些系统和方法得到及时有效使用而设置的特定角色的职责。在整个项目集持续期间都要参照此计划，以确保项目集符合既定的治理期望和协议。 1.1.1角色和职责的定义项目集治理计划描述治理参与者小组的结构和组成，定义关键相关方的角色和责任。该计划确定了谁将对关键决策类别和责任界限而当责和握权。 1.1.2规划的治理会议项目集治理计划应包含预期的项目集相关治理会议、活动和关键里程碑的进度计划例如计划的预期决策点审查（包括阶段关口审查）、项目集健康检查和要求的审计 1.1.3其他内容•依赖关系、假设和制约因素•收益、绩效指标和测量•支持服务•相关方参与•治理实践 1.2项目集治理愿景与目标组织的愿景和目标为推动大多数项目集定义的战略任务提供了基础。项目集治理确保其职权范围内的任何项目集都能确定其愿景和目标，以便有效支持组织的愿景和目标。 1.3项目集批准、支持和定义在大多数组织中，项目集治理概述了批准每个项目集的方法的职责，并计划如何实现项目集和组织目标，以及授权使用资源支持组件和其他项目集实现上述方法。这些批准发生在项目集定义阶段，并借助于两个项目集工件促进其执行：•项目集商业论证：作为项目集预期交付收益的正式预测，证明为交付收益所耗费资源的合理性。•项目集章程：授权项目集管理团队使用组织资源实施项目集，并将项目集与其商业论证和组织战略重点联系起来。 1.4项目集成功标准治理（可能在组织、项目组合或项目集层面）为成功的项目集建立可接受的最低标准，以及衡量、沟通和支持这些标准的方法。这些标准描述符合关键项目集相关方期望和需求的成功定义，加强项目集一致性，以尽可能实现最大收益。 1.5项目集监督、报告和控制项目集治理参与者具有独特的定位，可监督项目集达成组织目标的进度，同时与项目集经理合作，从而尽可能提高项目集的成功机会。为了支持组织监督项目集进度，并加强组织评估项目集状态和与组织控制的一致性的能力，许多组织定义了适用于所有项目集的标准化报告和控制流程。项目集治理负责强制项目集遵守这些流程。报告和控制文件可包括：•项目集、组件及相关活动的运行状态和进度；•预期或已产生的项目集资源需求；•已知项目集风险，应对计划和上报标准；•战略和运营的假设；•收益实现和预期的维持；•决策标准、跟踪和沟通；•项目集变更控制；•遵守公司和法律政策；•项目集信息管理；•问题和问题应对计划；•项目集资金和财务绩效。 1.6项目集风险和问题治理有效的风险和问题管理实践，可确保关键风险和问题得到适当上报，并及时解决。上报流程通常在两个层面上进行：（a）在项目集内，组件团队、项目集管理团队与项目集指导委员会之间；（b）在项目集外，项目集管理团队、项目集指导委员会和其他相关方之间。组织应对各级风险和问题升级的期望进行记录和传达，以确保组织明确定义其对治理相关方在适当时间参与的要求，以实现有效的风险和问题管理。根据组织的风险偏好，与组织治理和项目集管理团队合作，项目集治理可确定项目集风险临界值，以确保在整个项目集内遵守临界值限制。 1.7项目集质量治理质量治理对于项目集的成功至关重要，质量管理计划通常在组件层面执行，因此也在该层面上进行治理。治理参与者负责审查和批准质量管理的方法和质量衡量的标准。某些情况下，治理参与者可定义这些措施，其中包括：适用于项目集所有组件的最低质量条件和标准；对组件质量计划、质量控制和质量保证的最低要求；项目集层面所需的任何质量保证或质量控制活动；项目集层面所需的质量保证和质量控制活动的橘色和职责。 1.8项目集变更治理项目集治理在项目集变更授权中起着关键作用。项目集指导委员会负责定义由项目集经理独立授权批准的变更类型，以及在批准前需要进一步讨论的重要变更。实施监督、报告和控制措施后，治理参与者应具备良好的条件来评估针对项目集的计划方法或活动的建议变更。项目集经理评估与潜在变更相关的风险是否可接受或值得接受，建议的变更在操作上是否可行，在组织上是否支持，以及变更是否重要到需要项目集指导委员会批准。随后，项目集经理针对需要项目集治理参与者通过项目集指导委员会批准的变更提出建议。项目集治理可授权变更的范围，受到项目集商业论证和组织战略的限制。项目集团队记录建议的变更、变更理由和变更结果。 1.9项目集治理审查项目集治理支持在项目集生命周期中的关键决策点的项目集审查。这些审查通常在项目集的重要组成部分的发起或完成时进行，使项目集治理批准或反对项目集从一个重要组成部分进入另一个组成部分。这些审查还促进了在关键决策点上项目集所需的任何变更的审查和批准。关键决策点发生在项目集阶段结束时。阶段关口审查是指为做出进入下个阶段、进行整改或结束项目集或项目集组件的决定，而开展的阶段末审查。项目集治理通过这种审查，能够决定批准或反对项目集从一个重要阶段进入另一个重要阶段。 1.10项目集定期健康审查项目集定期健康检查通常在决策点审查之间进行，旨在评估项目集在实现和维持收益过程中的持续绩效和进度。当预定的决策点审查间隔延长时，这种审查的重要性和作用会增加。项目集治理计划针对健康检查期间需要使用的进度计划、内容、参与者以及评估（或指标）规定了相应治理要求。 1.11项目集组件启动和移交启动新项目集组件的批准通常包括：开发、修改或再次确认商业论证；确保执行该组件所需的资源的可用性；定义或再次确认管理和实施组件的个人最终责任；确保向关键相关方传达关于组件的重要信息；确保在项目集层面针对组件制定质量控制计划（必要时）；授权治理机构根据目标跟踪组件的进度。各个项目集组件的移交和收尾通常需要获得批准。对项目集组件移交或收尾建议的审查通常包括：确认已经充分满足组件的商业论证要求，或者应停止进一步追求组件的目标；确保在项目集层面针对组件的收尾与关键相关方进行适当的沟通；确保组件符合项目集层面的质量控制计划（必要时）；评估组织层面或项目集层面的经验教训，作为组件移交绩效的结果；确认项目或项目集移交或收尾的、所有其他公认的实践已得到满足。 1.12项目集收尾项目集指导委员会对项目集收尾的建议进行审查并作出决定。它评估项目集所根据的条件是否满足，以及项目集的收尾建议是否与当前的组织愿景、使命和战略一致。另一种情况是，项目集可能会被终止，原因是组织战略或环境发生变化导致项目集收益或需求减少。无论出于何种原因而终止项目集，都应执行收尾程序。在项目集收尾时，将项目集治理有效移交至运营治理非常重要，这将直接影响所实现的收益。在收尾期间，最终的项目集报告由治理参与者批准。 2.项目集治理角色在负责项目集治理和项目集管理的人员之间建立适当的合作关系，对于项目集成功实现组织所期望的收益至关重要。项目集经理依赖项目集指导委员会（也称为项目集治理委员会、监督委员会或董事会）的成员来建立组织条件，以便有效地实施项目集。项目集治理通常包括以下角色：•项目集发起人•项目集指导委员会•项目集管理办公室（PMO）•项目集经理•项目经理•其他相关方 2.1项目集发起人作为项目集指导委员会的成员或主席，项目集发起人对其职责不可或缺。组织必须选择适当的项目集发起人，然后使其有效地履行职责。发起人应有足够的时间和资源来促成项目集的成功，这往往需要发起人从其他管理和执行职责中脱身。发起人的才干、经验和可用性会影响项目集的有效性，在某些情况下，这将是项目集成功与否的关键。项目集发起人通常需要在整个组织推动变更，以便运营能够纳入项目集提供的能力，确保可用的正面收益，并且管理负面收益的处理。因此，发起人是沟通工作和相关方流程中不可或缺的角色。通常，有效的发起人具有以下属性：•影响相关方的能力；•跨不同相关方群体开展工作、找到互利的解决方案的能力；•领导力；•决策权；•有效的沟通技巧。 2.2项目集指导委员会大多数组织通过建立项目集指导委员会来确保项目集的适当管理，由该委员会负责定义和实施适当的治理实践。项目集指导委员会典型职责包括：为项目集提供治理支持，包括监督、控制、整合和决策职能；提供有能力的治理资源，监督与收益交付相关的项目集不确定性和复杂性；确保项目集目标和规划的收益符合组织战略和运营目标；举行计划会议，确认项目集，并为项目集进行优先级排序并提供资金；支持或批准项目集的建议和变更；解决和补救上报的项目集问题和风险；提供监督，使项目集收益得以规划、衡量并最终达成；领导决策制定、施行、执行和沟通；定义要传达给相关方的关键信息，并确保其保持一致、透明；审查预期收益和收益交付；批准项目集收尾或终止。 2.3项目集管理办公室项目集管理办公室（PMO）负责促进治理实践、它是对与项目集相关的治理流程进行标准化，并促进资源、方法、工具和技术共享的一种管理机构。它提供专业技能，通过使用训练有素的员工应用项目集治理实践为项目集提供监督、支持和决策能力。项目集管理办公室的角色可以扩展到监督项目集管理实践的合规性。项目集管理办公室的设计和组建应根据其环境而定制。例如，实施特大规模的复杂项目集的组织可能会建立多个项目集管理办公室，其中每个项目集管理办公室专门致力于实施组织的一个或多个关键项目集。另一方面，实施多个项目集的组织往往设立一个项目集管理办公室，作为项目集治理实践中的正式卓越中心，服务于不同项目集组成的项目组合，以此确保组织项目集的管理和治理实现高度的一致性和专业性。对于任何项目集，既可以建立项目集管理办公室，也可以利用现有的职能部门。根据项目集的背景，可为项目集管理办公室分配具有特定技能的人员，如变更和收益管理专家。 2.4项目集经理项目集经理是负责管理和监督项目集与项目集治理职能交互的个人。项目集经理经授权代表项目集指导委员会做出决策。对于这种约定授权之外的决策，项目集经理需要获得项目集指导委员会的授权。很多因素都可能影响授予项目集团队的权限，包括项目集经理的经验、项目集及其组件的规模和复杂程度，以及在较大组织环境中管理项目集所需的协调水平。项目集经理应确保项目集的目的和目标与组织的整体战略目标保持一致。与治理相关的典型职责包括：•评估治理框架，包括组织结构、政策和程序，并在某些情况下，建立项目集治理框架；•监督项目集与治理政策和流程的一致性；•管理项目集与指导委员会和发起人的交互；•管理项目集组件间的相互依赖关系；•监督和管理项目集的风险、绩效和沟通；•管理项目集风险和问题，并将超出项目集经理控制的关键风险和问题上报给指导委员会；•监督和报告项目集的整体资金和健康情况；•评估项目集的成果，并请求指导委员会的授权来变更项目集整体战略；•创建、监督及沟通项目集的综合路线图和内外部的关键依赖关系；•管理、监督和跟踪整体项目集收益的实现。 2.5项目经理在项目集的背景下，项目经理的角色一般是指负责监督或管理的项目的个人，这个项目是项目集的组成部分。在这种情况下，项目经理的职责采用《PMBOK指南》的规定。具体职责包括有效规划、执行和跟踪项目集组件项目，以及按照项目章程和项目集管理计划中定义的交付项目成果。在此方面，项目经理受到项目集经理（类似于项目集指导委员会的角色）和项目集团队的组件治理监督。虽然这种项目经理的角色并不一定是项目集治理的中心，但其治理相关职责通常包括：•管理项目与项目集经理】指导委员会和发起人的交互；•监督项目与治理政策和流程的一致性；•监督和管理绩效和沟通；•管理项目风险和问题，并将超出项目经理控制范围的关键风险和问题上报给项目集经理、发起人或指导委员会；•管理项目的内外部依赖关系；•促进关键相关方的参与。 2.6其他相关方若干其他相关方可能担任项目集治理的相关角色。按照组织实现预期收益的计划，项目组合经理可能在确保项目集的甄选、优先级排序和人员安排等方面担任角色。随着项目集的实施，将由业务代表（如职能代表和产品负责人）确保项目集的方向与终端客户可能不断变化的需求保持一致。当项目集向组织交付能力时，只有在组织准备好将这些能力整合到其运营中的情况下，才能实现预期或潜在的收益。运营经理通常负责接收和整合其他项目集组件交付的能力，以实现预期的组织收益。其他与治理相关的角色包括该领域某些方面的专家，例如风险专家、买方及合同专家，以便制定和治理与第三方供应商的协议。 3.项目集治理的设计与实施项目集治理从识别治理参与者和建立治理实践开始。项目集治理还需要对如何甄选相关治理角色和履行职责定义具体的期望。治理实践可能会因组织所在部门或行业的不同而有所不同。项目集治理设计会对项目集的成功产生至关重要的影响。设计项目集治理的规划和框架时需要考虑很多因素。对项目集治理进行优化和剪裁时，需要考虑的常见因素包括：立法环境决策层级优化治理与项目组合和组织治理保持一致项目集交付合同失败风险战略重要性项目集管理办公室（PMO）项目集资金机构 六、项目集生命周期管理1.项目集生命周期管理1.1项目集生命周期阶段概述项目集定义阶段。这个阶段包括：为达成预期成果而需要实施的授权项目集以及制定项目集路线图的项目集活动。制定项目集商业论证和项目集章程是项目集定义的一个部分。上述内容批准后，则要制定项目集管理计划。项目集交付阶段。项目集交付阶段包括为产生项目集管理计划各组件的预期成果而进行的项目集活动。此阶段将启动、计划、执行、移交和收尾项目集各组件，同时交付、移交并维持收益。项目集收尾阶段。此阶段包括为将项目集收益移交给维护组织、并以可控的方式正式结束项目集所必须进行的项目集活动。在项目集收尾期间，项目集移交和收尾，或提前终止，或者工作将移交给另一个项目集。 持续更新中","link":"/2021/08/23/Program-Management/"},{"title":"敏捷实践读书笔记","text":"一.简介1.敏捷型学习 面对面的交流、有意义的学习、自组织团队以及利用想象力的增量型学习、迭代型学习都是敏捷原则，这些原则可能改变人们在课堂上的思维模式，促进教育目标的实现。 2.颠覆性技术 向云计算的过渡，尤其促进了颠覆性技术的应用。全球各地的公司都在利用这种模式迅速廉价获取计算资源，以进入传统市场。 敏捷技术和敏捷方法将有效地管理各种颠覆性技术。 敏捷第一原则将客户满意视为最高要求，这也是交付让客户满意的产品和服务的关键。 形势的不断变化将继续促使大型组织采用敏捷思维模式，以保持竞争力和现有的市场份额。 为项目领导者和项目团队成员提供实践指导，帮助他们在项目规划和执行过程中适应敏捷方法。 并不仅仅是为了帮助计算机软件开发行业解决敏捷方法应用问题，超出软件业的敏捷应用也属于本实践指南的范围。 为保持竞争优势，与时俱进，各组织不能只关注内部，而是要放眼外部世界，关注客户体验。 本实践指南适用于对于预测法和敏捷方法难以取舍的项目团队，试图解决快速创新和复杂性问题的项目团队，以及致力于团队改进的项目团队。 本实践指南将提供有益的指导方针，它们将有助于项目取得成功，帮助项目团队顺利交付商业价值，满足客户的期望和需求。 二.敏捷概述1.可确定的工作与高度不确定的工作 项目工作包括可确定的工作与高度不确定的工作。可确定的工作项目具有明确的流程，它们在以往类似的项目中被证明是行之有效的。 随着可确定的工作日益实现自动化，项目团队也越来越多地从事高度不确定的工作，从事这些工作就需要使用本实践指南所述的有关技术。 传统预测法旨在预先确定大部分需求，并通过变更请求过程控制变更。而敏捷方法的出现是为了在短时间内探讨可行性，根据评估和反馈快速调整。 2.《敏捷宣言》及思维模式2.1《敏捷宣言》我们正在通过亲自开发和帮助他人开发，发现开发软件的更好方法。通过这项工作，我们开始更重视： 个体以及互动 而不是 过程和工具 可用的软件 而不是 完整的文档 客户合作 而不是 合同谈判 应对变更 而不是 遵循计划也就是说，右栏中的项目固然有价值，但我们更重视左栏中的项目。 2.2 十二项原则 1.我们的最高目标是，通过尽早持续交付有价值的软件来满足客户的需求。 2.欢迎对需求提出变更，即使在项目开发后期也不例外。敏捷过程要善于利用需求变更，帮助客户获得竞争优势。 3.要经常交付可用的软件，周期从几周到几个月不等，且越短越好。 4.项目实施过程中，业务人员与开发人员必须始终通力合作。 5.要善于激励项目人员，给予他们所需的环境和支持，并相信他们能够完成任务。 6.不论是对开发团队还是团队内部，信息传达最有效的方法都是面对面的交谈。 7.可用的软件是衡量进度的首要衡量标准。 8.敏捷过程提倡可持续的开发。项目发起人、开发人员和用户应该都能够始终保持步调稳定。 9.对技术的精益求精以及对设计的不断完善将提高敏捷性。 10.简洁，即尽最大可能减少不必要的工作，这是一门艺术。 11.最佳的架构、需求和设计将出自于自组织的团队。 12.团队要定期反省怎样做才能更有效，并相应地调整团队的行为。 2.3 敏捷方法 “敏捷方法”是一个囊括了各种框架和方法的涵盖性术语，指的是符合《敏捷宣言》价值观和原则的任何方法、技术、框架、手段或实践。 将敏捷方法和看板方法视为精益方法的子集，它们都是精益思想的具体实例，都反映了诸如“关注价值”、“小批量”和“消除浪费”的概念。 2.4 两种策略践行敏捷价值观和原则 第一种采用正规的敏捷方法，它们为特意设计，经证明可达成期望的成果。在变更和裁剪之前，就需要花时间学习和理解敏捷方法。不成熟和随意的裁剪会让敏捷方法的效果大打折扣，从而限制了收益。 第二种采用以一种适合项目背景的方式对项目实践进行变更，以便在核心价值观或原则方面取得进展。使用时间盒创建功能，或者使用特定技术迭代优化功能。 在适用于特定项目背景下，考虑将一个大项目划分为几部分发布。实现有助于项目成功的变更，这些变更不必是组织的正式实践的组成部分。 最终目标不是为了敏捷而敏捷，而是为了向客户持续交付价值流，并达成更好的商业成果。 3.精益与看板方法 看板方法从精益制造构思而来，也围绕精益制造，但更广泛地应用于敏捷环境中。 将敏捷和看板方法视为精益思想的衍生物。 精益思想是一个超集，与敏捷和看板方法拥有共性。 重点在于交付价值、尊重人、减少浪费、透明化、适应变更以及持续改善等方面。 无论使用什么方法，目标都是为了实现最佳结果。 看板方法专门用于知识型工作，但不如某些敏捷方法规范，破坏性也较小，原因在于它是原始的“原地出发”方法。 在有必要或适当的情况下，项目团队可以相对轻松地应用看板方法，并向其他敏捷方法发展。 4.不确定性、风险和生命周期选择 团队选择的生命周期要能够通过较少的工作增量解决项目的大量不确定性问题。 团队可以利用较少的工作增量验证自身的工作，并且可以对接下来的工作做出相应变更。 与静态书面规范相比，当团队交付小的增量时，他们能够更快更准确地理解真正的客户需求。 团队可以用明确稳定的管理要求规划并管理项目，轻松解决各种技术挑战。 随着项目不确定性的增加，变更、做无用功和返工的可能性也会随之增加，而这不仅代价高昂，而且耗费时间。 通过构建一个小的增量，然后对其进行测试和评估，团队可以在短时间内以低成本探索不确定性，降低风险，最大程度地实现商业价值的交付。 不确定性可能集中于适用性和需求（正在构建的产品是否正确？）。 技术可行性和性能（产品是否可以采用这种方法构建？）。 或过程和人员（这是否为团队工作的一种有效方式？）。 三个特点（产品规格、生产能力和过程适用性）通常都具有高度不确定性因素。 迭代和增量管理方法也有其应用局限性。当技术和需求的不确定性都很高时，项目就会极端复杂，陷入无序状态。 为了使项目尽可能可靠，需要遏制其中一个变量（不确定性或分歧）。 三.生命周期选择四种生命周期包括： •预测型生命周期。这是一种更为传统的方法，提前进行大量的计划工作，然后一次性执行；执行是一个连续的过程。 •迭代型生命周期。这种方法允许对未完成的工作进行反馈，从而改进和修改该工作。 •增量型生命周期。这种方法向客户提供各个己完成的，可能立即使用的可交付成果。 •敏捷生命周期。这种方法既有迭代，也有增量，便于完善工作，频繁交付。 1.项目生命周期的特征 计划始终贯穿其中,敏捷项目也有计划。 通过对频繁交付的可交付成果的评审，团队将能获得更多的信息，从而在此基础上进行计划和重新计划。 无论采用哪种项目生命周期，项目都需要计划。 1.1预测型生命周期的特征 预测型生命周期预计会从高确定性的明确的需求、稳定的团队和低风险中获益。 团队需要详细的计划，了解要交付什么以及怎样交付。 1.2迭代型生命周期的特征 迭代型生命周期通过连续的原型或概念验证来改进产品或成果。 团队可能会在长达数周时间的一个特定迭代中使用时间盒，集中各种见解，然后根据这些见解对活动进行返工。 1.3增量型生命周期的特征 有些项目优化是为了加快交付速度。 客户愿意接受整个解决方案的一个部分。 少量可交付成果的频繁交付。 1.4敏捷生命周期的特征 对于建立在流程基础上的敏捷方法，团队将根据自身能力，从待办事项列表中提取若干功能开始工作，而不是按照基于迭代的进度计划开始工作。 团队定义任务板各列的工作流，并管理各列的进行中的工作。 团队让进行中的工作的规模尽量小，以便尽早发现问题，并在需要变更时减少返工。 无需利用迭代定义计划和审核点，而由团队和业务相关方决定规划、产品评审与回顾的最适当的进度计划。 1.5敏捷适用性筛选器 有各种评估模型可用来帮助确定使用敏捷方法的适合性或差距。 这些模型评估项目和具有适应性和适用性的组织因素，然后提供分数表明一致性或潜在风险领域。 1.6混合生命周期的特征 对于整个项目，没有必要使用单一的方法。 为达到特定的目标，项目经常要结合不同的生命周期要素。 预测、迭代、增量和/或敏捷方法的组合就是一种混合方法。 1.7结合了敏捷和预测的方法 在同一项目中结合使用了预测法和敏捷方法。也许团队正在逐渐地向敏捷过渡，并使用一些方法，如短迭代、每日站会和回顾。 但在项目的其他方面，如前期评估、工作分配和进度跟踪等，仍然遵循了预测法。 1.8以预测法为主、敏捷方法为辅的方法 以敏捷方法处理具有不确定性、复杂性或范围蔓延机会项目的一部分，而使用预测法管理项目的其余部分。 1.9以敏捷方法为主、预测法为辅的方法 当某个特定要素不可协商，或者使用敏捷方法不可执行时，可能会使用这种方法。 1.10符合目的的混合生命周期 当组织无法交付中间价值时，敏捷方法可能不是很有用。这样没有问题，但为了敏捷而敏捷并不是目标。 要选择一个对项目、风险和文化管理有用的生命周期或生命周期的组合。 敏捷关乎频繁向客户交付。而这种交付要给团队带来反馈。团队利用上述反馈规划并重新规划下一部分的工作。 1.11混合型生命周期作为过渡策略 许多团队无法在一夜之间切换到敏捷工作方式。对于那些己经习惯于预测型环境、并在其中获得成功的人士，敏捷技术的观感截然不同。 组织越大，活动部件越多，转换需要的时间就越长。因此，计划一个渐进的过渡是有意义的。 2.混合敏捷方法 敏捷团队很少将其实践局限于一种敏捷方法。 每个项目背景都有其各自的独特性。 敏捷框架并不是针对团队定制的。 为了定期交付价值，团队可能需要对实践进行裁剪。 3.影响裁剪的项目因素 有时为了更好地配合，根据项目属性对方法进行裁剪。 四、实施敏捷：创建敏捷环境1.从敏捷思维模式开始以下问题的答案将有助于制定实施策略 •项目团队如何以敏捷方式行动？ •为了使下一交付周期受益，团队需要快速交付哪些成果并获得早期反馈？ •团队如何以一种透明的方式行动？ •为了专注于高优先级的项目，可以避免哪些工作？ •仆人式领导对团队达成目标有何益处？ 2.仆人式领导为团队赋权 仆人式领导是通过对团队服务来领导团队的实践，它注重理解和关注团队成员的需要和发展，旨在使团队尽可能达到最高绩效。 仆人式领导的作用是促进团队发现和定义敏捷。 仆人式领导实践并传播敏捷。 仆人式领导可以帮助他们的团队通过合作更快地交付价值。 成功的敏捷团队信奉成长思维模式，团队成员自己能够学到新技能。 如果团队和仆人式领导都相信自己能够学习，那么所有人的能力都能得到提高。 2.1仆人式领导的职责 仆人式领导通过管理关系，在团队内和组织中建立沟通与协作。 这些关系可以帮助领导在组织中得心应手地为团队提供支持。 这种支持有助于消除障碍，促进团队理顺过程。 仆人式领导的促进作用 项目经理成为仆人式领导时，工作重点就会从“管理协调”转向“促进合作”。 促进者帮助每个人各尽所能地思考和工作。 促进者鼓励团队参与、理解，并对团队输出共同承担责任。 仆人式领导要通过成为公正的搭桥者和教练，而不是代替他责任人做出决策。 仆人式领导消除组织障碍 对仆人式领导而言，更好的职责是认真审视那些阻碍团队敏捷或组织敏捷的过程，并努力使其合理化。 仆人式领导还应该关注其他冗长的过程，这些过程往往造成瓶颈问题，阻碍团队或组织的敏捷性。 仆人式领导为他人贡献铺路 仆人式领导注重为团队铺路，让团队尽其所能。 仆人式领导影响项目，鼓励组织以不同方式思考。 人际关系技能与专业技能 除仆人式领导外，团队成员还要重视自身的人际关系技能和情商技能，而不仅仅是专业技能。 考虑这些仆人式领导的职责 教育相关方，使其了解为什么要敏捷以及如何敏捷。 通过指导、鼓励和帮助为团队提供支持。 倡导团队成员的培训和职业发展。 通过技术项目管理活动，如量化风险分析来帮助团队。 庆祝团队的成功，为团队与外部团队合作提供支持，并起到桥梁作用。 项目经理的价值不在于他们的岗位，而在于他们能够让每个人都变得更好。 2.2项目经理在敏捷环境中的角色 项目经理在敏捷项目中的角色有些是未知的，原因是许多敏捷框架和方法都不涉及项目经理的角色。 2.3项目经理应用仆人式领导 从事敏捷项目工作时，项目经理的角色就会从团队的中心转变成为团队和管理人员提供服务。 在敏捷环境中，项目经理充当仆人式领导，其工作重点转变为引导需要帮助的人，促进团队的合作，保持与相关方的需要一致。 作为仆人式领导，项目经理要鼓励将责任分配给团队成员，分配给那些掌握完成任务所需知识的人。 3.团队构成 敏捷优化了价值流，强调了向客户快速交付功能，而不是怎样“用”人。 要善于激励项目人员，为他们提供所需的环境和支持，信任他们能够完成工作。 团队在考虑如何优化价值流时，以下好处是显而易见的： •人员更有可能合作。 •团队更快地完成有价值的工作。 •由于不从事多任务，也不必重新建立环境，团队减少了时间浪费。 3.1敏捷团队 敏捷团队注重快速开发产品，以便能获得反馈。 在实践中，最有效的敏捷团队往往由三到九个成员组成。 理想情况下，敏捷团队应该集中在一个团队工作场所工作。 团队成员100%为专职成员。 敏捷鼓励自我管理团队，由团队成员决定谁执行下一阶段定义的范围内的工作。 敏捷团队与仆人式领导一起茁壮成长。领导支持团队的工作方法。 3.2敏捷的角色 •跨职能团队成员 •产品负责人 •团队促进者 3.3通才型专家 许多成功的敏捷团队都由通才型专家组成，他们也称为T型人才。 团队成员在具备一项擅长的专业化技能的同时，还拥有多种技能的工作经验，而不是单一的专业化。 由于密切协作和自我组织，敏捷团队成员才能够敏捷开发并迅速完成工作，而这就需要使互相帮助成为常态。 3.4团队结构 有些组织己经能够建立集中办公的跨职能团队；还有组织有不同的情况。 有些组织并不是所有团队成员都为集中办公，而是拥有分布式或分散式团队。 分布式团队可以在不同地点拥有多个跨职能团队。分散式团队可能会让各团队成员分别在不同的地点工作，或在办公室，或在家里。 3.5专职小组成员 当人员100%为团队专职工作时，团队最有可能最快地产出。 多任务处理会降低团队工作的产出，并影响团队预测交付能力的一致性。 当团队中所有的人都被分配到一个项目时，他们能够作为一个团队持续协作，从而使每个人的工作更加有效。 不是所有的团队都拥有自身需要的所有角色。 对每个人（专家和团队）设定期望，阐明团队承诺交付的水平。 分配兼职人员会给项目带来风险。 3.6团队工作场所 团队需要一个工作场所，他们可以一起工作，了解他们作为团队的状态，并进行协作。 有些敏捷团队的所有成员都集中在一个房间里工作。 有些团队拥有一个团队工作场所用于开例会以及张贴各种图表，但团队成员分别在各自的小隔间或办公室里独立工作。 拥有在不同地点工作的成员时，团队会决定他们各自的工作场所有多少是虚拟的，多少是实际的。 在不同地点工作的团队成员需要虚拟的工作空间。另外，要考虑让团队成员定期聚集一堂，以便建立信任，学习怎样开展合作。 分散式团队管理沟通的一些技术包括鱼缸窗口和远程结对。 通过在团队分布的各个地点之间建立长期视频会议链接，创建一个鱼缸窗口。每天工作开始时，人们打开链接，工作结束时，关闭链接。通过这种方式，人员可以自然地看到彼此并进行互动，减少了身处不同地点工作所固有的协作滞后问题。 通过使用虚拟会议工具来共享屏幕，包括语音和视频链接，建立远程结对。只要考虑了时区差异因素，这种方法几乎和面对面的结对一样有效。 3.7克服组织孤岛 孤岛组织往往给跨职能敏捷团队的组建带来重重障碍。 来自不同职能部门、拥有不同技能的人员共同组成团队。 培养管理者和领导的敏捷思维模式，在敏捷开发早期就让他们参与其中。 为克服组织孤岛问题，就要与团队成员的不同管理者合作，让他们为跨职能团队安排必要的专职人员。 作为敏捷项目领导，首先要把重点放在如何组建跨职能团队，让所有团队成员100%投入团队工作。 五、实施敏捷：在敏捷环境中交付1.项目章程和团队章程 敏捷团队需要有团队规范以及对一起工作方式的理解。这种情况下，团队可能需要一个团队章程。 制定章程的过程能帮助团队学习如何一起工作，怎样围绕项目协作。 对于敏捷项目而言，团队至少还需要项目愿景或目标，以及一组清晰的工作协议。 仆人式领导可以促进章程的制定过程。 只要团队知道如何一起工作，制定章程就不需要一个正式的过程。 制定团队社会契约的基础： •团队价值观 •工作协议 •基本规则 团队的社会契约，即团队章程，将规定团队成员之间彼此互动的方式。 团队章程的目标是创建一个敏捷的环境，在这个环境中，团队成员可以发挥他们作为团队的最大能力。 2.常见敏捷实践2.1回顾 最重要的一个实践，原因是它能让团队学习、改进和调整其过程。 可以帮助团队从之前的产品开发工作及其过程中学习。 2.2待办事项列表编制 待办事项列表是所有工作的有序列表，它以故事形式呈现给团队。 考虑使用影响地图查看产品如何组合在一起。 正常情况下，由产品负责人领导这项工作。 产品负责人根据团队的实际成果重新规划路线图。 2.3待办事项列表的细化 在基于迭代的敏捷中，产品负责人往往在迭代中期的一次或多次会议中与团队合作，为即将进行的迭代准备一些故事。 这些会议的目的是细化足够的故事，让团队了解故事的内容，以及故事之间的相互关系。 2.4每日站会 团队成员利用每日站会对彼此做出小的承诺，发现问题，并确保团队工作顺利进行。 为每日站会规定时间盒，不超出15分钟。 团队以某种方式“过一下”看板或任务板，而团队中的任何人都可以主持站会。 要鼓励任何团队成员主持会议而不是由项目经理或领导主持，以确保它不会变成状态报告会议，而是作为团队进行自我组织和相互承诺的会议。 2.5展示/评审 当团队以用户故事的形式完成特定功能时，团队会定期展示工作产品。 看过展示后，产品负责人接受或拒绝故事。 2.6规划基于迭代的敏捷 不同团队的能力各不相同。 不同产品负责人的典型故事大小也各不相同。 团队应考虑自身故事大小，避免提交更多的故事，而超出团队在一个迭代中所能完成工作的能力。 2.7帮助团队交付价值的执行实践 •持续集成 •在不同层面测试 •验收测试驱动开发（ATDD） •测试驱动开发（TDD）和行为驱动开发（BDD） •刺探（时间盒研究或实验） 2.8迭代和增量如何帮助交付工作产品 团队应该经常为反馈进行演示，并展示进度。 鼓励PMO和其他感兴趣的人观看演示，以便决定项目组合的人能够看到实际的进展。 3.解决敏捷项目的挑战 出于解决具有高变化率、不确定性和复杂性的项目相关问题的需要，敏捷方法应运而生。 由于这些原因，敏捷方法包含了各种各样的工具和技术，用于处理预测法中出现的问题。 4.敏捷项目的衡量指标 使用敏捷意味着要审视对团队和管理层都很重要的新指标。这些衡量指标很重要，因为它们关注的是客户价值。 状态报告的一个问题是，团队预测完成或使用交通灯状态来描述项目的能力。 敏捷项目的衡量指标包含有意义的信息，这些信息提供了历史记录，因为敏捷项目要定期交付价值（完成的工作）。 替代衡量指标（如完成百分比）不如经验指标（如己完成功能）更有用。 除了定量指标之外，团队还可以考虑收集定性衡量指标。例如，对交付功能的业务满意度、团队的士气；团队希望跟踪的任何东西等都是定性衡量指标。 4.1敏捷团队的衡量结果 敏捷倾向于使用基于经验和价值的衡量指标，而不是预测型衡量指标。 敏捷衡量团队所交付的成果，而不是团队预测将交付的成果。 由于学习是项目的重要组成部分，因而，团队需要在平衡不确定性的同时为客户提供价值。 许多敏捷团队使用故事点估算工作量。燃尽图中的虚线表示计划。 对新建的敏捷团队，燃起图将显示迭代过程中范围内的变化。 当团队依赖于外部人员或团队时，衡量周期时间可了解团队完成工作所需的时间。 团队完成工作之后，衡量交付周期可了解外部依赖关系。 团队还可以测量反应时间，从准备就绪到第一列的时间，了解平均需要多长时间才能对新请求做出响应。 燃起图、燃尽图（能力衡量指标）和交付周期，以及周期时间（可预测的衡量指标）可帮助团队了解他们共有多少工作，以及团队是否能按时完成工作。 累积流图显示了看板上进行中的工作。如果一个团队有许多等待测试的故事，测试团队将会扩大。累积工作可一目了然。 六、关于项目敏捷性的组织考虑因素 每个项目都存在于组织环境下。文化、结构和政策可能会影响到所有项目的方向和成果。这些动态变化可能会对项目领导提出挑战。 项目领导可能无法根据自己的意愿来改变组织动态变化，但可以有技巧地引导这些动态变化。 1.组织变革管理1.1变革管理驱动因素 所有项目都涉及到变革。但是，有两种主要因素会进一步激励敏捷环境中变革管理实践的应用： •与加速交付相关的变革 •与敏捷方法相关的变革 1.2变革就绪情况 组织在开始采用敏捷方法时应了解这些方法与其当前方法之间的相对兼容性。 项目领导可以尝试多种方法来加速文化兼容性： •积极明确的管理层支持 •变革管理实践，包括沟通和引导 •逐个项目应用敏捷实践 •向团队增量地引入敏捷实践 •通过采取适用的敏捷技术和实践示范引导 2.组织文化 组织文化就是组织的DNA-组织的核心标识。文化始终影响敏捷方法的使用。 组织文化一直在连续运转，从高预测型计划到一切皆为实验的精益创业阶段均有体现。 2.1创建安全环境 尝试构建安全的工作环境。 只有在安全、诚实和透明的环境中，团队成员和领导才可以真正反思其成功，确保项目持续进步，或者应用从失败项目中所吸取的教训，不再重蹈覆辙。 2.2评估文化 项目领导可能感觉其职责就是满足各个相关方的期望；但是在面对选择时，通常需要根据组织业务环境的文化和要求来确定优先级。 要引导这些动态变化，项目领导应花费时间去评估组织通常所关注的重点。 有一些模型可用于评估这些动态变化；但是，采取何种模型或方法并不重要，关键是让项目领导了解其环境的驱动因素。 3.采购和合同 协作方法提倡共担项目风险和共享项目奖励的关系，实现所有方共赢。 合同签署技术包括： •多层结构 •强调价值交付 •总价增量 •固定时间和材料 •累进的时间和材料 •提前取消方案 •动态范围方案 •团队扩充 •支持全方位供应商 4.商业实践 在需求产生时，组织创建新能力的意愿和能力即是组织敏捷性的标志。 在跨职能团队交付价值时，团队和个人可能会遇到组织多种支持职能方面的问题。 当组织发展到更高敏捷性时，其他业务部门将有必要更改其交互方式并履行自己的职责。 现在应拥护对组织其他领域有益的变更，以此来提高整个组织的效率。 5.多团队协作和依赖关系（扩展） 多个项目之间会产生依赖关系，即使不是在给定项目集中进行管理。 5.1框架 大多数流行敏捷方法的指导专注于单个小型且通常是集中办公的跨职能团队活动。 目前己出现许多框架和方法来应对需要在一个项目集或项目组合中进行多个敏捷团队协作的情况。 5.2考虑事项 团队可能需要将多个敏捷项目工作扩展到单个敏捷项目集中。或者，组织可以设计出支持整个项目组合中不同敏捷方法的结构。 无论采用哪种方法，关键成功因素是健康的敏捷团队。 如果单个团队采取敏捷方法无法获得成功，则勿尝试将其扩展到更大范围；而是要先行解决阻止团队敏捷工作的组织障碍。 大规模敏捷项目的目标是协调不同团队的工作以便为客户提供价值。 团队可以采用正式的框架或应用敏捷思维调整现有项目集管理实践。 6.敏捷和项目管理办公室（PMO） 设立PMO的目的是引导组织实现商业价值。 PMO还会针对给定项目或项目集提供相关商业价值方面的管理建议。 6.1敏捷PMO为价值驱动型 所有项目都应在合适的时间为合适的受众提供合适的价值。PMO的目标是帮助促进这个目标的实现。 基于敏捷的PMO方法以客户协作思维为基础，并存在于所有PMO项目集中。 有些项目可能需要工具和模板，还有些项目可能会从管理层引导中获益。 PMO应努力按需交付并紧跟客户需求，确保了解并适应他们的需求。 6.2敏捷PMO为面向创新型 为了在基于价值的章程下加速发展，PMO可能需要强制执行某些解决方案或方法，例如，保持所有人行动的一致性以快速获得成功。 6.3敏捷PMO为多学科型 为了支持特定项目需求，PMO还需要熟悉项目管理本身以外的其他一些能力，因为不同的项目要求不同的能力。 例如，一个项目可能需要组织设计来解决人员配备挑战，而另一个项目可能需要组织变革管理技术来确保相关方参与或获得独特的业务模型以支持客户目标。 7.组织结构 组织结构会严重影响其转向新信息或转变市场需求的能力。 下面列出了主要特征： •地理 •职能结构 •项目可交付成果的大小 •项目人员分配 •重采购型组织 8.组织演变 应对单个挑战领域或实施新的混合或敏捷方法时，建议以累积方式承接工作。 常用实践是将变更过程视为一个敏捷项目，团队可以根据自己的价值观或其他考虑事项引入自己的变更待办事项列表并确定其优先级。 每个变更可以被视为一个实验，将进行短时间测试以确定。 每个变更的适应性以及进一步细化/考虑需求。 使用看板面板跟踪进度，显示已作为“已完成”使用的新方法、被视为“进行中”的方法、以及仍在等待被引入“待办事项”的方法。 通过使用工具来组织和管理变更实施，将可提供进度的可视化并对正在实施的方法进行建模。以透明和吸引人的方式部署变更，将可以提高成功可能性。 七、行动呼吁 如今，“敏捷”呼声前所未有地高涨起来。由于业内对敏捷的最佳途径还存在争议，围绕该主题的讨论仍甚嚣尘上，并且不断涌现出更多的创新。 有一个真理永恒不变，那就是：检查、适应和透明度是成功交付价值的关键因素。 附录 描述了一些常用的敏捷方法。这些方法可以单独或结合使用，以调整适应特定环境或情况。 1.Scrum Scrum是用于管理产品开发的单个团队过程框架。 该框架包含Scrum角色、事件、工件和规则，采用迭代方法来交付工作产品。 Scrum是运行在1个月或更少时间的时间盒上的，其中包含持续时间一致的多个冲刺，在这些冲刺中会产生潜在可发布的产品增量。 Scrum团队包含产品负责人、开发团队和Scrum主管。产品负责人负责实现产品价值的最大化。 开发团队是一个跨职能自组织团队，其开发成员拥有所需的一切资源，可在不依赖团队外部其他资源的情况下交付工作产品。 Scrum主管负责确保Scrum过程获得相应支持且Scrum团队遵从实践和规则，并指导团队消除障碍。 2.极限编程 极限编程（XP）是一种基于频繁交付周期的软件开发方法。 基于这样一个理念：将特定最佳实践提炼到最纯粹和最简单的形式，然后在整个项目周期内持续运用该实践。 旨在改进软件项目成果的整套实践。该方法最初包含十二种主要实践，随后逐渐演变，采用了一些其他推论实践。 该演变是通过筛选核心价值观（沟通、简洁、反馈、勇气、尊重）并根据主要原则信息来设计和采用技术的结果。 3.看板方法 看板在精益制造中是一种用于规划库存控制和补给的系统。 看板方法应用并适用于多种场合，可以确保工作流和价值交付的持续性。 在看板方法中可以使用迭代，但应始终遵循在整个过程中持续拉取单个条目并限制在制品以优化流程的原则。 有以下需要时，则看板方法最为适用： •灵活性 •专注于持续交付 •提高工作效率和质量 •提高效率 •团队成员专注力 •工作负载的可变性 •减少浪费 看板方法是一种整体性组织增量演变过程和系统变更框架。 在看板方法中，完成工作比开始新工作更为重要。 4.水晶方法 水晶是一种方法论家族。 水晶方法论旨在根据项目规模（项目中涉及的人员数量）以及项目的关键性来量化并提供方法严格程度选择。 水晶方法认识到每个项目可能需要一系列轻量剪裁的策略、实践和过程，以匹配项目的独特特征。 5.Scrumban Scrumban是一种敏捷方法，最初设计为Scrum到看板之间的过渡方法。 在Scrumban中，工作被分解到许多小的“冲刺”，并利用看板面板来可视化和监督工作。 将故事列在看板面板上，团队通过使用在制品限制来管理其工作。 通过召开每日例会来维持团队之间的协作并消除阻碍。 Scrumban看板中没有预定义角色一团队保留其当前角色。 6.功能驱动开发 功能驱动开发（FDD）的开发目的是满足大型软件开发项目的特定需求。 小型商业价值功能重视能力。 功能驱动开发项目中有六个主要角色，每个人可以担任以下一个或多个角色： •项目经理 •首席架构师 •开发经理 •首席编程人员 •类负责人 •领域专家 功能驱动开发项目分为五个过程或活动，以迭代方式执行： •开发整个模型 •构建功能列表 •依据功能规划 •依据功能设计 •依据功能构建 由一组核心软件工程最佳实践提供支持 7.动态系统开发方法 动态系统开发方法（DSDM）是一种敏捷项目交付框架，该框架开发为行业领导者之间的非商业性协作方式。 强调制约因素驱动交付而著称。 该框架从一开始便可设置成本、质量和时间，然后利用正式的范围优先级来满足这些制约因素的要求。 通过八个原则来指导DSDM框架的使用： •专注于业务需求 •准时交付 •协作 •在质量上永不妥协 •在坚实的基础上进行增量式构建 •迭代开发 •保持持续和明晰的沟通 •演示控制（使用适当的技术） 8.敏捷统一过程 敏捷统一过程（AgileUP）是软件项目中统一过程（UP）的分支。 与紧前统一过程相比，该过程具有加速周期和轻量级的过程。 目的在于在七个主要因素之间执行更多迭代的周期，并在正式交付之前纳入相关反馈。 9.扩展框架 Scrum of Scrums(SoS)也称为“meta Scrum” 由两个或多个Scrum团队而不是一个大型Scrum团队所使用的一种技术 一个团队包含三到九名成员来协调其工作 具有多个团队的大型团队可能要求执行Scrum of Scrum of Scrums，其遵循的模式与SoS相同，每个SoS代表向更大组织的代表报告 10.大规模敏捷框架 大规模敏捷框架SAFe专注于为所有级别企业的大规模开发工作提供模式知识库。 SAFe专注于以下原则： •采用经济视角 •应用系统思维 •假设可变性、预留方案 •以快速整合的学习周期进行增量式构建 •根据对工作系统的客观评估设定里程碑 •直观显示并限制在制品，减小批次规模并管理队列长度 •应用节奏、与跨域规划同步 •解锁知识员工的内在动力 •决策分散化 SAFe专注于在项目组合、项目集和团队层详细设定实践、角色和活动，强调围绕专注于向客户提供持续价值的价值流来组织企业。 11.大规模敏捷开发（LeSS） 一种以扩展Scrum方法为共同目标来组织多个开发团队的框架，其核心组织原则是尽可能保留传统单个团队Scrum模型的元素。 有助于减少任何模型扩展，避免造成不必要的混乱或复杂性。 12.企业Scrum 企业Scrum是一种旨在通过更整体性组织层而不是单个产品开发层来应用Scrum方法的框架。 该框架尤其建议组织领导： •将所有Scrum应用扩展到所有组织方面 •普及Scrum技术以便在这些不同的方面轻松应用 •根据需要使用补充技术扩展Scrum方法 其目的在于通过实现颠覆性创新将敏捷方法扩展到项目执行范围以外。 13.规范敏捷（DA） 规范敏捷（DA）是一种在综合模型中整合多种敏捷最佳实践的过程决策框架。 DA旨在平衡专注范围过于狭窄（如Scrum）或细节过于规范（如AgileUP）的流行方法。 为实现这种平衡，该方法根据以下原则混合了多种敏捷技术： •以人为先 •面向学习 •完全交付生命周期 •目标驱动 •企业意识 •可扩展 术语表（中文排序）1.首字母缩略词ATDD 验收测试驱动开发BDD 行为驱动开发BRD 业务需求文档DA 规范敏捷DoD 完成的定义DoR 准备就绪的定义DSDM 动态系统开发方法EVO 渐进价值交付LeSS 大规模敏捷开发LSD 精益软件开发PDCA 计划 — 实施 — 检查 — 行动PMO 项目管理办公室ROI 投资回报率RUP 统一软件开发过程SAFe® 大规模敏捷框架®SBE 实例化需求XP 极限编程 2. 定义A3 A3: 它是一种思维方式及一种解决问题的系统化过程将相关信息囊括在一张 A3 大小的纸上。DevOps DevOps: 它是通过改善开发和运营员工之间的协作来理顺交付流程的各种实践的集合。I 型人才 I-shaped: 它是指深入掌握单一专业技能的人员他们不具备团队所需的其他技能或对其不感兴趣。IDEAL IDEAL: 它是一种组织改进模型以所描述的五个阶段命名启动、诊断、确立、执行和学习。Scrum Scrum: 它是一种复杂产品开发与维持的敏捷框架它由特定的角色、事件和工件等元素组成。Scrum of Scrums Scrum of Scrums: 它是指一种多个团队围绕同一产品实施大规模敏捷开发工作的技术他们需要协调讨论其相互依赖关系重点是如何整合软件的交付在重叠的领域尤为如此。Scrum 主管 Scrum Master: 它是指开发团队的教练和Scrum框架中的产品负责人。其负责消除障碍促进富有成效的事件并保护团队免受干扰。Scrumban Scrumban: 它是一种在团队选择Scrum作为工作方式时产生的管理框架它以看板方法作为透镜从而审视、理解并持续改善其工作。Scrum板 Scrum Board: 它是一种用于管理产品代办事项列表和冲刺代办事项列表的信息发射源它能显示工作流及其瓶颈。Scrum团队 Scrum Team: 它是指在敏捷开发中开发团队、Scrum 主管和产品负责人的总和。T 型人才 T-shaped: 它是指深入掌握单一专业技能并广泛掌握团队所需其他技能的人员。测试驱动开发 Test-Driven Development: 它是在工作开始前定义测试的一种技术它采用零缺陷的思维模式使工作进度能持续得到确认。产品待办事项列表 Product Backlog: 它是指团队围绕某产品维护的一个以用户为中心的需求的有序列表。产品负责人 Product Owner: 它是指负责使产品实现最大价值的人员其对所创建的终端产品负责并承担最终责任。持续交付 Continuous Delivery: 它是立即向客户交付功能增量的实践往往通过采用小批量工作和自动化技术实现。持续整合 Continuous Integration: 它是一种对团队各成员的工作产品经常整合并彼此确认的实践。冲刺 Sprint: 它描述敏捷开发中的时间盒迭代。冲刺代办事项列表 Sprint Backlog: 它是指由Scrum团队识别的、需要在Sprint中完成的工作事项列表。冲刺计划 Sprint Planning: 它是指敏捷开发中的一个协作事件其中团队为目前的冲刺制定工作计划。刺探 Spike: 它是指项目中短暂的时间间隔通常长度固定在此期间团队开展研究或针对方案的某个方面进行原型研究验证其可行性。大规模敏捷开发 (LeSS) Large-Scale Scrum (LeSS): 大规模敏捷开发是一种产品开发框架它根据扩展指导方针扩大敏捷开发规模同时保留原有的敏捷开发目的。大规模敏捷框架 (SAFe®) Scaled Agile Framework (SAFe®): 它是一个集成模式的知识库用于企业范围的精益开发。代码集体所有 Collective Code Ownership: 它是一种项目加速和协作技术其中任何团队成员都有权修改任何项目工作产品或可交付成果它强调整个团队的责任和最终责任。待办事项列表的细化 Backlog Refinement: 它是对项目需求和/或正在进行的活动的渐进明细其中团队协作参与需求的审核、更新和撰写以满足客户需求。单循环学习 Single Loop Learning: 它是指未根据经验提出质疑、仅仅利用预先确定的特定方法解决问题的实践。迭代 Iteration: 它是产品或可交付成果开发的一个时间盒循环其中需要执行交付价值所需的所有工作。迭代型生命周期 Iterative Life Cycle: 它是一种允许对未完成工作提供反馈从而对工作加以改善和修改的方法。动态系统开发方法 (DSDM) Dynamic Systems Development Method (DSDM): 它是一种敏捷项目交付框架。反模式 Anti-Pattern: 它是一种已知的、有缺陷的、不可取的工作模式。方针管理 Hoshin Kanri: 它是指一种策略或政策的部署方法。服务请求管理者 Service Request Manager: 它是指在连续工作流或看板环境中负责整理服务请求、旨在实现最大价值的人员。它相当于产品负责人。服务型领导 Servant Leadership: 它是一种向团队提供服务的领导实践重点是理解并解决团队成员的需求和发展尽可能提高团队的绩效。符合目的 Fit for Purpose: 符合预期目的的产品。改善活动 Kaizen Events: 它是指旨在对系统加以改善的活动。工作流主管 Flow Master: 它是指在连续工作流或看板环境下工作的团队教练和服务请求管理者。它相当于Scrum 主管。功能规范 Functional Specification: 它是指某系统或应用需要实现的一种特定功能。它通常体现在功能规范文档中。功能驱动开发 Feature-Driven Development: 它是一种从客户重视的功能角度出发的轻量级敏捷软件开发方法。功能需求 Functional Requirement: 它是指某产品或服务应完成的一个特定行为。孤岛组织 Siloed Organization: 它是指以只能部分满足向客户交付价值的需求的方式构建的组织。请对照参见价值流。故事点 Story Point: 它是用于相关用户故事估算技术中的一种无量纲指标。规范敏捷 (DA) Disciplined Agile (DA): 它是指一种过程决策框架其能够围绕增量和迭代解决方案的交付 来简化过程决策。滚动式规划 Rolling Wave Planning: 一种迭代式的规划技术对近期要完成的工作进行详细规划对远期工作只做粗略规划。行为驱动开发 (BDD) Behavior-Driven Development (BDD): 它是一种系统设计和确认实践采用测试优先的原则和类似英语的脚本。回顾 Retrospective: 它是一种定期进行的研讨活动其中参与者针对其工作和工作成果进行探讨旨在对过程和产品做出改进。混合方法 Hybrid Approach: 它是指两种或两种以上敏捷或非敏捷要素的组合具有非敏捷最终结果。混合敏捷 Blended Agile: 它是指同时使用两种或两种以上的敏捷框架、方法、要素或实践例如Scrum与极限编程和看板的结合使用。极限编程 eXtreme Programming: 它是一种敏捷软件开发方法不仅能提高软件质量、改善软件对不断变化的客户需求的响应能力还能缩短软件版本发布周期增加发布频率。计划 — 执行 — 检查 — 行动 (PDCA) Plan–Do–Check–Act (PDCA): 它是组织中的一种迭代管理方法旨在促进过程和产品的控制和持续改善。技术债务 Technical Debt: 它是指产品生命周期早期未能完成工作的递延成本。价值流 Value Stream: 它是一种组织性结构重点关注通过特定产品或服务交付流向客户的价值。价值流图 Value Stream Mapping: 一种用于记录、分析和改善为客户生产产品或提供服务时所需的信息或材料流的精益企业技术。渐进价值交付 (Evo) Evolutionary Value Delivery (Evo): 它是公认的首要敏捷方法拥有其他方法所不具备的特点重点关注向相关方交付多种可衡量的价值需求。渐进明细 Progressive Elaboration: 随着信息越来越多、估算越来越准确进而不断提高项目管理计划的详细程度的迭代过程。节奏 Cadence: 它是指项目执行节奏。另请参见时间盒。结对编程 Pair Programming: 主要指编程的结对工作。结对工作 Pair Work: 它是一种由两名团队成员结对、同时从事同一工作项目的技术。精益软件开发 (LSD) Lean Software Development (LSD): 精益软件开发是软件开发领域的精益制造原理和实践它基于一套旨在满足质量、速度和客户定位要求的原理和实践。看板方法 Kanban Method: 它是一种受到看板库存控制系统启发的敏捷方法专门用于知识工作。看板面板 Kanban Board: 它是一种可视化工具能够通过瓶颈和工作量的有形呈现改善工作流。跨职能团队 Cross-Functional Team: 它是指由实践者组成的团队这些实践者掌握交付有价值产品增量所需的各种技能。框架 Framework: 它是指一种比某种特定方法更为通用的方法。冒烟测试 Smoke Testing: 它是指利用一组轻量级测试确保正在开发的系统实现最重要的预期功能的实践。每日例会 Daily Scrum: 它是指每天召集的一种简短的协作会议其中团队将回顾前一天的进展宣布当天的计划强调曾遇到或预期出现的障碍。也称为每日站会。敏捷 Agile: 它是用于描述反映了《敏捷宣言》所述价值观和原则的思维模式的一个术语。敏捷教练 Agile Coach: 它是指掌握了敏捷知识和经验的人员其在组织和团队转型中能够发挥培训、辅导和指导的作用。敏捷生命周期 Agile Life Cycle: 它是一种迭代兼增量方法用于优化工作项目增加交付频率。敏捷实践者 Agile Practitioner: 它是指接受敏捷思维模式、在跨职能团队中与志同道合的同事开展协作的人。也称为敏捷专家。敏捷思维模式 Agile Mindset: 它是一种思维和行为方式其植根于《敏捷宣言》的四大价值观和十二条原则。敏捷统一过程 Agile Unified Process: 它是在业务应用软件开发中应用敏捷技术和思想的一种简单且便于理解的方法。它是统一软件开发过程 (RUP) 的简化版本。敏捷宣言 Agile Manifesto: 它是敏捷价值观和原则的最初官方定义。敏捷原则 Agile Principles: 它是指《敏捷宣言》中所体现的敏捷项目交付的十二条原则。“破梳齿”人才 Broken Comb: 它是指对团队所需的多种技能掌握程度深浅不一的人。也称为“颜料滴洒”人才。群集 Swarming: 它是指一种团队多个成员合作、重点消除特定障碍的技术。群体开发 Mobbing: 它是一种工作技术其中多名团队成员围绕某个具体工作项目同时协调工作。燃尽图 Burndown Chart: 它是剩余工作与时间盒内剩余时间关系的一种图形化表示形式。燃起图 Burnup Chart: 它是对已完成工作与产品发布关系的一种图形化表示形式。人物角色 Personas: 它代表一组类似终端用户的典型用户通过其目标、动机和具有代表性的个人特征描述。生命周期 Life Cycle: 它是指产品从构想、创造到投入使用的过程。时间盒 Timebox: 它是指一段固定时间例如 1 周、2 周、3 周或 1 个月。另请参见迭代。实例化需求 (SBE) Specification by Example (SBE): 它是为软件产品定义需求和定义面向商业的功能测试的一种协作方法基于使用实例获取并阐明需求而不是抽象陈述需求。适合使用 Fit for Use: 以当前形式使用能实现其预期目的的产品。双循环学习 Double-Loop Learning: 它是一种质疑潜在的价值和假设的过程其目的不是仅关注征兆而是为了更好地阐述根本原因制定改善对策。水晶家族方法论 Crystal Family of Methodologies: 它是轻量级敏捷软件开发方法的集合其重点关注特定情况的适应性。完成的定义 (DoD) Definition of Done (DoD): 它是团队需要满足的所有标准的核对单只有可交付成果满足该核对单才能视为准备就绪可供客户使用。项目管理办公室 (PMO) Project Management Office (PMO): 对与项目相关的治理过程进行标准化并促进资源、方法论、工具和技术共享的一种管理架构。信息发射源 Information Radiator: 它是一种可见的实物展示其向组织内其他成员提供信息在不干扰团队的情况下即时实现知识共享。验收测试驱动开发 (ATDD) Acceptance Test-Driven Development (ATDD): 它是一种协作制定验收测试标准的方法用于创建交付前的验收测试。业务需求文档 (BRD) Business Requirement Documents (BRD): 它是某特定项目的所有需求列表。影响地图 Impact Mapping: 它是一种战略规划技术被组织作为打造新产品的路线图。用户故事 User Story: 它是针对特定用户的可交付成果价值的简要描述。它是对澄清细节对话的承诺。用户故事地图 User Story Mapping: 它是一种将工作纳入一个应用模型的可视化实践旨在帮助理解随着时间推移而创建的高价值功能集发现待办事项列表中的遗漏有效规划向用户交付价值的软件发布。用户体验 (UX) 设计 UX Design: 它是一种促进用户体验的过程重点改善用户与产品互动中的可用性和可访问性。预测法 Predictive Approach: 它是一种工作管理方法在整个项目生命周期中应用工作计划和管理工作计划。预测型生命周期 Predictive Life Cycle: 它是一种更为传统的方法大部分规划在前期进行随后一次性执行它是一个连续的过程。增量 Increment: 它是一种经过测试、验收的实用可交付成果也是项目总体成果的组成部分。增量型生命周期 Incremental Life Cycle: 它是一种提供已完工的、客户可立即使用的可交付成果的方法。障碍 Impediment: 它是指妨碍团队达成其目标的干扰因素。也称为阻碍。重构 Refactoring: 它是一种产品质量技术其通过提高产品的可维护性和其他需要的属性来改善产品设计同时并不改变产品的预期行为。转向 Pivot: 它是指计划中的方向修正旨在检测产品或策略的新假设。准备就绪的定义 (DoR) Definition of Ready (DoR): 它是团队以用户需求为中心的核对单其中包括团队开始工作所需的全部信息。自动化代码质量分析 Automated Code Quality Analysis: 它是用于检测代码库缺陷和漏洞的脚本化测试。自组织团队 Self-Organizing Team: 它是一种跨职能团队其中为实现团队目标团队成员根据需要轮换着发挥领导作用。组织变革管理 Organizational Change Management: 它是一种全面的、周期性的、结构化方法旨在使个人、群组和组织在从当前状态转换为未来状态时实现预期的业务收益。组织偏好 Organizational Bias: 组织偏好是指组织对一组衡量指标的选择。这组衡量指标具有如下核心价值探索与执行、速度与稳定性、数量与质量、灵活性与可预测性。","link":"/2021/03/27/Agile-Study/"},{"title":"PMBOK学习笔记","text":"项目管理知识体系指南第 6 版（主要内容） 1 引论1.1指南概述和目的项目管理并非新概念，它已存在数百年之久。项目成果是领导者和项目经理在工作中应用项目管理实践、原则、过程、工具和技术的结果。项目经理运用一系列关键技能和知识来满足客户和参与项目或受项目影响的其他人的要求。PMI 将项目管理知识体系 (PMBOK) 定义为描述项目管理专业范围内知识的术语。项目管理知识体系包括已被验证并广泛应用的传统做法，以及本专业新近涌现的创新做法。项目经理与项目团队和其他相关方携手合作，共同确定并采用适用于各个项目且被普遍认可的良好实践。确定过程、输入、工具、技术、输出和生命周期阶段的恰当组合以管理项目的过程，即指本指南所述知识的“裁剪”应用。 1.1.1项目管理标准《项目管理标准》是 PMI 项目管理专业发展计划和项目管理实践的基本参考资料。由于项目管理需要根据项目需求进行调整，标准和指南均基于描述性实践，而不是规范性实践。因此，标准确认了在大多时候都被大多数项目视作良好实践的过程。另外，标准还确认了通常与这些过程相关的输入和输出。标准不要求执行任何特定过程或实践。项目经理可以采用一种或多种方法论执行本标准所描述的项目管理过程。本指南的范围仅限于项目管理领域，而不涉及任何项目组合、项目集和多个项目的领域；仅在与项目有关时才会提及项目组合和项目集。 1.1.2通用词汇通用词汇是专业学科的基本要素。本指南的词汇表包含了《术语词典》中的词汇以及其他定义。项目可能会采用由行业文献定义的相关行业特定的术语。 1.1.3道德与专业行为规范全球项目管理业界定义的最重要的价值观是责任、尊重、公正和诚实。《道德与专业行为规范》确立了这四个价值观的基础地位。《道德与专业行为规范》包括期望标准和强制标准。期望标准描述了身为 PMI 会员、证书持有者或志愿者的从业者力求遵循的行为规范。强制标准做出了硬性要求，在某些情况下限制或禁止从业者的某些行为。 1.2基本要素描述了从事项目管理和了解项目管理领域所需的基本要素。 1.2.1项目项目是为创造独特的产品、服务或成果而进行的临时性工作。独特的产品、服务或成果。 开展项目是为了通过可交付成果达成目标。 目标指的是工作所指向的结果，要达到的战略地位，要达到的目的，要取得的成果，要生产的产品，或者准备提供的服务。 可交付成果指的是在某一过程、阶段或项目完成时，必须产出的任何独特并可核实的产品、成果或服务能力。可交付成果可能是有形的，也可能是无形的。临时性工作。 项目的“临时性”是指项目有明确的起点和终点。“临时性”并不一定意味着项目的持续时间短。 虽然项目是临时性工作，但其可交付成果可能会在项目的终止后依然存在。项目驱动变更。 项目驱动组织进行变更。从商业角度来看，项目旨在推动组织从一个状态转到另一个状态，从而达成特定目标。 在项目开始之前，通常将此时的组织描述为“当前状态”。项目驱动变更是为了获得期望的结果，即“将来状态”。 有些项目可能会创造一个过渡状态，即由多个步骤组成的连续区间，以过渡到将来状态。项目创造商业价值。 项目的商业价值指特定项目的成果能够为相关方带来的效益。 项目带来的效益可以是有形的、无形的或两者兼有之。项目启动背景。 组织领导者启动项目是为了应对影响该组织的因素。这些因素会影响组织的持续运营和业务战略。 领导者应对这些因素，以便组织持续运营。项目为组织提供了一个有效的途径，使其能够成功做出应对这些因素所需的变更。 这些因素最终应与组织的战略目标以及各个项目的商业价值相关联。 1.2.2项目管理的重要性项目管理就是将知识、技能、工具与技术应用于项目活动，以满足项目的要求。项目管理通过合理运用与整合特定项目所需的项目管理过程得以实现。项目管理使组织能够有效且高效地开展项目。项目是组织创造价值和效益的主要方式。在当今商业环境下，组织领导者需要应对预算紧缩、时间缩短、资源稀缺以及技术快速变化的情况。商业环境动荡不定，变化越来越快。为了在全球经济中保持竞争力，公司日益广泛利用项目管理，来持续创造商业价值。有效和高效的项目管理应被视为组织的战略能力。 1.2.3项目、项目集、项目组合以及运营管理之间的关系概述项目管理过程、工具和技术的运用为组织达成目的和目标奠定了坚实的基础。一个项目可以采用三种不同的模式进行管理：作为一个独立项目（不包括在项目组合或项目集中）、在项目集内或在项目组合内。如果在项目组合或项目集内管理某个项目，则项目经理需要与项目集和项目组合经理互动合作。项目集是一组相互关联且被协调管理的项目、子项目集和项目集活动，以便获得分别管理所无法获得的利益。项目组合是指为实现战略目标而组合在一起管理的项目、项目集、子项目组合和运营工作。项目集管理和项目组合管理的生命周期、活动、目标、重点和效益都与项目管理不同；项目组合、项目集、项目和运营通常都涉及相同的相关方，还可能需要使用同样的资源，而这可能会导致组织内出现冲突。这种情况促使组织增强内部协调，通过项目组合、项目集和项目管理达成组织内部的有效平衡。在开展组织和项目组合规划时，要基于风险、资金和其他考虑因素对项目组合组件排列优先级。项目组合方法有利于组织了解战略目标在项目组合中的实施情况，还能促进适当项目组合、项目集和项目治理的实施和协调。项目集和项目管理的重点在于以“正确”的方式开展项目集和项目；项目组合管理则注重于开展“正确”的项目集和项目。项目集管理项目集管理指在项目集中应用知识、技能与原则来实现项目集的目标，获得分别管理项目集组成部分所无法实现的利益和控制。项目集组成部分指项目集中的项目和其他项目集。项目管理注重项目本身的相互依赖关系，以确定管理项目的最佳方法。项目集管理注重作为组成部分的项目与项目集之间的依赖关系，以确定管理这些项目的最佳方法。项目组合管理项目组合是指为实现战略目标而组合在一起管理的项目、项目集、子项目组合和运营工作。项目组合管理是指为了实现战略目标而对一个或多个项目组合进行的集中管理。项目组合中的项目集或项目不一定彼此依赖或直接相关。项目组合管理还可确定项目组合是否符合组织战略。运营管理运营管理是另外一个领域，超出了本指南所描述的规范的项目管理范围。运营管理关注产品的持续生产和（或）服务的持续运作。它使用最优资源满足客户要求，来保证业务运作的持续高效。它重点管理那些把各种输入（如材料、零件、能源和劳力）转变为输出（如产品、商品和（或）服务）的过程。运营与项目管理业务或组织运营的改变也许就是某个项目的关注焦点，尤其当项目交付的新产品或新服务将导致业务运营的有实质性改变时。持续运营不属于项目的范畴，但是它们之间存在交叉。在每个交叉点，可交付成果及知识在项目与运营之间转移，以完成工作交接。组织级项目管理 (OPM) 和战略标的实现项目组合、项目集和项目均需符合组织战略，或由组织战略驱动，并以不同的方式服务于战略目标的实现。OPM指为实现战略目标而整合项目组合、项目集和项目管理与组织驱动因素的框架。OPM旨在确保组织开展正确的项目并合适地分配关键资源。OPM有助于确保组织的各个层级都了解组织的战略愿景、支持愿景的举措、目标以及可交付成果。 1.2.4指南的组成部分项目包含几个关键组成部分，如果有效管理这些组成部分，项目才能成功完成。本指南识别并阐述了这些组成部分，各个组成部分在项目管理期间相互关联。项目和开发生命周期项目生命周期指项目从启动到完成所经历的一系列阶段。它为项目管理提供了一个基本框架。项目生命周期内通常有一个或多个阶段与产品、服务或成果的开发相关，这些阶段称为开发生命周期。开发生命周期可以是预测型、迭代型、增量型、适应型或混合型的模式： 预测型生命周期，在生命周期的早期阶段确定项目范围、时间和成本。对任何范围的变更都要进行仔细管理。预测型生命周期也称为瀑布型生命周期。 迭代型生命周期，项目范围通常于项目生命周期的早期确定，但时间及成本估算将随着项目团队对产品理解的不断深入而定期修改。迭代方法是通过一系列重复的循环活动来开发产品，而增量方法是渐进地增加产品的功能。 增量型生命周期是通过在预定的时间区间内渐进增加产品功能的一系列迭代来产出可交付成果。只有在最后一次迭代之后，可交付成果具有了必要和足够的能力，才能被视为完整的。 适应型生命周期属于敏捷型、迭代型或增量型。详细范围在迭代开始之前就得到了定义和批准。适应型生命周期也称为敏捷或变更驱动型生命周期。项目生命周期与产品生命周期相互独立，后者可能由项目产生。产品生命周期指一个产品从概念、交付、成长、成熟到衰退的整个演变过程的一系列阶段。项目阶段项目阶段是一组具有逻辑关系的项目活动的集合，通常以一个或多个可交付成果的完成为结束。生命周期的各个阶段可以通过各种不同的属性来描述。项目可以分解为不同的阶段或子组件，这些阶段或子组件的名称通常说明了该阶段完成的工作类型。项目阶段可基于各种因素而建立，其中包括（但不限于）： 管理需求； 项目性质； 组织、行业或技术的独特性； 项目的组成要素，包括但不限于技术、工程、业务、过程或法律； 决策点（例如资金、继续/终止项目，里程碑审查）。分为多个阶段的方式有助于更好地掌控项目管理，同时还提供了评估项目绩效并在后续阶段采取必要的纠正或预防措施的机会。项目阶段的其中一个关键组成部分是阶段审查。阶段关口阶段关口在项目阶段结束时进行，将项目的绩效和进度与项目和业务文件比较。在不同的组织、行业或工作类型中，阶段关口可能被称为阶段审查、阶段门、关键决策点和阶段入口或阶段出口。项目管理过程项目生命周期是通过一系列项目管理活动进行的，即项目管理过程。每个项目管理过程通过合适的项目管理工具和技术将一个或多个输入转化成一个或多个输出。输出可以是可交付成果或结果。结果是过程的最终成果。项目管理过程适用于全球各个行业。各项目管理过程通过它们所产生的输出建立逻辑联系。过程可能包含了在整个项目期间相互重叠的活动。项目管理通过合理运用与整合按逻辑分组的项目管理过程而得以实现。过程迭代的次数和过程间的相互作用因具体项目的需求而不同。过程通常分为三类： 仅开展一次或仅在项目预定义点开展的过程。例如制定项目章程以及结束项目或阶段。 根据需要定期开展的过程。在需要资源时执行获取资源。在需要采购之前执行实施采购。 贯穿项目始终执行的过程。在整个项目生命周期中可能执行的过程定义活动，特别是当项目使用滚动式规划或适应型开发方法时。从项目开始到项目结束需要持续开展许多监控过程。项目管理过程组项目管理过程可分为以下五个项目管理过程组： 启动过程组：定义一个新项目或现有项目的一个新阶段，授权开始该项目或阶段的一组过程。 规划过程组：明确项目范围，优化目标，为实现目标制定行动方案的一组过程。 执行过程组：完成项目管理计划中确定的工作，以满足项目要求的一组过程。 监控过程组：跟踪、审查和调整项目进展与绩效，识别必要的计划变更并启动相应变更的一组过程。 收尾过程组：正式完成或结束项目、阶段或合同所执行的过程。项目管理知识领域知识领域指按所需知识内容来定义的项目管理领域，并用其所含过程、实践、输入、输出、工具和技术进行描述。本指南确定了大多数情况下大部分项目通常使用的十个知识领域。本指南描述的十个知识领域包括：项目整合管理 包括为识别、定义、组合、统一和协调各项目管理过程组的各个过程和活动而开展的过程与活动。项目范围管理 包括确保项目做且只做所需的全部工作以成功完成项目的各个过程。项目进度管理 包括为管理项目按时完成所需的各个过程。项目成本管理 包括为使项目在批准的预算内完成而对成本进行规划、估算、预算、融资、筹资、管理和控制的各个过程。项目质量管理 包括把组织的质量政策应用于规划、管理、控制项目和产品质量要求，以满足相关方的期望的各个过程。项目资源管理 包括识别、获取和管理所需资源以成功完成项目的各个过程。项目沟通管理 包括为确保项目信息及时且恰当地规划、收集、生成、发布、存储、检索、管理、控制、监督和最终处置所需的各个过程。项目风险管理 包括规划风险管理、识别风险、开展风险分析、规划风险应对、实施风险应对和监督风险的各个过程。项目采购管理 包括从项目团队外部采购或获取所需产品、服务或成果的各个过程。项目相关方管理 包括用于开展下列工作的各个过程：识别影响或受项目影响的人员、团队或组织，分析相关方对项目的期望和影响，制定合适的管理策略来有效调动相关方参与项目决策和执行。项目管理数据和信息在整个项目生命周期中需要定期收集和分析项目数据。关于项目数据和信息的主要术语定义如下：工作绩效数据。 在执行项目工作的过程中，从每个正在执行的活动中收集到的原始观察结果和测量值。 项目数据通常记录在项目管理信息系统 (PMIS)和项目文件中。工作绩效信息。 从各控制过程收集，并结合相关背景和跨领域关系进行整合分析而得到的绩效数据。工作绩效报告。 为制定决策、提出问题、采取行动或引起关注，而汇编工作绩效信息所形成的实物或电子项目文件。 1.2.5裁剪由于每个项目都是独特的，所以有必要进行裁剪；并非每个项目都需要《PMBOK® 指南》所确定的每个过程、工具、技术、输入或输出。裁剪应处理关于范围、进度、成本、资源、质量和风险的相互竞争的制约因素。各个制约因素对不同项目的重要性不一样，项目经理应根据项目环境、组织文化、相关方需求和其他变量裁剪管理这些制约因素的方法。在裁剪项目管理时，项目经理还应考虑运行项目所需的各个治理层级，并考虑组织文化。还需要考虑来自于组织内部还是外部的项目客户也可能会影响项目管理的裁剪决定。合理的项目管理方法论需要考虑项目的独特性，允许项目经理做出一定程度的裁剪。 1.2.6项目管理商业文件项目经理需要确保项目管理方法紧扣商业文件的意图。项目发起人通常负责项目商业论证文件的制定和维护。项目经理负责提供建议和见解，使项目商业论证、项目管理计划、项目章程和项目效益管理计划中的成功标准相一致，并与组织的目的和目标保持一致。项目经理应适当地为项目裁剪上述项目管理文件。某些组织会维护项目集层面的商业论证和效益管理计划。项目经理应与相应的项目集经理合作，确保项目管理文件与项目集文件保持一致。项目商业论证项目商业论证指文档化的经济可行性研究报告，用来对尚缺乏充分定义的所选方案的收益进行有效性论证，是启动后续项目管理活动的依据。商业论证列出了项目启动的目标和理由。它有助于在项目结束时根据项目目标衡量项目是否成功。商业论证是一种项目商业文件，可在整个项目生命周期中使用。在项目启动之前通过商业论证，可能会做出继续/终止项目的决策。需求评估通常是在商业论证之前进行，包括了解业务目的和目标、问题及机会，并提出处理建议。需求评估结果可能会在商业论证文件中进行总结。通过将成果与目标和确定的成功标准进行比较，商业论证文件为衡量整个项目生命周期的成功和进展奠定了基础。项目效益管理计划项目效益管理计划描述了项目实现效益的方式和时间，以及应制定的效益衡量机制。项目效益指为发起组织和项目预期受益方创造价值的行动、行为、产品、服务或成果的结果。项目生命周期早期应确定目标效益，并据此制定效益管理计划。项目效益管理计划的制定和维护是一项迭代活动。它是商业论证、项目章程和项目管理计划的补充性文件。项目经理与发起人共同确保项目章程、项目管理计划和效益管理计划在整个项目生命周期内始终保持一致。项目章程和项目管理计划项目章程是由项目发起人发布的，正式批准项目成立，并授权项目经理动用组织资源开展项目活动的文件。项目管理计划是描述如何执行、监督和控制项目的一份文件。项目成功标准关于项目成功的定义和最重要的因素，项目相关方可能有不同的看法。明确记录项目目标并选择可测量的目标是项目成功的关键。主要相关方和项目经理应就这些问题达成共识并予以记录。项目成功可能涉及与组织战略和业务成果交付有关的其他标准。这些项目目标可能包括（但不限于）：完成项目效益管理计划； 达到商业论证中记录的已商定的财务测量指标。这些财务测量指标可能包括（但不限于）： 净现值 (NPV)； 投资回报率 (ROI)； 内部报酬率 (IRR)； 回收期 (PBP)； 效益成本比率 (BCR)。 达到商业论证的非财务目标； 完成组织从“当前状态”转到“将来状态”； 履行合同条款和条件； 达到组织战略、目的和目标； 使相关方满意； 可接受的客户/最终用户的采纳度； 将可交付成果整合到组织的运营环境中； 满足商定的交付质量； 遵循治理规则； 满足商定的其他成功标准或准则（例如过程产出率）。为了取得项目成功，项目团队必须能够正确评估项目状况，平衡项目要求，并与相关方保持积极主动的沟通。但在业务环境中，如果项目能够与组织的战略方向持续保持一致，那么项目成功的概率就会显著提高。有可能一个项目从范围/进度/预算来看是成功的，但从商业角度来看并不成功。这是因为业务需要和市场环境在项目完成之前发生了变化。 2 项目运行环境2.1概述项目所处的环境可能对项目的开展产生有利或不利的影响。这些影响的两大主要来源为事业环境因素(EEF) 和组织过程资产 (OPA)。事业环境因素源于项目外部（往往是企业外部）的环境，事业环境因素可能对整个企业、项目组合、项目集或项目产生影响。组织过程资产源于企业内部，可能来自企业自身、项目组合、项目集、其他项目或这些的组合。除了事业环境因素和组织过程资产，组织系统对项目生命周期也起着重要的作用。 2.2事业环境因素事业环境因素（EEFs）是指项目团队不能控制的，将对项目产生影响、限制或指令作用的各种条件。这些条件可能来自于组织的内部和（或）外部。事业环境因素是很多项目管理过程，尤其是大多数规划过程的输入。这些因素可能会提高或限制项目管理的灵活性，并可能对项目结果产生积极或消极的影响。从性质或类型上讲，事业环境因素是多种多样的。有效开展项目，就必须考虑这些因素。 2.2.1组织内部的事业环境因素以下是组织内部的事业环境因素： 组织文化、结构和治理。例如包括愿景、使命、价值观、信念、文化规范、领导风格、等级制度和职权关系、组织风格、道德和行为规范。 设施和资源的地理分布。例如包括工厂位置、虚拟团队、共享系统和云计算。 基础设施。例如包括现有设施、设备、组织通讯渠道、信息技术硬件、可用性和功能。 信息技术软件。例如包括进度计划软件工具、配置管理系统、进入其他在线自动化系统的网络界面和工作授权系统。 资源可用性。例如包括合同和采购制约因素、获得批准的供应商和分包商以及合作协议。 员工能力。例如包括现有人力资源的专业知识、技能、能力和特定知识。 2.2.2组织外部的事业环境因素以下是组织外部的事业环境因素： 市场条件。例如包括竞争对手、市场份额、品牌认知度和商标。 社会和文化影响与问题。例如包括政治氛围、行为规范、道德和观念。 法律限制。例如包括与安全、数据保护、商业行为、雇佣和采购有关的国家或地方法律法规。 商业数据库。例如包括标杆对照成果、标准化的成本估算数据、行业风险研究资料和风险数据库。 学术研究。例如包括行业研究、出版物和标杆对照成果。 政府或行业标准。例如包括与产品、生产、环境、质量和工艺有关的监管机构条例和标准。 财务考虑因素。例如包括货币汇率、利率、通货膨胀率、关税和地理位置。 物理环境要素。例如包括工作环境、天气和制约因素。 2.3组织过程资产组织过程资产是执行组织所特有并使用的计划、过程、政策、程序和知识库，会影响对具体项目的管理。组织过程资产包括来自任何（或所有）项目执行组织的，可用于执行或治理项目的任何工件、实践或知识，还包括来自组织以往项目的经验教训和历史信息。组织过程资产可能还包括完成的进度计划、风险数据和挣值数据。组织过程资产是许多项目管理过程的输入。由于组织过程资产存在于组织内部，在整个项目期间，项目团队成员可对组织过程资产进行必要的更新和增补。组织过程资产可分成以下两大类： 过程、政策和程序； 组织知识库。第一类资产的更新通常不是项目工作的一部分，而是由项目管理办公室 (PMO) 或项目以外的其他职能部门完成。第二类资产是在整个项目期间结合项目信息而更新的。例如，整个项目期间会持续更新与财务绩效、经验教训、绩效指标和问题以及缺陷相关的信息。 2.3.1过程、政策和程序组织用于执行项目工作的流程与程序，包括（但不限于）：启动和规划 指南和标准，用于裁剪组织标准流程和程序以满足项目的特定要求； 特定的组织标准，例如政策（如人力资源政策、健康与安全政策、安保与保密政策、质量政策、采购政策和环境政策）； 产品和项目生命周期，以及方法和程序（如项目管理方法、评估指标、过程审计、改进目标、核对单、组织内使用的标准化的过程定义）； 模板（如项目管理计划、项目文件、项目登记册、报告格式、合同模板、风险分类、风险描述模板、概率与影响的定义、概率和影响矩阵，以及相关方登记册模板）； 预先批准的供应商清单和各种合同协议类型（如总价合同、成本补偿合同和工料合同）。执行、监控： 变更控制程序，包括修改组织标准、政策、计划和程序（或任何项目文件）所须遵循的步骤，以及如何批准和确认变更； 跟踪矩阵； 财务控制程序（如定期报告、必需的费用与支付审查、会计编码及标准合同条款等）； 问题与缺陷管理程序（如定义问题和缺陷控制、识别与解决问题和缺陷，以及跟踪行动方案）。 资源的可用性控制和分配管理； 组织对沟通的要求（如可用的沟通技术、许可的沟通媒介、记录保存政策、视频会议、协同工具和安全要求）； 确定工作优先顺序、批准工作与签发工作授权的程序； 模板（如风险登记册、问题日志和变更日志）； 标准化的指南、工作指示、建议书评价准则和绩效测量准则； 产品、服务或成果的核实和确认程序。收尾 项目收尾指南或要求（如项目终期审计、项目评价、可交付成果验收、合同收尾、资源分配，以及向生产和（或）运营部门转移知识） 2.3.2组织知识库组织用来存取信息的知识库，包括（但不限于）： 配置管理知识库，包括软件和硬件组件版本以及所有执行组织的标准、政策、程序和任何项目文件的基准； 财务数据库，包括人工时、实际成本、预算和成本超支等方面的信息； 历史信息与经验教训知识库（如项目记录与文件、完整的项目收尾信息与文件、关于以往项目选择决策的结果及以往项目绩效的信息，以及从风险管理活动中获取的信息）； 问题与缺陷管理数据库，包括问题与缺陷的状态、控制信息、解决方案以及相关行动的结果； 测量指标数据库，用来收集与提供过程和产品的测量数据； 以往项目的项目档案（如范围、成本、进度与绩效测量基准，项目日历，项目进度网络图，风险登记册，风险报告以及相关方登记册）。 2.4组织系统2.4.1概述运行项目时需要应对组织结构和治理框架带来的制约因素。为有效且高效地开展项目，项目经理需要了解组织内的职责、终责和职权的分配情况。这有助于项目经理有效地利用其权力、影响力、能力、领导力和政治能力成功完成项目。单个组织内多种因素的交互影响创造出一个独特的系统，会对在该系统内运行的项目造成影响。这种组织系统决定了组织系统内部人员的权力、影响力、利益、能力和政治能力。系统因素包括（但不限于）： 管理要素； 治理框架； 组织结构类型。组织系统因素的完整信息和说明，以及这些因素组合对项目的影响方式并不在本指南范围之内。系统是各种组件的集合，可以实现单个组件无法实现的成果。组件是项目或组织内的可识别要素，提供了某种特定功能或一组相关的功能。各种系统组件的相互作用创造出组织文化和能力。以下是关于系统的几个原则： 系统是动态的； 系统是可以优化； 系统组件是可以优化； 系统及其组件不能同时优化； 系统呈现非线性响应（输入的变更并不会产生可预测的输出）。系统内部以及系统与其环境之间可能会发生多个变更。出现这些变更时，各组件内部发生的适应性行为反过来会增加系统的动态特性。这种特性取决于组件之间的联系和依赖关系的相互作用。系统通常由组织管理层负责。组织管理层检查组件与系统之间的优化权衡，以便采取合适的措施为组织实现最佳结果。这一检查工作的结果将对相应的项目造成影响。因此，项目经理在确定如何达成项目目标时务必要考虑这些结果。此外，项目经理应考虑到组织的治理框架。 2.4.2组织治理框架研究指出，治理指组织各个层面的有组织的或有结构的安排，旨在确定和影响组织成员近期的行为。研究结果表明，治理是一个多方面概念，并且： 包括考虑人员、角色、结构和政策； 要求通过数据和反馈提供指导和监督。治理框架治理是在组织内行使职权的框架，其包括（但不限于）： 规则；政策；程序；规范；关系；系统；过程。这个框架会影响： 组织目标的设定和实现方式； 风险监控和评估方式； 绩效优化方式。项目组合、项目集和项目治理协调组织级项目管理 (OPM) 与项目组合、项目集和项目管理的常见治理框架，涉及四个治理领域：一致性、风险、绩效和沟通。各个领域都具备以下职能部门：监督、控制、整合与决策。各个职能部门都可针对独立项目或项目组合/项目集中的项目的支持过程与活动进行治理。项目治理是指用于指导项目管理活动的框架、功能和过程，从而创造独特的产品、服务或结果以满足组织、战略和运营目标。不存在一种治理框架适用于所有组织。组织应根据组织文化、项目类型和组织需求裁剪治理框架，才能发挥其作用。 2.4.3管理要素管理要素指组织内部关键职能部门或一般管理原则的组成部分。组织根据其选择的治理框架和组织结构类型分配一般管理要素。关键职能部门或一般管理原则包括（但不限于）： 基于专业技能和可用性开展工作的部门； 组织授予的工作职权； 工作职责，开展组织根据技能和经验等属性合理分派的工作任务； 具有纪律性的行为（例如尊重职权、人员和规定）； 统一指挥原则（例如一位员工仅接受一个上级对任何行动或活动给出的指示）； 统一领导原则（例如针对一组活动只能有一个计划或一个领导人，以及相同的目标）； 组织的总体目标优先于个人目标； 支付合理的薪酬； 资源的优化使用； 畅通的沟通渠道； 在正确的时间让正确的人使用正确的材料做正确的事情； 公正、平等地对待所有员工； 明确工作岗位的安全职责； 确保员工安全； 允许任何员工参与计划和实施； 保持员工士气。组织将这些管理要素的绩效分派到选定的员工身上。这些员工可能在不同的组织层级上执行上述职能。分配到各个层级的职责、终责和职权表明了各个层级的员工在组织结构内执行上述职能的方式。 2.4.4组织结构类型组织需要权衡两个关键变量之后才可确定合适的组织结构类型。这两个变量指可以采用的组织结构类型以及针对特定组织如何优化组织结构类型的方式。不存在一种结构类型适用于任何特定组织。因要考虑各种可变因素，特定组织的最终结构是独特的。组织结构类型组织结构的形式或类型是多种多样的。组织结构选择的考虑因素在确定组织结构时，每个组织都需要考虑大量的因素。在最终分析中，每个因素的重要性也各不相同。综合考虑因素及其价值和相对重要性为组织决策者提供了正确的信息，以便进行分析。选择组织结构时应考虑的因素包括（但不限于）： 与组织目标的一致性； 专业能力； 控制、效率与效果的程度； 明确的决策升级渠道； 明确的职权线和范围； 授权方面的能力； 终责分配； 职责分配； 设计的灵活性； 简单的设计； 实施效率； 成本考虑； 物理位置（例如集中办公、区域办公和虚拟远程办公）； 清晰的沟通（例如政策、工作状态和组织愿景）。项目管理办公室项目管理办公室 (PMO) 是对与项目相关的治理过程进行标准化，并促进资源、方法论、工具和技术共享的一个组织结构。PMO 的职责范围可大可小，从提供项目管理支持服务，到直接管理一个或多个项目。PMO 有几种不同类型，它们对项目的控制和影响程度各不相同，例如：支持型。支持型 PMO 担当顾问的角色，向项目提供模板、最佳实践、培训，以及来自其他项目的信息和经验教训。这种类型的 PMO 其实就是一个项目资源库，对项目的控制程度很低。控制型。控制型 PMO 不仅给项目提供支持，而且通过各种手段要求项目服从，这种类型的 PMO对项目的控制程度属于中等。服从可能包括： 采用项目管理框架或方法论； 使用特定的模板、格式和工具； 服从治理。指令型。指令型 PMO 直接管理和控制项目。项目经理由 PMO 指定并向其报告。这种类型的 PMO对项目的控制程度很高。项目管理办公室可能会承担整个组织范围的职责，在支持战略调整和创造组织价值方面发挥重要的作用。为了保证项目符合组织的业务目标，PMO 可能有权在每个项目的生命周期中充当重要相关方和关键决策者。PMO 可以： 提出建议； 领导知识传递； 终止项目； 根据需要采取其他行动。PMO 的一个主要职能是通过各种方式向项目经理提供支持，这些方式包括（但不限于）： 对 PMO 所辖的全部项目的共享资源进行管理； 识别和制定项目管理方法、最佳实践和标准； 指导、辅导、培训和监督； 通过项目审计，监督对项目管理标准、政策、程序和模板的遵守程度； 制定和管理项目政策、程序、模板和其他共享的文件（组织过程资产）； 对跨项目的沟通进行协调。 3 项目经理的角色3.1概述项目经理在领导项目团队达成项目目标方面发挥至关重要的作用。在整个项目期间，这个角色的作用非常明显。理解项目经理角色： 成员与角色。一个大型项目可能包括由一位项目经理领导的上百位项目成员。这些团队成员需要承担各种不同的角色，例如设计、制造和设施管理。项目团队成员组成了多个业务部门或小组。项目成员都会形成对应的团队。 在团队中的职责。项目经理要为团队的成果负责。需要从整体的角度来看待团队产品，以便进行规划、协调和完成。首先，应审查各自组织的愿景、使命和目标，确保与产品保持一致。然后解释与成功完成产品相关的愿景、使命和目标。最后向团队沟通自己的想法，激励团队成功完成目标。知识和技能：项目经理无需承担项目中的每个角色，但应具备项目管理知识、技术知识、理解和经验。项目经理通过沟通领导项目团队进行规划和协调。项目经理采用书面沟通（文档计划和进度），还通过会议和口头提示或非言语提示与团队进行实时沟通。 3.2项目经理的定义项目经理的角色不同于职能经理或运营经理。一般而言，职能经理专注于对某个职能领域或业务部门的管理监督。运营经理负责保证业务运营的高效性。项目经理是由执行组织委派，领导团队实现项目目标的个人。 3.3项目经理的影响力范围3.3.1概述项目经理在其影响力范围内担任多种角色。这些角色反映了项目经理的能力，体现了项目经理这一职业的价值和作用。 3.3.2项目的制约因素。项目经理领导项目团队实现项目目标和相关方的期望。项目经理利用可用资源，以平衡相互竞争项目经理还充当项目发起人、团队成员与其他相关方之间的沟通者，包括提供指导和展示项目成功的愿景。项目经理使用软技能（例如人际关系技能和人员管理技能）来平衡项目相关方之间相互冲突和竞争的目标，以达成共识。与团队和发起人等相关方沟通的能力适用于项目的各个方面，包括（但不限于）以下各个方面： 通过多种方法（例如口头、书面和非言语）培养完善的技能； 创建、维护和遵循沟通计划和进度计划； 不断地以可预见的方式进行沟通； 寻求了解项目相关方的沟通需求（沟通可能是某些相关方在最终产品或服务实现之前获取信息的唯一渠道）； 以简练、清晰、完整、简单、相关和经过裁剪的方式进行沟通； 包含重要的正面和负面消息； 合并反馈渠道； 人际关系技能，即通过项目经理的影响力范围拓展广泛的人际网络。 3.3.3组织项目经理需要积极地与其他项目经理互动。其他独立项目或同一项目集的其他项目可能会对项目造成影响，原因包括（但不限于）： 对相同资源的需求； 资金分配的优先顺序； 可交付成果的接受或发布； 项目与组织的目的和目标的一致性。项目经理需要寻求各种方法来培养人际关系，从而帮助团队实现项目目的和目标。此外，项目经理在组织内扮演强有力的倡导者的角色。在项目过程中，项目经理积极地与组织中的各位经理互动。此外，项目经理应与项目发起人合作处理内部的政治和战略问题，这些问题可能会影响团队或项目的可行性或质量。项目经理可以致力于提高自己在组织内的总体项目管理能力和技能，并参与隐性和显性知识的转移或整合计划。项目经理还应致力于： 展现项目管理的价值； 提高组织对项目管理的接受度； 提高组织内现有 PMO 的效率。基于组织结构，项目经理可能向职能经理报告。而在其他情况下，项目经理可能与其他项目经理一起，向 PMO、项目组合或项目集经理报告。项目组合或项目集经理对整个组织范围内的一个或多个项目承担最终责任。项目经理还需与其他角色紧密协作，如组织经理、主题专家以及商业分析人员。 3.3.4行业项目经理应时刻关注行业的最新发展趋势，获得并思考这一信息对当前项目是否有影响或可用。这些趋势包括（但不限于）： 产品和技术开发； 新且正在变化的市场空间； 标准（例如项目管理标准、质量管理标准、信息安全管理标准）； 技术支持工具； 影响当前项目的经济力量； 影响项目管理学科的影响力； 过程改进和可持续发展战略。 3.3.5专业学科对项目经理而言，持续的知识传递和整合非常重要。项目管理专业和项目经理担任主题专家的其他领域都在持续推进相应的专业发展。知识传递和整合包括（但不限于）： 在当地、全国和全球层面（例如实践社区、国际组织）向其他专业人员分享知识和专业技能； 参与培训、继续教育和发展： 项目管理专业（例如大学、PMI）； 相关专业（例如系统工程、配置管理）； 其他专业（例如信息技术、航空航天）。 3.3.6跨领域专业的项目经理针对组织的价值可以选择指导和教育其他专业人员项目管理方法。项目经理还可以担任非正式的宣传大使，让组织了解项目管理在及时性、质量、创新和资源管理方面的优势。 3.4项目经理的能力3.4.1概述近期的 PMI 研究通过 PMI 人才三角指出了项目经理需要具备的技能。人才三角重点关注三个关键技能组合： 技术项目管理。与项目、项目集和项目组合管理特定领域相关的知识、技能和行为，即角色履行的技术方面。 领导力。指导、激励和带领团队所需的知识、技能和行为，可帮助组织达成业务目标。 战略和商务管理。关于行业和组织的知识和专业技能，有助于提高绩效并取得更好的业务成果。为发挥最大的效果，项目经理需要平衡这三种技能。 3.4.2技术项目管理技能技术项目管理技能指有效运用项目管理知识实现项目集或项目的预期成果的能力。研究表明，顶尖的项目经理会持续展现出几种关键技能，包括（但不限于）： 重点关注所管理的各个项目的关键技术项目管理要素。简单来说就是随时准备好合适的资料。最主要的是： 项目成功的关键因素； 进度； 指定的财务报告； 问题日志。 针对每个项目裁剪传统和敏捷工具、技术和方法。 花时间制定完整的计划并谨慎排定优先顺序。 管理项目要素，包括（但不限于）进度、成本、资源和风险。 3.4.3战略和商务管理技能战略和商务管理技能包括纵览组织概况并有效协商和执行有利于战略调整和创新的决策和行动的能力。项目经理应掌握足够的业务知识，以： 向其他人解释关于项目的必要商业信息； 与项目发起人、团队和主题专家合作制定合适的项目交付策略； 以实现项目商业价值最大化的方式执行策略。为制定关于项目成功交付的最佳决策，项目经理应咨询具备关于组织运营的专业知识的运营经理。这些经理应了解组织的工作以及项目计划会对工作造成的影响。对项目经理而言，对项目主题的了解越多越好，至少应能够向其他人说明关于组织的以下方面： 战略； 使命； 目的和目标； 产品和服务； 运营（例如位置、类型、技术）； 市场和市场条件，例如客户、市场状况（发展或萎缩）和上市时间因素等； 竞争（例如什么、谁、市场地位）。为确保一致性，项目经理应将以下关于组织的知识和信息运用到项目中： 战略； 使命； 目的和目标； 优先级； 策略； 产品或服务（例如可交付成果）。战略和商业技能有助于项目经理确定应为其项目考虑哪些商业因素。项目经理应确定这些商业和战略因素会对项目造成的影响，同时了解项目与组织之间的相互关系。这些因素包括（但不限于）： 风险和问题； 财务影响； 成本效益分析（例如净现值、投资回报率），包括各种可选方案； 商业价值； 效益预期实现情况和战略； 范围、预算、进度和质量。通过运用这些商务知识，项目经理能够为项目提出合适的决策和建议。随着条件的变化，项目经理应与项目发起人持续合作，使业务战略和项目策略保持一致。 3.4.4领导力技能领导力技能包括指导、激励和带领团队的能力。这些技能可能包括协商、抗压、沟通、解决问题、批判性思考和人际关系技能等基本能力。随着越来越多的公司通过项目执行战略，项目变得越来越复杂。项目管理不仅仅涉及数字、模板、图表、图形和计算机系统方面的工作。人际交往人际交往占据项目经理工作的很大一部分。项目经理应研究人的行为和动机，应尽力成为一个好的领导者，因为领导力对组织项目是否成功至关重要。项目经理需要运用领导力技能和品质与所有项目相关方合作，包括项目团队、团队指导和项目发起人。领导者的品质和技能研究显示，领导者的品质和技能包括（但不限于）： 有远见（例如帮助描述项目的产品、目的和目标；能够有梦想并向他人诠释愿景）； 积极乐观； 乐于合作； 合理管理关系和冲突： 合理进行沟通： 尊重他人（帮助他人保持独立自主）、谦恭有礼、友善待人、诚实可信、忠诚可靠、遵守职业道德； 展现出诚信正直和文化敏感性，果断、勇敢，能够解决问题； 适当时称赞他人； 终身学习，以结果和行动为导向； 关注重要的事情； 以整体和系统的角度来看待项目，同等对待内部和外部因素； 能够运用批判性思维（例如运用分析方法来制定决策）并将自己视为变革推动者。 能够创建高效的团队、以服务为导向、展现出幽默的一面，与团队成员有效地分享乐趣。权术、权力和办好事情领导和管理的最终目的是办好事情。项目经理对组织运行方式的了解越多，就越有可能获得成功。项目经理应观察并收集有关项目和组织概况的数据，然后从项目、相关人员、组织以及整个环境出发来审查这些数据，从而得出计划和执行大多数行动所需的信息和知识。有了权力就有了职责，项目经理应体察并尊重他人。项目经理的有效行动保持相关人员的独立自主。项目经理的行动成果就是让合适的人执行必要的活动来实现项目目标。在权力方面，顶尖的项目经理积极主动且目的明确。这些项目经理会在组织政策、协议和程序许可的范围内主动寻求所需的权力和职权，而不是坐等组织授权。 3.4.5领导力与管理之比较“管理”更接近于运用一系列已知的预期行为指示另一个人从一个位置到另一个位置。“领导力”指通过讨论或辩论与他人合作，带领他们从一个位置到另一个位置。项目经理所选择的方法体现了他们在行为、自我认知和项目角色方面的显著差异。为获得成功，项目经理必须同时采用领导力和管理这两种方式。技巧在于如何针对各种情况找到恰当的平衡点。项目经理的领导风格通常体现了他们所采用的管理和领导力方式。领导力风格项目经理领导团队的方式可以分为很多种。项目经理可能会出于个人偏好或在综合考虑了与项目有关的多个因素之后选择领导力风格。根据作用因素的不同，项目经理可能会改变风格。要考虑的主要因素包括（但不限于）： 领导者的特点（例如态度、心情、需求、价值观、道德观）； 团队成员的特点（例如态度、心情、需求、价值观、道德观）； 组织的特点（例如目标、结构、工作类型）； 环境特点（例如社会形势、经济状况和政治因素）。研究显示项目经理可以采用的多种领导力风格。在这些风格中，最常见的包括（但不限于）： 放任型领导（例如，允许团队自主决策和设定目标，又被称为“无为而治”）； 交易型领导（例如，关注目标、反馈和成就以确定奖励，例外管理）； 服务型领导（例如，做出服务承诺，处处先为他人着想；关注他人的成长、学习、发展、自主性和福祉；关注人际关系、团体与合作；服务优先于领导）； 变革型领导（例如，通过理想化特质和行为、鼓舞性激励、促进创新和创造，以及个人关怀提高追随者的能力）； 魅力型领导（例如，能够激励他人；精神饱满、热情洋溢、充满自信；说服力强）； 交互型领导（例如，结合了交易型、变革型和魅力型领导的特点）。个性个性指人与人之间在思维、情感和行为的特征模式方面的差异。个人性格特点或特征可能包括（但不限于）： 真诚（例如，接受他人不同的个性，表现出包容的态度）； 谦恭（例如，能够举止得体、有礼貌）； 创造力（例如，抽象思维、不同看法、创新的能力）； 文化（例如，具备对其他文化的敏感性，包括价值观、规范和信仰）； 情绪（例如，能够感知情绪及其包含的信息并管理情绪，衡量人际关系技能）； 智力（例如，以多元智能理论衡量的人的智商）； 管理（例如，管理实践和潜力的衡量）； 政治（例如，政治智商和把事办好的衡量）； 以服务为导向（例如，展现出愿意服务他人的态度）； 社会（例如，能够理解和管理他人）； 系统化（例如，了解和构建系统的驱动力）。重视个性的不同方面。高效的项目经理在上述各个方面都具备一定程度的能力。 3.5执行整合整合是项目经理的一项关键技能。执行项目整合时，项目经理承担双重角色： 项目经理扮演重要角色，与项目发起人携手合作，既要了解战略目标并确保项目目标和成果与项目组合、项目集以及业务领域保持一致。项目经理以这种方式有助于项目的整合与执行。 在项目层面上，项目经理负责指导团队关注真正重要的事务并协同工作。为此，项目经理需要整合过程、知识和人员。 3.5.1在过程层面执行整合项目管理可被看作为实现项目目标而采取的一系列过程和活动。有些过程可能只发生一次（例如项目章程的初始创建），但很多过程在整个项目期间会相互重叠并重复发生多次。在整个项目期间实施整体变更控制过程是为了整合变更请求。虽然对项目过程的整合方式没有明确的定义，但如果项目经理无法整合相互作用的项目过程，那么实现项目目标的机会将会很小。 3.5.2认知层面的整合管理项目的方法有很多，而方法的选择通常取决于项目的具体特点，包括规模、项目或组织的复杂性，以及执行组织的文化。显然，项目经理的人际关系技能和能力与其管理项目的方式有紧密的关系。项目经理应尽量掌握所有项目管理知识领域。熟练掌握这些知识领域之后，项目经理可以将经验、见解、领导力、技术以及商业管理技能运用到项目管理中。最后，项目经理需要整合这些知识领域所涵盖的过程才有可能实现预期的项目结果。 3.5.3背景层面的整合与几十年前相比，当今企业和项目所处的环境有了很大的变化。新技术不断涌现。社交网络、多元文化、虚拟团队和新的价值观都是项目所要面临的全新现实。整合涉及多个组织的、大规模、跨职能项目实施中的知识和人员便是一例。项目经理在指导项目团队进行沟通规划和知识管理时需要考虑这个背景所产生的影响。在管理整合时，项目经理需要意识到项目背景和这些新因素，然后项目经理可以决定如何在项目中最好地利用这些新环境因素，以获得项目成功。 3.5.4整合与复杂性项目的复杂性来源于组织的系统行为、人类行为以及组织或环境中的不确定性。复杂性本身指个体基于自身经验、观察和技能的一种感知，更准确的描述应该是项目包含复杂性的要素，而不是项目本身复杂。项目组合、项目集和项目可能包含复杂性的要素。项目整合之前，项目经理应考虑项目内外的要素。项目经理应检查项目的特征或属性。作为项目的一种特征或属性，复杂性通常被定义为： 包含多个部分； 不同部分之间存在一系列连接； 不同部分之间有动态交互作用； 这些交互作用所产生的行为远远大于各部分简单的相加（例如突发性行为）。这些因素会增加项目的复杂性，通过检查，有助于项目经理在规划、管理和控制项目时可以识别关键领域，确保完成整合。","link":"/2021/03/31/PMBOK-Study/"},{"title":"Scrum指南笔记","text":"Scrum 的定义Scrum 是一个轻量的框架，它通过提供针对复杂问题的自适应解决方案来帮助人们、团队和组织创造价值。Scrum 需要 Scrum Master 营造一个环境1.一名 Product Owner 将解决复杂问题所需的工作整理成一份Product Backlog。2.Scrum Team 在 一个 Sprint 期间将选择的工作转化为价值的 Increment。3.Scrum Team 和利益攸关者检视结果并为下一个Sprint 进行调整。4.重复在 Scrum 框架中，可以使用各种不同的过程、技术和方法。Scrum 可以将一些已有的实践包装进来，也可以甄别出非必须的实践。Scrum 可以凸显当前管理、环境和工作技术的相对成效，以便可以进行改进。 Scrum 理论Scrum 基于经验主义和精益思维。 经验主义主张知识源自实际经验以及根据当前观察到的事物作出的判断所获得。精益思维减少浪费，专注于根本。Scrum 采纳一种迭代和增量的方法来优化对未来的预测性并控制风险。Scrum 让一群共同拥有所有技能和专长的人员参与进来完成工作，并根据需要分享或获得所需技能。Scrum 的三个支柱：透明、检视和适应。检视使适应成为可能。没有适应的检视是毫无意义的。Scrum 事件旨在激发改变。 Scrum 价值观Scrum 的成功应用取决于人们变得更加精通践行并内化 5 项价值观：承诺， 专注， 开放， 尊重和勇气Scrum Team 致力于达成其目标并且相互支持。他们的主要关注点是 Sprint 的工作，以便尽可能地向着这些目标获取最好的进展。Scrum Team 及其利益攸关者对工作和挑战持开放态度。Scrum Team 成员相互尊重，彼此是有能力和独立的人，并因此受到与他们一起工作的人的尊重。Scrum Team 成员有勇气做正确的事并处理那些棘手的问题。 Scrum TeamScrum 的基本单位是小团队，称为Scrum Team。Scrum Team 由一名Scrum Master，一名 Product Owner 和 Developers 组成，没有子团队或层次结构。Scrum Team 是具有凝聚力的专业团体，一次专注于一个目标，即 Product Goal。Scrum Team 是跨职能的（cross-functional），这意味着团队成员具有在每个 Sprint 中创造价值而所需的全部技能。Scrum Team 是自管理的，这意味着他们在团队内部决定谁做什么、何时做以及如何做。Scrum Team 规模足够小以保持灵活，通常只有 10 人或更少。Scrum Team 负责所有与产品相关的活动以及可能需要进行的其他任何活动。都有责任在每个Sprint 中创建有价值的、有用的Increment。Scrum Team 中定义了三种特定的职责：Developers、Product Owner 和 Scrum Master。 DevelopersDevelopers 是 Scrum Team 中致力于创建每个Sprint 可用 Increment 的任何方面的人员。Developers 所需的特定技能通常很广泛，并且会随着工作领域的不同而变化。Developers始终要负责：●为 Sprint 创建计划，即Sprint Backlog；●通过遵循 Definition of Done 来注入质量；●每天根据 Sprint Goal 调整计划； 和，●作为专业人士对彼此负责。 Product OwnerProduct Owner 负责将Scrum Team 的工作所产生的产品价值最大化。Product Owner 还负责对Product Backlog 进行有效管理，包括：●开发并明确地沟通Product Goal ；●创建并清晰地沟通Product Backlog 条目（items）；●对 Product Backlog 条目进行排序；●确保 Product Backlog 是透明的、可见的和可理解的。Product Owner 可以自己做上述工作，或者也可以将职责委托他人。 然而无论如何， Product Owner 是负最终责任的人。Product Owner 是一个人，而不是一个委员会。在Product Backlog 中，Product Owner 可以代表许多利益攸关者的期望要求。 Scrum MasterScrum Master 负责按照Scrum 指南的游戏规则来建立Scrum。他们通过帮助Scrum Team 和组织内的每个人理解 Scrum 理论和实践来做到这一点。Scrum Master 对 Scrum Team 的效能负责。他们通过让Scrum Team 在 Scrum 框架内改进其实践来做到这一点。Scrum Masters 是真正的领导者，服务于Scrum Team 和作为更大范围的组织。Scrum Master 以多种方式服务于Scrum Team ，包括：●作为教练在自管理和跨职能方面辅导Scrum Team 成员；●帮助 Scrum Team 专注于创建符合 Definition of Done 的高价值 Increment；●促使移除 Scrum Team 工作进展中的障碍；和，●确保所有 Scrum 事件都发生并且是积极的、富有成效的，并且在时间盒（timebox）内完成。Scrum Master 以多种方式服务于Product Owner，包括：●帮助找到有效定义Product Goal 和管理Product Backlog 的技巧；●帮助 Scrum Team 理解为何需要清晰且简明的Product Backlog 条目；●帮助建立针对复杂环境的基于经验主义的产品规划（empirical product planning）；和，●当需要或被要求时，引导利益攸关者协作。Scrum Master 以多种方式服务于组织，包括：●带领、培训和作为教练辅导组织采纳Scrum；●在组织范围内规划并建议Scrum 的实施；●帮助员工和利益攸关者理解并实施针对复杂工作的经验主义方法（empirical approach）； 和，●消除利益攸关者和Scrum Teams 之间的隔阂。 Scrum 事件Sprint 是所有其他事件的容器。Scrum 中的每个事件都是为实现所需的透明度而特别设计的，未能按规定运作任何事件将导致失去检视和适应的机会。Scrum 使用事件来创造规律性，并以此最小化对Scrum 中未定义的会议的需要。最理想的是，所有事件都在同一时间同一地点举行，以便减少复杂性。 SprintSprint 是 Scrum 的核心，在这里创意（idea）转化为价值。它们是固定时长的事件，为期一个月或更短，以保持一致性。前一个Sprint 结束后，下一个新的Sprint 紧接着立即开始。实现 Product Goal 所需的所有工作，包括Sprint Planning、Daily Scrum、Sprint Review 和 Sprint Retrospective，都发生在 Sprint 内。在 Sprint 期间：●不能做出危及Sprint Goal的改变；●不能降低质量；●Product Backlog 按需进行精化（refined）●随着学到更多，可以与Product Owner 就范围加以澄清和重新协商。Sprint 通过确保至少每个日历月一次对达成Product Goal 的进展进行检视和适应，来实现可预测性。当 Sprint 的长度拉得太长时，Sprint Goal 可能会失效，复杂性可能会上升，同时风险可能会增加。可以使用较短的Sprint 来产生更多的学习周期，并将成本与工作投入（effort）的风险限制在更短的一段时间内。每个Sprint 都可以视为一个短期的项目。 存在各种各样的实践来预测进展，例如，燃尽图（burn-downs）、燃起图（burn-ups）或累积流图（cumulative flows）。尽管被证明是有用的，然而这些实践并不能用来取代经验主义的重要性。在复杂的环境中，未来将要发生什么是未知的。只有已经发生的事情才能用来做前瞻性的决策。如果 Sprint Goal 已过时，那么就可以取消Sprint。只有 Product Owner 有取消Sprint 的权力。 Sprint PlanningSprint Planning 通过安排在 Sprint 中要做的工作来启动 Sprint。Product Owner 要确保与会者准备好讨论最重要的Product Backlog 条目 ，以及它们如何映射到Product Goal 。Scrum Team 还可以邀请其他人参加Sprint Planning 以提供建议。 Sprint Planning 处理以下话题：话题一：为什么这次 Sprint 有价值？话题二：这次 Sprint 能完成（Done）什么？话题三：如何完成所选的工作？Sprint Goal 、这次 Sprint 所选出的Product Backlog 条目加上如何交付它们的计划称之为Sprint Backlog。Sprint Planning 是有时间盒限定的，以一个月的Sprint 来说最多为 8 个小时。对于更短的 Sprint， Sprint Planning 所需时间通常会更短。 Daily ScrumDaily Scrum 的目的是检视达成 Sprint Goal 的进展，并根据需要调整适应Sprint Backlog，以调整即将进行的计划工作。Daily Scrum 是一个属于Scrum Team 的 Developers 的 15 分钟的事件。为了降低复杂性，它在Sprint 的每个工作日都在同一时间同一地点举行。Daily Scrum 改善沟通，发现障碍，促进快速决策，从而消除其他会议的需要。Daily Scrum 可以在一天中任何时间碰面， 详细讨论如何调整适应或重新规划Sprint 的剩余工作。 Sprint ReviewSprint Review 的目的是检视 Sprint 的成果并确定未来的适应性。Scrum Team 向关键利益攸关者展示他们的工作结果，并讨论Product Goal 的进展情况。Sprint Review 期间，Scrum Team 和利益攸关者将评审在这次Sprint 中完成了什么，以及环境发生了什么变化。Product Backlog 也可能会进行调整以适应新的机会。Sprint Review 是一个工作会议，Scrum Team 应避免将其仅限于展示。Sprint Review 是有时间盒限定的，以一个月的 Sprint 来说，最多为 4 个小时。 对于更短的Sprint，Sprint Review 通常所需的时间更短。 Sprint RetrospectiveSprint Retrospective 的目的是规划提高质量和效能的方法。Scrum Team 检视最近 Sprint 中有关个体、交互、过程、工具和他们的 Definition of Done 的情况如何。被检查的元素通常随工作领域而变化。Scrum Team 讨论在 Sprint 期间哪些进展顺利，遭遇到哪些问题以及这些问题是如何解决（或未解决） 的。Scrum Team 识别出最有用的改变以提高其效能。最有影响力的改进将尽快得到执行。甚至可以将它们添加到下一个 Sprint 的 Sprint Backlog 中。Sprint Retrospective 结束 Sprint。它是有时间盒限定的，以一个月的 Sprint 来说，最多为 3 个小时。对于更短的 Sprint， Sprint Retrospective 通常所需的时间更短。 Scrum 工件Scrum 的工件代表工作或价值。 它们旨在最大限度地提高关键信息的透明度。 因此，为适应而检视它们的每个人对工件都有相同的基础。每个工件都包含一个承诺，以确保它提供可增强透明度并聚焦于可度量进展的信息：●对于 Product Backlog 而言，它是 Product Goal。●对于 Sprint Backlog 而言，它是 Sprint Goal 。●对于 Increment 而言，它是Definition of Done。这些承诺的存在是为了强化经验主义和Scrum Team 及其利益攸关者的Scrum 价值观。 Product BacklogProduct Backlog 是一份涌现的和有序的清单，它列出了改进产品所需的内容。它是Scrum Team 所承担工作的唯一来源。能够被 Scrum Team 在一个Sprint 中完成（Done）的 Product Backlog 条目被认为准备就绪，在Sprint Planning 事件中可供选择。Product Backlog 精化是将 Product Backlog 条目分解并进一步定义为更小更精确的行为。 Product GoalProduct Goal 描述了产品的未来状态，可以作为Scrum Team 制定计划的目标。Product Goal 在Product Backlog 中。Product Backlog 的其余部分涌现，用来定义“做什么”将实现 Product Goal。Product Goal 是 Scrum Team 的长期目标。他们必须先实现（或放弃）一个目标，然后再开始下一个目标。 产品产品是传递价值的载体。它具有明确的边界、已知的利益攸关者和定义明确的用户或客户。产品可以是一种服务、实体产品或其他更抽象的东西。 Sprint BacklogSprint Backlog 由 Sprint Goal （为什么做）、为 Sprint 选择的 Product Backlog 条目（做什么）以及交付 Increment 的可执行计划（如何做）组成。Sprint Backlog 是 Developers 为其制定的计划。它是 Developers 在 Sprint 期间为实现 Sprint Goal 而计划完成的工作，是一个高度可视且实时的工作画面。Sprint Backlog 在整个 Sprint 期间会进行更新。它应该有足够的细节，以便他们可以在Daily Scrum 中检视其进展。 Sprint GoalSprint Goal 是 Sprint 的单个目标。尽管 Sprint Goal 是 Developers 的承诺，但它为实现该目标所需的确切工作方面提供了灵活性。Sprint Goal 还创造了连贯性和专注点，鼓励 Scrum Team 一起工作而不是分开独自行动。Sprint Goal 在 Sprint Planning 事件中确定，然后添加到 Sprint Backlog 中。 Increment一个 Increment 是迈向 Product Goal 的一块坚实垫脚石。每个 Increment 都是之前所有的Increment 累加起来的，并经过彻底地验证，以确保整合在一起的所有Increment 都能工作。为了提供价值，Increment 必须是可用的。在一个 Sprint 中可以创建多个Increment。Increment 的总和在 Sprint Review 中展示，从而支持经验主义。Increment 可以在 Sprint 结束之前交付给利益攸关者。Sprint Review 决不应该被视为发布价值的关口。一项工作除非符合Definition of Done ，否则不能将其视为 Increment 的一部分。 Definition of DoneDefinition of Done 是当 Increment 符合产品所需的质量度量标准时对其状态的正式描述。Definition of Done 通过使每一个人对作为Increment 的一部分、什么样的工作算是已完成的工作有一个共同的理解来创建透明。如果一个Product Backlog 条目不符合Definition of Done ，那么它就不能发布，甚至不能在 Sprint Review 中展示它。相反，它返回到Product Backlog 中以供将来考虑。如果 Increment 的 Definition of Done 是组织标准的一部分，那么所有 Scrum Team 都必须以此为最低标准来遵守。如果它不是组织标准的一部分，那么 Scrum Team 必须制定适合于该产品的Definition of Done 。如果有多个Scrum Team 在同一产品上一起工作，那么他们必须一起制定并遵守同样的 Definition of Done 。","link":"/2021/04/09/Scrum-Study/"},{"title":"敏捷项目管理读书笔记","text":"一、敏捷革命不确定性、不断缩短的进度以及对迭代研究的需求并不仅限于新产品开发。客户关系管理实施中的高失败率，部分要归罪于预见性（以计划为推动力）的项目管理方法，这些方法没有“仔细研究”主要业务流程改变所带来的不确定性。只有创新和更快的开发还不够，公司必须给用户交付更好的、更符合需要的产品。敏捷方法针对的产品开发工作包括下列领域的新产品和产品改进：•商业软件产品•带嵌入式软件的工业产品（从电子设备到汽车）•内部开发的IT项目“要迅速，但不要仓促” 这句话也适用于产品开发，也就是说要做正确的事，而且要学会怎样才能更快速地完成，即删除多余的没有价值的步骤。随着产品开发流程从预见性方式转向适应性方式，项目管理方法也随之改变。这种改变必须适应机动性、试验和速度的要求，而先决条件是，它必须适合企业目标。 1.1 敏捷商业目标一个良好的探索流程需要实现以下5个关键商业目标：•持续创新–满足当前客户的需要•产品适应性–满足未来客户的需要•缩短交付进度–满足市场，提高投资回报率ROI•人员和流程适应性–对产品和企业变化做出迅速反应•可靠的结果–支持业务增长和盈利能力 1.1.1 持续创新创新思想并不会在模式化的、独裁的环境中产生，而会在基于自我组织和自我约束为原则的不断适应氛围中产生。 1.1.2 产品适应性在敏捷项目中，卓越技术通过两方面判定：一是现在提供客户价值的能力，二是创造强适应性产品的能力。敏捷技术的做法将重点放在减少技术债务（提高适应能力），将其作为开发流程的组成部分。在敏捷项目中，开发人员致力于卓越技术，而项目经理则提供支持。 1.1.3 缩短交付进度敏捷项目管理的迭代开发、基于功能的本质可以通过3种方式缩短交付周期：突出重点、简化流程和培养技能。 1.1.4 人员和流程适应性敏捷项目管理的指导原则和架构鼓励把学习和适应当做向客户提供价值的组成部分。 1.1.5 可靠的结果组织结构适度、灵活的流程，对于新产品和新服务开发有更好的效果。如果目标是提供符合已知的、不变的说明要求的产品，就用重复的流程。相反，如果目标是提供有特定限制的价值的产品，而变化和截止日期都是非常重要的因素，那么可靠流程更为适用。 1.2 敏捷的定义敏捷是制造并响应变化从而在动荡的商业环境中创造利润的能力。敏捷是平衡灵活性和稳定性的能力。在高度变化的 产品幵发环境中，严格的配置管理可以保持稳定并促进灵活性，就像集中精力于卓越技术可以稳定开发工作一样。 1.3 敏捷领导价值观敏捷强调的是态度而不是流程，它是氛围而不是方法。团队为何存在、要创造什么产品、为谁而创造以及如何共同工作，这些组成了敏捷项目管理的核心原则。如果想要创造优秀的产品，就需要有优秀的人才；如果想要吸引并留住优秀的人才，就需要有优秀的原则。团队管理者鼓励团队成员自我管理，通过完成拆分任务从而实现产品功能的开发。而任务管理者只是关注任务的完成情况，并用其评估团队是否遵循计划行事。团队管理者帮助团队（或者更广泛意义的项目组）成员协同有效地工作从而保证他们能够成功地完成任务。 而任务管理者只是监督其成员，以确保他们在工作并能跟上计划进度。有研究表明，超过50%的软件功能很少被使用甚至从来没被使用过，所以， 认为关注范围和要求就能产生价值的想法是错误的。如果把项目看做是动态的且不断变化的， 那么适应变化的能力是最重要的，这种能力来源于创新思维和对目标的深刻理解。一个企业无论敏捷与否，都应该了解客户需求，这是一个很重要的价值观，但它不能像那3个价值观一样用来区分企业敏捷与否。 1.4 敏捷绩效评估敏捷项目评估的3个目标可归纳为：价值目标–提供可交付的产品质量目标–提供可靠的、适应性强的可交付产品约束目标–在可接受的约束内，实现价值和质量目标 1.5 敏捷项目管理架构项目管理流程和绩效评估对于基于探索和试验的方法和基于生产和技术规范的方法是不同的。以生产为导向的项目管理流程和做法强调完整的早期计划和要求说明，并且要求以后将尽量不会改动。而基于探索的流程虽然也强调早期计划（仅是名义上的）， 但它更强调足够好的要求和可实验可改进的设计方案，而且随后会通过不断学习，做出重大改动。两种方法各有其优势，两者的生命周期架构也大不相同。在一个有4个管理层面的敏捷组织架构里，敏捷项目管理交付方法包括5个阶段：构想、推测、探索、适应和结束，而每个阶段都有各自的做法。这些阶段更近似于科学调査过程，而不是生产管理流程。构想阶段，产生一个淸晰明白的业务或者产品构想，为后面的阶段划出边界；推测阶段，团队推测产品的规格，制定一个发布计划，随着项目的不断进行，技术要求和客户要求会随着新知识的获得不断演变；探索阶段，它和迭代平行作业，其中要完成最初的功能和需求设计；适应阶段，这些试验的结果需要经过技术、客户和企业的个案审査，以便在下一次迭代 过程中继续做出调整。 1.6 敏捷项目成功率敏捷项目也会失败，世界上没有一劳永逸的方法，敏捷方法也不例外。如果我们相信《敏捷宣言》中的价值观——个体比过程和工具重要的话，那么失败很可能是因为我们用错了人，而不是用错了流程。 1.7 总结希望敏捷项目管理的概念和做法能帮助读者实现如下目标：向客户交付创新的产品和改善工作环境，敏捷项目管理的许多做法并不是新创造的。敏捷项目管理继承了丰富的项目管理遗产，并吸取其精华去其槽柏；吸收了丰富的管理、制造和软件开发理论和实践经验，融合了最适合机动性和速度的世界观和思想体系。敏捷项目管理并不适用于所有人和所有项目，它并不是万事通用的最佳实践。敏捷项目管理只针对特定类型的问题、特定类型的组织，适于那些有特定文化观点的人和那些有特定世界观的领导者。敏捷项目管理不限于一小套做法和技巧，它定义了如下的策略能力：提供可交付的产品、创造和适应变化、在灵活性和结构之间保持平衡、挖掘开发团队的创造力和创新能力以及引导组织度过动荡和不确定的时期。 2.价值胜过约束通常人们总是关注容易测量的因素，而忽视了真正至关重要却难以量化的特征。敏捷开发试图改变这种状况，去关注最重要的因素，而排在首位的正是价值。结果包括产品构想、商业目标和性能（高级产品功能），而没有具体需求。这些结果特征定义了可发布的产品。质量目标定义了交付可靠的、可适应的（可工作的并易于改进）产品。这些都是很关键的价值特质。项目领导可以通过以下几种方式来关注产品价值：价值确定（与客户一起）、价值优先级排序（订单管理）、价值创造（迭代开发）。 2.1 持续创造客户价值投资回报原则里有这样一对关键词：持续和价值。价值是指企业或组织的产出结果, 往往与财务收益有关。持续是指价值能经得起时间的考验——无论是现在还是将来。客户阐明产品应该具备的性能、带来的价值和实现量化该价值的商业目标。客户是用创造的产品来产生商业价值的个人或群体。对于零售产品，客户就是使用产品的人。客户定义价值，他们用亲身经历来判断产品价值。这个定义将客户与其他利益相关方区别幵来。任何产品的成功都需要满足期最终客户的、利益相关方的和团队自身的期望值。培养忠诚的客户和利益相关方意味着与他们会谈讨论需求和期望值。提供客户价值涉及3个特别重要的话题：一是将重点放在创新和适应性而不是效率和优化，二是专注于执行，三是精益思维。 2.1.1 创新在一个公司的项目中，创新往往能创造最大价值。创新不拘泥于任何形式，可以是新的产品、新的商业模式、新的流程或者新的业绩。创造新产品和新服务不同于对现有产品作微小改进。前者必须将重点放在创新和适应性，而后者通常注重效率和优化。敏捷项目管理的主要目的是创造新产品和新服务。要实现这个目标，就需要不断的技术变革、增加竞争优勢、产生新的创意和不断地缩短产品开发周期。 2.1.2 执行传统的项目管理做法过于强调计划管理和控制的自动调节模式，而对项目管理应该做的执行不够重视。敏捷项目管理是侧重于执行的模型，而不是侧重于计划和控制的模型。在敏捷项目管理中，项目经理的首要任务是促进产品构想的构思，并指导团队去实现该构想，而不是制定计划和进度表、控制进度，保证“计划”得以实行。一旦项目团队将重点放在执行上，下一个关键步骤就是将精力集中到增值活动上， 即辅助团队交付结果的活动，而非只是确保合规的活动。 2.1.3 精益思维敏捷运动的许多想法都源于自精益生产。精益生产最早出现于20世纪80年代的日本汽车制造业。精益生产的一个基本原则是系统地消除浪费，即减少不向客户提供价值的活动。一个简化项目（做较少的事、做正确的事、消除瓶颈）的方法是区分交付活动和合规活动，以及对每种活动分别采用相应的策略。过多的结构不仅会扼杀主动性和创新，而且消耗了大量的时间。不可将流程凌驾于个人知识和能力之上。交付的相关活动与合规活动对项目经理有特殊的重大意义。第一，项目经理需要分析项目活动，以保证用在交付活动上的时间最多；第二，项目经理必须分析他们自己的活动，以确定他们是在从事交付活动还是合规活动。 2.2 迭代、基于功能的交付采用迭代、基于功能的交付方式，能在早期捕获价值，而且通常可以极大地提高项目的投资回报率。敏捷开发和项目管理侧重于交付实际产品的不同版本，或者，如果材料成本高的话，交付实际产品的有效模拟或者模型。敏捷的迭代组成部分可以用下面为4个关键词来表示：迭代、基于功能、时间框和增量。迭代开发是指要建造产品的部分版本，然后通过连续的短期开发以及评审和修改，扩展该版本。基于功能的交付是指设计团队建造最终产品的功能，或者至少是与最终产品最接近的代表物（如模拟、模型），尤其是对于工业产品。功能交付方法帮助定义客户和产品开发者间的可行界面.客户决定进度和功能的优先次序，而产品工程师确定提供这些功能需要的任务，以及完成该任务要花费的时间和成本。对于需求可能会随时间推移而演变的项目和产品，让客户在开发过程期间评审结果，使其尽可能接近实际产品，就显得尤为关键。迭代开发同时也是自我纠正的过程。促进探索很关键，但知道何时停止也很关键。 2.3 卓越技术敏捷开发人员致力于卓越技术，不是因为美学（尽管它可能是一些项目的理论基础），而是因为致力于卓越技术可以交付客户价值。高品质能确保公司在未来交付价值。敏捷组织的结构虽然不是很精致正规，但他们倾向于遵照自己己有的结构。敏捷开发人员认为迭代、新兴设计和频繁反馈可以产生更出众的设计。支持卓越技术要求项目经理和团队成员明白卓越技术的含义——它在于产品技术以及从事工作的人的技能。任何公司都不可能制造出完美的产品，但制造提供客户价值并保持技术完整产品是商业成功的关键，也是令技术团队满意的关键。项目经理需要与团队一起，讨论和决定开发的技术方法，而且在决定技术问题时，让团队不要忘记企业目标。项目经理必须支持卓越技术，因为它是适应能力和低成本迭代的关键，而这两者是产品长期成功的推动力。项目经理不必是技术权威人士，但必须具备足够的知识，才能与技术权威沟通。 2.4 简化如果想快速而又敏捷，就要保持事情简单。速度不是简化的结果，但简化能提高速度。釆用去掉详细的基于任务的结构和合规工作来简化流程，就强迫人们思考和交流。一套再生做法是一个系统在一起正常运转的最小单位。它并不规定一个团队需要做的每件事，而是确定那些具有非常高的价值、适用于几乎每个项目的做法。 2.4.1 再生规则敏捷项目管理的主要原则之一就是敏捷做法，在引导原则的推动下，它是可再生的，而不是规范性的。从最小单位的实践着手，然后明智地随着需要而增加其他业务，比从全面常规性做法开始，然后试图精简，最后找到可用的做法更加有效。开发一套有用的规则不是件容易的事情，因为正确的规则组合通常是反直觉的。轻微的改变也能引发无法预料的结果。 2.4.2 刚刚足够的方法论刚刚足够并不意味着不足，也不意味着“无文档”或者“无流程”。迅速而又有效地完成交付活动能加快项目进程，而过于强调合规活动会中断速度。选择绝对、肯定要做的活动并很好地完成能够加快速度，过多地执行关键活动可能是仓促的结果。找到迅速但不仓促这个平衡的一个竞争优势是它通常能够加速竞争。这实际上也是实施敏捷方法的一个潜在危险。如果领导者能够巧妙地将复杂问题简单化、能够制定刚刚足够的流程、能够找到快速和仓促之间的分界线，那么他无疑有更高的成功几率。 2.4.3 交付活动与合规活动系统往往不断扩张，填补己知的世界；系统往往反对他们自身的正确功能。即使是要自己承担那些任务，项目经理也要尽可能地将项目团队从繁多的合规工作中解脱出来。对于必要的合规活动，应该釆取的策略是尽量减少必要活动，并使他们远离关键途径和关键人员。 2.5 总结传统项目管理关注在范围、时间和成本等约束内按计划行事。而这个做法经常会使团队交付较低的客户价值。计划很快就过时了，而商业目的和目标却保持不变，通过关注现在或将来的价值，团队能与他们的目标一致，而组织也能更加有效地实现企业目标。产品性能的价值评估、追求卓越技术、改变绩效评估方法和提供精助团队交付价值而不是要素的做法等将会是主要的讨论内容。敏捷三角形——价值（任何发布的产品）、质量（可靠的、适应的产品）、约束（成本、进度、范围） 3.团队胜过任务敏捷领导者领导团队，非敏捷领导者管理任务。敏捷项目管理强调团队管理，提倡建立自我组织团队和发展服务型领导方式。这比管理任务更加困难，但最终的结果会更令人满意。在敏捷项目中，团队成员关注任务，项目领导关注团队。 3.1 领导团队计划、控制、预算和流程可以帮助项目经理避开潜在威胁项目的复杂事物。然而，当不确定性、风险和变化显著的时候，只有这些做法是不够的, 还需要有适应变化的做法。想建立适应能力强的、自我组织的项目团队，领导者应该引导而不是控制，在某些情况下，他们影响、轻推、促进、教授、建议、协助、催促、劝告以及指导。领导者之所以成为领导者，不是因为他们所做的事情，而是因为他们扮演的角色。领导者在很大程度上依靠的是影响力而并非权力，影响力来自于人们的尊敬而不是敬畏。领导者是项目团队的一部分，虽然他们得到组织的授权，但他们真正的权力不是自上而下委派的，而是自下而上赢得的。领导者鼓励变化，其方式为：提出未来可能性的想象，通过与大量人员交流，发现能够帮助将产品构想变为现实的新信息，以及激发目的感，激励人们致力于一些超出常规的事情。掌管方向意味着团队经理有时单方面做决策，有时让团队参与共同决策，但主要是把权力下放，让团队决策。领导——协作的管理风格创建了这样的社会体系结构：一个可以让组织和团队面对环境多变性的结构。这种社会体系结构融合了这些概念：平等主义、才干、激情、自律和自我组织。支持领导-协作模式的经理非常清楚他们的主要角色是设定方向、提供指导以及促进人们与团队之间的联系。敏捷运动支持个人和团队通过致力于自我组织、自律、平等主义、尊重个人和能力等观念，实现发展。“敏捷”是社会技术运动，它有两个推动力：一个是愿望：创造一种特定的工作环境；一个是信念：适应性强的环境是向客户提供创新产品目标的关键。 3.2 建立自我组织（自律）团队自我组织团队是敏捷项目管理的核心，他们结合了自由和责任、灵活性和结构。面对矛盾和模糊性，团队的目标是始终如一地在项目范围内和产品构想基础上进行交付（包括适应性）。要达到这个目标，需要团队有自我组织的结构和自律的团队成员。建立这种团队是敏捷项目经理的工作核心。个人负责管理自己的工作量，根据需要和最适合原则轮班工作，并对团队效率负责。对于如何“交付结果”，团队成员自己保有较大的灵活性，但他们对结果负责，并在制定的灵活框架内工作。创建自我组织的团队需要：•找到适当的人员；•清楚表述产品构想、界限和团队角色；•鼓励协作；•坚持负责；•培养自律；•引导而不是控制。敏捷项目管理是关于人，以及人和人之间的相互交流、是关于营造一种环境，让个人创造力和能力爆发、从而创造优秀产品。创造优秀产品的是人，而不是流程。 3.2.1 找到合适的人员通过项目领导者或其他经理，组织有责任为项目配备适当的人员。找到适当的人员意味着找到具有合适技术和行为技能的人。敏捷主义者认为，流程可以为高效率工作提供共同框架，但它不能代替能力和技能；产品是由能干的、技术熟练的人员制造的，而不是由流程制造的。高效率的项目经理将重点依次放在人员、产品和流程。 3.2.2 坚持负责责任和负责创造了自我组织团队。每个团队成员和项目领导相互履行承诺是义不容辞的责任。信任是协作的基石，而履行承诺是建立信任的核心，这样就能建立高效的团队。 3.2.3 培养自律自律是自由和授权的前提，如果个人和团队想要更多的自主权，他们就必须有更多的自律。自律的个人可以：•对结果负责；•用严谨的思维对抗现实；•参与激烈的交流和争辩；•愿意在自我组织框架内工作；•尊重同事。对话、讨论和参与式决策都是建立自律的一部分。自律也是建立在能力、坚持和愿意承担结果的责任之上。才干不仅是技能和能力，它是态度和经验。让合适的人员参与，自律就会更容易些；而如果找到的是不适当的人员，强迫的纪律就会逐步蔓延，从而破坏信任和尊重的氛围。敏捷团队不会因为有良好的意图就自动发展。敏捷团队的成长和成熟需要时间，也需要致力于建立关系和鼓励协作。这是项目领导及个体团队成员最重要的任务。 3.3 鼓励协作自我组织团队的能力在于协作，即两个或更多的人相互交流和合作以共同地产生一个结果。协作的结果可以分为：有形的可交付物、决定和共享知识。适度的流程和工具很有用，但是当要做出关键的决策时，更多的是依赖个体和团队的知识和能力去克服那些障碍。协作结果的质量优劣取决于信任与尊重的程度、信息流动的自由度、辩论以及积极的参与，同时也受到参与式决策流程的约束。在协作团队中，领导者的一个关键角色就是促进、教导、吸引和影响团队成员，让他们建立健康的关系。 3.3.1 参与式决策决策是协作的心脏和灵魂。任何人都可以坐下来，谈论产品的设计。协作就是大家共同努力创造一个功能、一个设计、或者编写产品的文档。协作就是大家共同努力。妥协来自于输贏思想，其中不是我正确，就是你错误。取而代之，可选择双贏思想模式，用重新构思代替妥协。重新构思意味着将多种想法合并起来，创造一种比任何一个单独想法更好的东西。它不是放弃，而是增加。自我组织的团队有许多自由决定的决策权力，与项目经理的权力平衡。和其他领域一样，平衡在决策中是敏捷的关键。 3.3.2 共享空间创新并不会因为一些确定性的流程而得到保证，创新是突发流程的结果，在这个流程中，具有创造性想法的个人相互交流，引发了某些新颖的、与众不同的东西的产生。演示、原型、模拟和模型是相互交流的催化剂，他们组成了“共享空间”，其中开发人员、市场人员、客户和经理可以做有重大意义的相互交流。共享空间有两个要求——直观化和公共性。直观化推动了如今的工业设计。公共性意味着原型需要得到开发工作的所有利益相关方的理解。在项目的每个阶段，项目领导者都需要知道哪些人在该阶段需要相互交流、需要什么样的共享空间以达到交流的效果。 3.3.3客户合作敏捷项目管理依赖于有效的客户合作。客户或者产品团队应该是任何敏捷开发工作不可或缺的一部分。下面列出了客户团队在参与敏捷项目时的部分责任：•创造并管理功能清单；•确定发布和迭代计划的优先级；•辨别并定义功能；•定义接受标准；•审核并接受完整的功能；•和开发团队持续交流；•为结果和调整约束负责。“敏捷”经常指出客户和产品团队的不足，并且需要和产品团队定位各自的角色，如界定产品经理和产品专员的角色。 3.4 不再需要自我组织团队尽管敏捷领导在自上而下的决策制定活动中角色“轻”，但他们在诸如阐述目标、促进交流、提高团队动力、支持协作、鼓励试验和创新的活动中角色却“重”。我们需要的是优秀的领导，我们需要的是更好的领导方式，我们需要的是在正确范围内努力授权给他们团队的经理和领导。 3.5 总结敏捷领导管理团队，敏捷团队管理自己的任务。敏捷领导阐明团队目的和目标、产品构想、关键性能和约束，然后激励团队成员交付，团队成员自己弄清如何完成任务的细节。赋予团队灵活性和适应性，而不是盲目遵循既定任务。鼓励团队自我组织，从而找到最好的方式去实现项目目标。 4.适应胜过遵循传统的顼目管理者注重按计划行事，尽量做到和计划没有出入，而敏捷项目领导者关注如何成功地去适应不可避免出现的变化。传统的项目经理视计划为目标，而敏捷领导者视顾客价值为目标。以客户价值和质量为目标，计划就是实现这些目标的方式，而不是目标本身。计划应该灵活，应该是依据，而不是约束。传统和敏捷领导者都做计划，而且花费相当长的时间做计划，但他们看待计划的方式却截然不同。他们都视计划为基线，但是传统经理不断修正实际结果以符合那个基线。PMBOK称一种相关做法为纠偏行为，用来引导团队回归基线。在敏捷项目管理中，适应行为用来描述应该釆取什么行动方针（其中一个行为可能被修正以符合计划要求）。适应性有关的原则可以概括如下：•预测变化（不确定性），然后做相应调整，而不是遵循过期计划；•根据需要调整流程和做法。 响应变化的能力提升竞争优势。•思考每周发布一个新的产品版本的可能性（而不是问题）；•思考竞争优势能够提供功能包给客户，让客户感觉到是为他们个性化定制的软件和保持低消耗的软件维护费用。 团队必须适应，但是不能脱离最终的项冃目标。无论是适应性流程还是预测性流程，团队都应不断评估流程。可以用下面4个问题来评估流程：•在发布产品的同时，是否交付了价值？•是否实现了创造可靠的、具有适应性的产品质量目标？•项目进程是否满足可接受的要素范围？•团队是否在有效地适应管理、客户和技术等方面的变化？ 4.1 适应学适应性开发流程与优化流程具有不同的特征。优化反映的是说明性的“计划-设计-建造”周期，而适应反映的是有机的、进化的“构想成索-适应”周期。适应流程不是以一个解决方案开始，而是以多个可能的解决方案（试验）开始。应用一系列的适合性测试（实际产品功能或者模拟，取决于验收试验），根据反馈信息进行改变，从而探索并选择最好的解决方案。 4.2 探索变革是艰难的。敏捷领导者需要鼓励和激发团队成员度过这些高度变化的环境所造成的困难。鼓励包括保持自我镇静、鼓励试验、借鉴成功和错误经验，以及帮助团队成员理解这种鼓励的所有部分。创造变化，就是向对手展开竞争攻势。响应竞争对手的变化，就是在防守。好的领导者创造安全的环境，让人们说出奇特的想法，更何况一些想法原来并不奇特，外部的鼓励和激发可以帮助团队建立内部激励。伟大的探索来自于精神领袖。伟大的探索者清楚表述出可以激发人们灵感的目标。鼓励型领导者知道好目标和坏目标之间的区别。鼓励型领导知道设定一个产品的构想需要团队的努力，需要基于分析、理解和现实的风险评估，同时还要有一点冒险精神。领导者清楚阐述团队目标，团队成员透彻了解这些目标并以此激励自己。内在的激 励可以激发探索。团队需要有共同的目的和目标，也同样需要有人鼓励他们试验、探索、犯错误、重新编组和向前迈进。 4.3 响应变化预测变化（不确定性），然后做相应调整，而不是遵循过期计划。这条宣言反映了敏捷方法的观点，可以进一步归纳为：•构想一探索与计划一执行；•适应与预见。每个项目都有己知的和未知的条件、有确定因素和不确定因素，因此，每个项目都必须在计划和变化之间找到平衡。影响项目管理类型的另一个因素是迭代的成本，即试验成本。即使非常迫切需要创新，但如果迭代的成本非常高，可能会导致某个流程有较多的预期工作。低成本的迭代可以产生适应风格的开发，这种开发就是计划、体系结构和设计与实际的产品同时演变。 4.4 产品、流程和人员适应性有3个组成部分：产品、流程和人员。•需要拥有同心协力的敏捷团队，对变化有正确的态度;•需要有能让团队随时应 对变化的流程和做法;•需要有髙质量的能自动测试编码。要想拥有敏捷、适应的环境，产品、流程和人员都很重要。许多软件组织实施敏捷的障碍是他们没有处理遗留代码中的技术债务。这也是可以理解的，因为解决方案耗时耗钱。然而，不解决这一重大障碍，许多组织将不会实现其敏捷潜能。 4.5 障碍还是机会大多数情况下（不是所有情况），人们感觉适应变化有障碍（成本太贵）是因为做事效 率低下——没能抓住机会简化流程并提高组织的适应能力。敏捷开发需要短期迭代，做短期迭代需要找到快速、低成本的做重复事情的办法；•快速、低成本的做事情使得团队采用以前从没有想到的方式去适应变化;•快速、低成本的做事情促进创新，因为它鼓励团队试验。这些创新扩散并渗透到组织其他部分。降低变化成本促使公司重新思考他们的商业模式。 4.6 可靠，但不重复重复意味着按照同样 的方式做同样的事情，并取得同样的结果；而可靠意味着无论在前进道路中遇到什么障碍，都能达到目标，也意味着为达到一个目标而不断改变。可重复流程通过评估和不断的流程纠正，减少可变性。可靠流程将重点放在输出，而非输入。即使输入差别巨大，釆用可靠流程，团队成员也可以找到达到预定目标的方法。敏捷项目中需要考虑的正确范围不是限定的要求，而是清晰、明白的产品构想一个可发布的产品。尽管敏捷项目管理是可靠的，但它不是一贯正确的，它也不能消除不确定性的反复无常和在探索中遇到的出乎意料的事情。 4.7 反思和回顾有效的团队在回顾时会涉及4个领域：产品–A客户的角度和技术质量的角度；流程–团队正在使用的优秀流程和做法；团队–作 为高绩效团队，这个小组的工作情况如何；项目–项目按计划进行的如何。在每次迭 代结束时和项目末期，对这些领域进行回顾和反馈，然后适应，从而提高绩效。 4.8 从原则到做法人们所做的事和做事的方式最终产生优质的产品。原则和做法是向导，他们帮着确定和加强人们的行为。在敏捷项目中，既要有预见性也要有适应性的流程和做法。根据已知信息发布计划来预见未来。反思根据随后在项目中发现的信息来适应代码。 4.9 总结开发优质的产品需要探索，而不是遵循计划。探索和适应是创新的两个行为特质–拥有探索未知世界的勇气、拥有承认错误并适应形势的谦逊。 5.敏捷项目管理模式敏捷开发的信条之一是适应不同情况。通过使用根据具体情况而定的策略、流程和做法来提高效率和可靠性。使用一个共同的架构，而且能在其中选择各自不同的敏捷方法，对于较大型组织来讲，无疑具有很大的吸引力。 5.1 敏捷企业架构从上至下依次为投资组合治理、项目管理、迭代代理、技术实践。这个结构有利于组织釆取混合的敏捷方法，即每层使用不同的敏捷方法，以满足组织的特定需要。该架构倡导底层（技术实践层）具有较大灵活性，上层（项目管理层）灵活性较小。这种结构认同没有哪一种敏捷方法适合所有层次。 5.1.1 投资组合治理层主管们需要的就是一个通用的架构，可以用来评估所有项目。这个架构涉及主管们所关心的主要问题——投资和风险。主管们想知道项目的价值（及投资回报率）和获取该价值的确定性和不确定性。无论项目是什么类型——敏捷或是其他，都需要创建一个管理机制，解决这两个关键的代表项目属性的指标。 5.1.2 项目管理层项目管理即是与核心小组的外围利益相关者打交道，而迭代管理与核心小组的内部利益相关者打交道，这的确是两者差异的一部分，但只是一半。另一个很大的不同是一个是管理发布，一个是管理迭代。一个完整的项目发布计划，涉及构建产品和团队构想、开发项目范围、设定边界和制定全面的功能发布计划。项目管理还包括与核心小组外围的利益相关者和供应商合作。因此，项目管理层关注全面的项目/发布活动，协调多功能团队和管理项目外围事件。项目管理和迭代管理是可以是同一个领导者，也可以是不同的领导者，取决于项目的大小。 5.1.3 迭代管理层迭代管理层关注每个短期迭代的计划、执行和团队领导。 5.1.4 技术实践层软件项目中的技术实践，包括从持续集成到结对编程，从测试开发到重构等做法。硬件项目可能釆用一系列工程做法，从电子到机械不等。在各种各样的组织中，变革技术实践是实施敏捷方法的关键。分离出技术实践层的另外一个原因是，使敏捷项目管理更适合各种项目和产品类型。敏捷软件的等值做法在各种产品开发领域都很有价值。除了硬件项目中可能存在较长时间的迭代外，投资组合治理层、项目管理层和迭代层适用于想要把敏捷方法应用于非软件项目的公司。 5.2 敏捷交付架构流程也许不如人那么重要，但它绝非不重要。如果目标是重复性的制造，那么常规性流程是完全合理的；如果目标是可靠的创新，那么流程架构必须是有组织的、灵活的和容易适应的。敏捷项目管理模式的结构：构想一推测一探索一适应一结束，重点在交付（执行）和适应。•构想：确定产品构想、项目目标和控制要素、项目社团以及团队如何共同工作。•推测：制定基于性能和/或功能的发布计划，确保交付构想的产品。•探索：在短期内计划和提供它经测试的功能，不断致力于减少项目风险和不 确定性。•适应：审核提交的结果、当前情况以及团队的绩效，必要时做出调整。•结束：终止项目、交流主要的学习成果并庆祝。该架构中各阶段的命名与传统的阶段命名完全不同，其意义重大。第一，“构想”代替较传统的“开始”，指出构想的重要性；第二，推测阶段代替计划阶段。第三，敏捷项目管理模式用探索代替通常的设计、构建和测试阶段。以迭代交付的方式，很明显探索是非线性的、并存的、非瀑布式的模式。 5.2.1 阶段：构想构想阶段为客户和项目团队创建构想，该构想包括什么、谁提供提供和如何提供。构想是项目早期 “成功的关键因素”。首先，我们需要构想提供什么，即产品及项目范围构想；其次，我们需要构想参与者都有谁：客户、产品经理、项目团队成员和利益相关方组成的社团；最后，项目团队成员必须构想他们打算如何共同工作。 5.2.2 阶段：推测敏捷项目管理包括的构想和探索比计划和执行要多，它迫使我们面对这样的现实：不稳定的商业环境和变化多端的产品开发环境。推测阶段包括：•收集初始的、广泛的产品要求；•将工作量定义为一个产品功能清单；•制订一个迭代的、基于功能的交付计划；•把风险降低策略纳入计划；•估计项目成本，并生成其他必要的行政管理和财务信息。 5.2.3 阶段：探索探索阶段交付产品功能。从项目管理的角度看，这个阶段有3个关键的活动区域：第一，通过管理工作量和使用适当的技术方法和风险降低策略，技计划交付产品功能；第二，建立协作的、自我组织的项目社团，这是每个人的责任但需要由项目经理和迭代 领导者推动；第三，管理团队与客户、产品经理和其他利益相关方的相互交流。 5.2.4 阶段：适应控制和纠正是这个周期阶段常用的术语。在适应阶段，需要从客户、技术、入员和流程绩效，以及项目状况等方面对结果进行检査。要根据项目得到的最新信息，思考实际的与修订后的项目前景。修改后的结果将反馈并应用到重新计划工作中，以开始新的迭代。自构想阶段以后，其循环通常是推测——探索——适应，每次迭代都不断地优化产品。但是对团队收集新信息来说，定期修正构想阶段也尤为重要。 5.2.5 阶段：结束项目应该以庆功典礼为结束。结束阶段（以及每次迭代末尾的小型结束）的主要目标是；学习并将学到的东西融入下一次迭代工作中。或者传递给下一个项目团队。 5.2.6 不是完整的产品生命周期产品生命周期的前后两个阶段（早期的概念构想阶段和晩期的配置阶段）没被包含在这个架枸中，不是因为它们不重要，而是因为它们超出了本书的范围。 5.2.7 选择和整合做法原则指导做法，做法用实际例子证明原则，两者是相辅相成。在选择和使用做法时，作者采用了如下指导原则：•简单的；•再生的而非常规性的；•与敏捷价值观和原则一致的；•关注交付活动（增值）而非合规活动；•最少数量（刚好可以完成工作）的；•相互支持的（做法系统）。 5.2.8 需具备的判断力尽管项目可能遵照一般的构想、推测、探索、适应和结束 这个次序，但人们不应该将整个模式看作是固定的。生产型模式所用的阶段名称暗示着一个线性和重复的模式：开始、计划、定义、设计、构建、测试，而这里选用的敏捷项目管理术语是用来表示迭代演变：推测、探索、适应。过分强调线性会导致停滞不前，而过分强调演变会导致无休止的、最终证明是盲目的变化。对于任何一种模式，开发团队成员、产品团队成员和高级主管在应用时都需要作出敏锐的判断。敏捷方法中计划、架构和需求活动所用时间和传统的序列方法一样多，只是在敏捷方法中这些活动被分配到几次迭代和多次功能开发中。在序列开发过程中，早期的架构决策在项目晚期及实际的构建出现时才能得到验证。到那个时候， 已经花费了大量的时间和金钱。到时再改变这个架构，就成为一项重大的耗时的决定， 但通常已经不可能修改了。 5.2.9 项目规模敏捷项目管理的核心价值观和原则适用于任何规模的项目，相似的，在后面章节描 述的做法也适用于任何规模的项目。随着项目团队不断扩大，通常需要有更多的文档、有其他的协调做法、增加仪式 或者其他合规活动（如财务控制），这些扩展的做法同样也受敏捷项目管理的价值观和原则的指导。只要将重点集中在价值、交付、自我组织和自律，即使团队再大，面临的协 调问题再复杂，它也能随时应对商业、技术和组织的变化。 5.3 扩展的敏捷交付架构敏捷开发生命周期包括：构想阶段——推测阶段——探索阶段——产品开始阶段——结束阶段构想阶段：项目章程、产品构想、项目范围和界限、准备性评估、骨架结构、团队构想推测阶段：故事ID、发布计划探索阶段：迭代交付、项目领导产品开始阶段：最终评审和接受、最终质量评估和文档、增量交付和最终产品部署结束阶段：项目反思、最终项目、最终项目、产品文档、清理余下问题迭代交付包括：准备和计划——开发——质量评估和接受测试——评审和适应（持续和故事部署贯穿始终）持续：架构和设计演变，持续构建和集成，项目管理，日常站立会议，文档，变化协调，迁移和集成。 5.4 结束语像敏捷项目一样，敏捷架构应该在结构和灵活性之间保持平衡。随着组织中敏捷项 目的数量和规模不断増大，组织就需要有一个通用的架构、一些通用的指导原则、少许标准做法和一套通用的价值观。“敏捷艺术”，即平衡结构和灵活性的能力。它用有效的领导力和敏捷经验去发现每个组织的最佳平衡点。","link":"/2021/04/08/Agile-Management/"},{"title":"项目管理的132种工具","text":"数据收集工具与技术（9个）标杆对照 标杆对照是将实际或计划的项目实践或项目的质量标准与可比项目的实践进行比较，以便识别最佳实践，形成改进意见，并为绩效考核提供依据。 标杆对照也允许用不同应用领域或行业的项目做类比。 将相关方分析的结果与其他被视为世界级的组织或项目的信息进行比较。头脑风暴 头脑风暴是一种数据收集和创意技术，主要用于在短时间内获得大量创意，适用于团队环境，需要引导者进行引导。核查表 在收集数据时用作查对清单的计数表格。 核对单 核对单是一种结构化工具，通常列出特定组成部分，用来核实所要求的一系列步骤是否已得到执行或检查需求列表是否已得到满足。 核对单有助于以结构化方式管理控制质量活动。 核对单是包括需要考虑的项目、行动或要点的清单。焦点小组 焦点小组召集相关方和主题专家讨论项目风险、成功标准和其他议题，比一对一访谈更有利于互动交流。 焦点小组召集相关方讨论项目管理方法以及项目管理计划各个组成部分的整合方式。 焦点小组是召集预定的相关方和主题专家，了解他们对所讨论的产品、服务或成果的期望和态度。由一位受过训练的主持人引导大家进行互动式讨论。焦点小组往往比“一对一”的访谈更热烈。访谈 通过与相关方直接交谈，来获取信息的正式或非正式方法。市场调研 市场调研包括考察行业情况和具体卖方的能力。问卷和调查 问卷调查是指设计一系列书面问题，向众多受访者快速收集信息。问卷调查方法非常适用于以下情况：受众多样化，需要快速完成调查，受访者地理位置分散，并且适合开展统计分析。 问卷调查可用于在部署产品或服务之后收集关于客户满意度的数据。在问卷调查中识别的缺陷相关成本可被视为 COQ 模型中的外部失败成本，给组织带来的影响会超出成本本身。 问卷和调查可以包括一对一调查、焦点小组讨论，或其他大规模信息收集技术。统计抽样 从目标总体中选取部分样本用于检查。 样本用于测量控制和确认质量。抽样的频率和规模应在规划质量管理过程中确定。 数据分析工具与技术（42个）备选方案分析 备选方案分析是一种对已识别的可选方案进行评估的技术，用来决定选择哪种方案或使用何种方法来执行项目工作。 备选方案分析用于在出现偏差时选择要执行的纠正措施或纠正措施和预防措施的组合。 备选方案分析用于比较不同的资源能力或技能水平、进度压缩技术、不同工具（手动和自动），以及关于资源的创建、租赁和购买决策。 备选方案分析可包括审查筹资的战略方法，如自筹资金、股权投资、借贷投资等，还可以包括对筹集项目资源的方法（如自制、采购、租用或租赁）的考量。其他风险参数评估 为了方便未来分析和行动，在对单个项目风险进行优先级排序时，项目团队可能考虑（除概率和影响以外的）其他风险特征。假设条件和制约因素分析 每个项目及其项目管理计划的构思和开发都基于一系列的假设条件，并受一系列制约因素的限制。这些假设条件和制约因素往往都已纳入范围基准和项目估算。 开展假设条件和制约因素分析，来探索假设条件和制约因素的有效性，确定其中哪些会引发项目风险。 从假设条件的不准确、不稳定、不一致或不完整，可以识别出威胁，通过清除或放松会影响项目或过程执行的制约因素，可以创造出机会。质量成本 在估算时，可能要用到关于质量成本的各种假设，这包括对以下情况进行评估： 是为达到要求而增加投入，还是承担不符合要求而造成的成本； 是寻求短期成本降低，还是承担产品生命周期后期频繁出现问题的后果。 预防成本。预防特定项目的产品、可交付成果或服务质量低劣所带来的相关成本。 评估成本。评估、测量、审计和测试特定项目的产品、可交付成果或服务所带来的相关成本。 失败成本（内部/外部）。因产品、可交付成果或服务与相关方需求或期望不一致而导致的相关成本。成本效益分析 成本效益分析是用来估算备选方案优势和劣势的财务分析工具，以确定可以创造最佳效益的备选方案。 成本效益分析有助于在项目出现偏差时确定最节约成本的纠正措施。 该分析有助于确定变更请求是否值得投入相关成本。 成本效益分析可帮助项目经理确定规划的质量活动是否有效利用了成本。达到质量要求的主要效益包括减少返工、提高生产率、降低成本、提升相关方满意度及提升赢利能力。对每个质量活动进行成本效益分析，就是要比较其可能成本与预期效益。 成本效益分析有助于在项目成本出现差异时确定最佳的纠正措施。 如果能够把单个项目风险的影响进行货币量化，那么就可以通过成本收益分析来确定备选风险应对策略的成本有效性。决策树分析 用决策树在若干备选行动方案中选择一个最佳方案。在决策树中，用不同的分支代表不同的决策或事件，即项目的备选路径。每个决策或事件都有相关的成本和单个项目风险（包括威胁和机会）。决策树分支的终点表示沿特定路径发展的最后结果，可以是负面或正面的结果。文件分析 评估现有文件有助于总结经验教训和分享知识，以改进未来项目和组织资产。 文件分析包括审核和评估任何相关的文件信息。在此过程中，文件分析用于通过分析现有文件，识别与需求相关的信息来获取需求。 分析项目控制过程所输出的不同文件，如质量报告、测试报告、绩效报告和偏差分析，可以重点指出可能超出控制范围之外并阻碍项目团队满足特定要求或相关方期望的过程。 通过对项目文件的结构化审查，可以识别出一些风险。可供审查的文件包括（但不限于）计划、假设条件、制约因素、以往项目档案、合同、协议和技术文件。项目文件中的不确定性或模糊性，以及同一文件内部或不同文件之间的不一致，都可能是项目风险的指示信号。 评估现有项目文件及以往项目的经验教训，以识别相关方和其他支持性信息。挣值分析 挣值分析对范围、进度和成本绩效进行了综合分析。 进度绩效测量指标（如进度偏差（SV）和进度绩效指数（SPI））用于评价偏离初始进度基准的程度。 挣值分析将实际进度和成本绩效与绩效测量基准进行比较。EVM把范围基准、成本基准和进度基准整合起来，形成绩效测量基准。它针对每个工作包和控制账户，计算并监测以下三个关键指标：PV,EV,AC。 计算进度和成本偏差，以及进度和成本绩效指数，以确定偏离目标的程度。影响图 影响图是不确定条件下决策制定的图形辅助工具。它将一个项目或项目中的一种情境表现为一系列实体、结果和影响，以及它们之间的关系和相互影响。如果因为存在单个项目风险或其他不确定性来源而使影响图中的某些要素不确定，就在影响图中以区间或概率分布的形式表示这些要素；然后，借助模拟技术（如蒙特卡洛分析）来分析哪些要素对重要结果具有最大的影响。影响图分析，可以得出类似于其他定量风险分析的结果，如 S 曲线图和龙卷风图。迭代燃尽图 用于追踪迭代未完项中尚待完成的工作。它基于迭代规划中确定的工作，分析与理想燃尽图的偏差。可使用预测趋势线来预测迭代结束时可能出现的偏差，以及在迭代期间应该采取的合理行动。自制或外购分析 自制或外购分析用于确定某项工作或可交付成果最好由项目团队自行完成，还是应该从外部采购。制定自制或外购决策时应考虑的因素包括；组织当前的资源配置及其技能和能力，对专业技术的需求，不愿承担永久雇用的义务，以及对独特技术专长的需求；还要评估与每个自制或外购决策相关的风险。绩效审查 绩效审查是指根据进度基准，测量、对比和分析进度绩效，如实际开始和完成日期、已完成百分比，以及当前工作的剩余持续时间。 绩效审查针对实际结果，测量、比较和分析规划质量管理过程中定义的质量测量指标。 绩效审查是测量、比较和分析计划的资源使用和实际资源使用的不同。分析成本和进度工作绩效信息有助于指出可能影响资源使用的问题。 对照协议，对质量、资源、进度和成本绩效进行测量、比较和分析，以审查合同工作的绩效。其中包括确定工作包提前或落后于进度计划、超出或低于预算，以及是否存在资源或质量问题。过程分析 过程分析可以识别过程改进机会，同时检查在过程期间遇到的问题、制约因素，以及非增值活动。建议书评估 对建议书进行评估，确定它们是否对包含在招标文件包中的招标文件、采购工作说明书、供方选择标准和其他文件，都做出了完整且充分的响应。回归分析 该技术分析作用于项目结果的不同项目变量之间的相互关系，以提高未来项目的绩效。储备分析 储备分析用于确定项目所需的应急储备量和管理储备。 为应对成本的不确定性，成本估算中可以包括应急储备（有时称为“应急费用”）。 可用于制定预算过程的数据分析技术包括（但不限于）可以建立项目管理储备的储备分析。管理储备是为了管理控制的目的而特别留出的项目预算，用来应对项目范围中不可预见的工作，目的是用来应对会影响项目的“未知 — 未知”风险。 在控制成本过程中，可以采用储备分析来监督项目中应急储备和管理储备的使用情况，从而判断是否还需要这些储备，或者是否需要增加额外的储备。 在整个项目执行期间，可能发生某些单个项目风险，对预算和进度应急储备产生正面或负面的影响。 储备分析是指在项目的任一时点比较剩余应急储备与剩余风险量，从而确定剩余储备是否仍然合理。可以用各种图形（如燃尽图）来显示应急储备的消耗情况。风险数据质量评估 风险数据质量评估旨在评价关于单个项目风险的数据的准确性和可靠性。使用低质量的风险数据，可能导致定性风险分析对项目来说基本没用。如果数据质量不可接受，就可能需要收集更好的数据。可以开展问卷调查，了解项目相关方对数据质量各方面的评价，包括数据的完整性、客观性、相关性和及时性，进而对风险数据的质量进行综合评估。可以计算这些方面的加权平均数，将其作为数据质量的总体分数。风险概率和影响矩阵 风险概率评估考虑的是特定风险发生的可能性，而风险影响评估考虑的是风险对一项或多项项目目标的潜在影响，如进度、成本、质量或绩效。威胁将产生负面的影响，机会将产生正面的影响。要对每个已识别的单个项目风险进行概率和影响评估。风险评估可以采用访谈或会议的形式，参加者将依照他们对风险登记册中所记录的风险类型的熟悉程度而定。项目团队成员和项目外部资深人员应该参加访谈或会议。在访谈或会议期间，评估每个风险的概率水平及其对每项目标的影响级别。如果相关方对概率水平和影响级别的感知存在差异，则应对差异进行探讨。此外，还应记录相应的说明性细节，例如，确定概率水平或影响级别所依据的假设条件。应该采用风险管理计划中的概率和影响定义，来评估风险的概率和影响。低概率和影响的风险将被列入风险登记册中的观察清单，以供未来监控。根本原因分析 根本原因分析关注识别问题的主要原因，它可用于识别出现偏差的原因以及项目经理为达成项目目标应重点关注的领域。 根本原因分析是确定引起偏差、缺陷或风险的根本原因的一种分析技术。一项根本原因可能引起多项偏差、缺陷或风险。 根本原因分析还可以作为一项技术，用于识别问题的根本原因并解决问题。消除所有根本原因可以杜绝问题再次发生。 根本原因分析用于识别缺陷成因。 根本原因分析常用于发现导致问题的深层原因并制定预防措施。可以用问题陈述（如项目可能延误或超支）作为出发点，来探讨哪些威胁可能导致该问题，从而识别出相应的威胁。也可以用收益陈述（如提前交付或低于预算）作为出发点，来探讨哪些机会可能有利于实现该效益，从而识别出相应的机会。 开展根本原因分析，识别是什么根本原因导致了相关方对项目的某种支持水平，以便选择适当策略来改进其参与水平。 开展根本原因分析，确定相关方参与未达预期效果的根本原因。敏感性分析 敏感性分析有助于确定哪些单个项目风险或其他不确定性来源对项目结果具有最大的潜在影响。它在项目结果变异与定量风险分析模型中的要素变异之间建立联系。 敏感性分析的结果通常用龙卷风图来表示。模拟 模拟是把单个项目风险和不确定性的其他来源模型化的方法，以评估它们对项目目标的潜在影响。最常见的模拟技术是蒙特卡罗分析。 在定量风险分析中，使用模型来模拟单个项目风险和其他不确定性来源的综合影响，以评估它们对项目目标的潜在影响。模拟通常采用蒙特卡洛分析。相关方分析 可通过相关方分析确定项目相关方的风险偏好。 相关方分析会产生相关方清单和关于相关方的各种信息，例如，在组织内的位置、在项目中的角色、与项目的利害关系、期望、态度（对项目的支持程度），以及对项目信息的兴趣。 包括：兴趣、权利（合法权利或道德权利）、所有权、知识、贡献。 开展相关方分析，确定相关方群体和个人在项目任何特定时间的状态。SWOT分析 这是对项目的优势、劣势、机会和威胁 (SWOT) 进行逐个检查。技术绩效分析 开展技术绩效分析，把项目执行期间所取得的技术成果与取得相关技术成果的计划进行比较。它要求定义关于技术绩效的客观的、量化的测量指标，以便据此比较实际结果与计划要求。技术绩效测量指标可能包括：重量、处理时间、缺陷数量、储存容量等。实际结果偏离计划的程度可以代表威胁或机会的潜在影响。趋势分析 趋势分析 Trend Analysis: 根据历史数据并利用数学模型，预测未来结果的一种分析技术。偏差分析 偏差分析 Variance Analysis: 确定实际绩效与基准的差异程度及原因的一种技术。假设情景分析 假设情景分析是对各种情景进行评估，预测它们对项目目标的影响（积极或消极的）。 假设情景分析基于项目风险管理过程的输出，对各种不同的情景进行评估，促使进度模型符合项目管理计划和批准的基准。亲和图 亲和图 Affinity Diagrams: 一种用来对大量创意进行分组，以便进一步审查和分析的技术。因果图 因果图 Cause and Effect Diagram: 一种分解技术，有助于追溯造成非预期结果的根本原因。控制图 Control Chart. 控制图 按时间顺序展示过程数据，并将这些数据与既定的控制界限相比较的一种图形。控制图有一条中心线，有助于观察图中的数据点向两边控制界限偏移的趋势。流程图 流程图，也称过程图，用来显示在一个或多个输入转化成一个或多个输出的过程中，所需要的步骤顺序和可能分支。它通过映射水平价值链的过程细节来显示活动、决策点、分支循环、并行路径及整体处理顺序。 流程图可能有助于了解和估算一个过程的质量成本。 流程图有时又被称为“过程流程图”或“过程流向图”，可帮助改进过程并识别可能出现质量缺陷或可以纳入质量检查的地方。层级图 可以采用传统的组织结构图，自上而下地显示各种职位及其相互关系。 如果使用了两个以上的参数对风险进行分类，那就不能使用概率和影响矩阵，而需要使用其他图形。例如，气泡图能显示三维数据。直方图 直方图是一种展示数字数据的条形图，可以展示每个可交付成果的缺陷数量、缺陷成因的排列、各个过程的不合规次数，或项目或产品缺陷的其他表现形式。逻辑数据模型 逻辑数据模型把组织数据可视化，以商业语言加以描述，不依赖任何特定技术。逻辑数据模型可用于识别会出现数据完整性或其他质量问题的地方。矩阵图 矩阵图在行列交叉的位置展示因素、原因和目标之间的关系强弱。有助于识别对项目成功至关重要的质量测量指标。责任分配矩阵（矩阵基础图） Responsibility Assignment Matrix (RAM): 一种展示项目资源在各个工作包中的任务分配的表格。思维导图 Mind-Mapping: 把从头脑风暴中获得的创意整合成一张图的技术，用以反映创意之间的共性与差异，激发新创意。概率和影响矩阵 概率和影响矩阵是把每个风险发生的概率和一旦发生对项目目标的影响映射起来的表格。散点图 散点图是一种展示两个变量之间的关系的图形，它能够展示两支轴的关系，一支轴表示过程、环境或活动的任何要素，另一支轴表示质量缺陷。 散点图可在一支轴上展示计划的绩效，在另一支轴上展示实际绩效。相关方参与度评估矩阵 相关方参与度评估矩阵用于将相关方当前参与水平与期望参与水平进行比较。 .不了解型。不知道项目及其潜在影响。 .抵制型。知道项目及其潜在影响，但抵制项目工作或成果可能引发的任何变更。此类相关方不会支持项目工作或项目成果。 .中立型。了解项目，但既不支持，也不反对。 .支持型。了解项目及其潜在影响，并且会支持项目工作及其成果。 .领导型。了解项目及其潜在影响，而且积极参与以确保项目取得成功。相关方映射分析/表现 相关方映射分析和表现是一种利用不同方法对相关方进行分类的方法。常见的分类方法包括： 权力利益方格、权力影响方格，或作用影响方格。 相关方立方体（有助于沟通策略的制定）。 凸显模型（确定已识别相关方的相对重要性）。 影响方向（向上，向下，向外，横向）。 优先级排序。文本型（面向文本的格式） 如果需要详细描述团队成员的职责，就可以采用文本型。 决策工具与技术（3个）多标准决策分析 借助决策矩阵，用系统分析方法建立诸如风险水平、不确定性和价值收益等多种标准，以对众多创意进行评估和排序。投票 投票是为达成某种期望结果，而对多个未来行动方案进行评估的过程。独裁型决策制定 由一个人负责为整个集体制定决策。 沟通技巧工具与技术（2个）反馈 反馈是关于沟通、可交付成果或情况的反应信息。反馈支持项目经理和团队及所有其他项目相关方之间的互动沟通。演示 演示是信息和/或文档的正式交付。向项目相关方明确有效地演示项目信息可包括（但不限于）： （1）向相关方报告项目进度和信息更新； （2）提供背景信息以支持决策制定； （3）提供关于项目及其目标的通用信息，以提升项目工作和项目团队的形象； （4）提供具体信息，以提升对项目工作和目标的理解和支持力度； （5）为获得演示成功，应该从内容和形式上考虑一下因素； （6）受众及其期望和需求； （7）项目和项目团队的需求及目标。 人际关系与团队技能工具与技术（17个）积极倾听 积极倾听技术包括告知已收到、澄清与确认信息、理解，以及消除妨碍理解的障碍。沟通风格评估 规划沟通活动时，用于评估沟通风格并识别偏好的沟通方法、形式和内容的一种技术。冲突管理 成功的冲突管理可提高生产力，改进工作关系。同时，如果管理得当，意见分歧有利于提高创造力和改进决策 .撤退/回避。从实际或潜在冲突中退出，将问题推迟到准备充分的时候，或者将问题推给其他人员解决。 .缓和/包容。强调一致而非差异；为维持和谐与关系而退让一步，考虑其他方的需要。 .妥协/调解。为了暂时或部分解决冲突，寻找能让各方都在一定程度上满意的方案，但这种方法有时会导致“双输”局面。 .强迫/命令。以牺牲其他方为代价，推行某一方的观点；只提供赢 — 输方案。通常是利用权力来强行解决紧急问题，这种方法通常会导致“赢输”局面。 .合作/解决问题。综合考虑不同的观点和意见，采用合作的态度和开放式对话引导各方达成共识和承诺，这种方法可以带来双赢局面。文化意识 文化意识指理解个人、群体和组织之间的差异，并据此调整项目的沟通策略。制定决策 决策包括谈判能力以及影响组织与项目管理团队的能力，而不是决策工具集所描述的一系列工具。进行有效决策需要： .着眼于所要达到的目标； .遵循决策流程； .研究环境因素； .分析可用信息； .激发团队创造力； .理解风险。情商 Emotional Intelligence. 识别、评估和管理个人情绪、他人情绪及团组群体情绪的能力。引导 引导是指有效引导团队活动成功以达成决定、解决方案或结论的能力。影响力 在矩阵环境中，项目经理对团队成员通常没有或仅有很小的命令职权，所以他们适时影响相关方的能力，对保证项目成功非常关键。领导力 领导力技能包括指导、激励和带领团队的能力。这些技能可能包括协商、抗压、沟通、解决问题、批判性思考和人际关系技能等基本能力。会议管理 会议管理是采取步骤确保会议有效并高效地达到预期目标的过程激励 激励是组织通过设计适当的外部奖酬形式和工作环境，以一定的行为规范和惩罚性措施，借助信息沟通，来激发、引导、保持和规范组织成员的行为，以有效地实现组织及其个人目标的过程。激励能为某人采取行动提供了理由，提高团队参与决策的能力并鼓励他们独立工作。谈判 谈判是为达成协议而进行的讨论，它用于获得支持或达成关于支持项目工作或成果的协议，并解决及团队内部或团队与其他相关方之间的冲突。人际交往 Networking: 与同一组织和不同组织中的人员建立联系和关系。名义小组技术 Nominal Group Technique. 用于促进头脑风暴的一种技术，通过投票排列最有用的创意，以便进一步开展头脑风暴或优先排序。观察和交谈 是指直接察看个人在各自的环境中如何执行工作（或任务）和实施流程。观察，也称为“工作跟随”。 与项目团队展开讨论和对话，有助于确定最合适的方法，用于更新和沟通项目绩效，以及回应相关方的信息请求。 通过观察和交谈，项目经理能够发现团队内的问题、人员间的冲突，或个人绩效问题。 通过观察和交谈，及时了解项目团队成员和其他相关方的工作和态度。政治意识 政治意识是指对正式和非正式权力关系的认知，以及在这些关系中工作的意愿。团队建设 通过举办各种活动，强化团队的社交关系，打造积极合作的工作环境。 未分组工具与技术（59个）广告 广告是就产品、服务或成果与用户或潜在用户进行的沟通。在大众出版物（如指定的报纸）或专门行业出版物上刊登广告，往往可以扩充现有的潜在卖方名单。大多数政府机构都要求公开发布采购广告，或在网上公布拟签署的政府合同的信息。敏捷发布规划 敏捷发布规划基于项目路线图和产品发展愿景，提供了高度概括的发布进度时间轴（通常是 3 到 6个月）。类比估算 类比估算是一种使用相似活动或项目的历史数据，来估算当前活动或项目的持续时间或成本的技术。 成本类比估算使用以往类似项目的参数值或属性来估算。 类比估算将以往类似项目的资源相关信息作为估算未来项目的基础。这是一种快速估算方法，适用于项目经理只能识别 WBS 的几个高层级的情况下。审计 审计是用于确定项目活动是否遵循了组织和项目的政策、过程与程序的一种结构化且独立的过程。 质量审计通常由项目外部的团队开展，如组织内部审计部门、项目管理办公室 (PMO) 或组织外部的审计师。 风险审计是一种审计类型，可用于评估风险管理过程的有效性。项目经理负责确保按项目风险管理计划所规定的频率开展风险审计。 风险审计可以在日常项目审查会上开展，可以在风险审查会上开展，团队也可以召开专门的风险审计会。在实施审计前，应明确定义风险审计的程序和目标。 审计是对采购过程的结构化审查。应该在采购合同中明确规定与审计有关的权利和义务。买方的项目经理和卖方的项目经理都应该关注审计结果，以便对项目进行必要调整。投标人会议 投标人会议（又称承包商会议、供应商会议或投标前会议）是在卖方提交建议书之前，在买方和潜在卖方之间召开的会议，其目的是确保所有潜在投标人对采购要求都有清楚且一致的理解，并确保没有任何投标人会得到特别优待。自下而上的估算 自下而上估算是一种估算项目持续时间或成本的方法，通过从下到上逐层汇总 WBS 组成部分的估算而得到项目估算。 自下而上估算是对工作组成部分进行估算的一种方法。首先对单个工作包或活动的成本进行最具体、细致的估算，然后把这些细节性成本向上汇总或“滚动”到更高层次，用于后续报告和跟踪。 自下而上估算的准确性及其本身所需的成本，通常取决于单个活动或工作包的规模或其他属性。 团队和实物资源在活动级别上估算，然后汇总成工作包、控制账户和总体项目层级上的估算。变更控制工具 为了便于开展配置和变更管理，可以使用一些手动或自动化的工具。配置控制重点关注可交付成果及各个过程的技术规范，而变更控制则着眼于识别、记录、批准或否决对项目文件、可交付成果或基准的变更。索赔管理 如果买卖双方不能就变更补偿达成一致意见，或对变更是否发生存在分歧，那么被请求的变更就成为有争议的变更或潜在的推定变更。此类有争议的变更称为索赔。如果不能妥善解决，它们会成为争议并最终引发申诉。在整个合同生命周期中，通常会按照合同条款对索赔进行记录、处理、监督和管理。如果合同双方无法自行解决索赔问题，则可能不得不按合同中规定的程序，用替代争议解决方法（ADR）去处理。谈判是解决所有索赔和争议的首选方法。集中办公 集中办公是指把许多或全部最活跃的项目团队成员安排在同一个物理地点工作，以增强团队工作能力。集中办公既可以是临时的（如仅在项目特别重要的时期），也可以贯穿整个项目。实施集中办公策略，可借助团队会议室、张贴进度计划的场所，以及其他能增进沟通和集体感的设施。沟通方法 互动沟通，推式沟通，拉式沟通。沟通模型 沟通模型可以是最基本的线性（发送方和接收方）沟通过程，也可以是增加了反馈元素（发送方、接收方和反馈）、更具互动性的沟通形式，甚至可以是融合了发送方或接收方的人性因素、试图考虑沟通复杂性的更加复杂的沟通模型。沟通需求分析 分析沟通需求，确定项目相关方的信息需求，包括所需信息的类型和格式，以及信息对相关方的价值。沟通技术 信息交换和协作的常见方法包括对话、会议、书面文件、数据库、社交媒体和网站。系统交互图 Context Diagrams: 对产品范围的可视化描绘，显示业务系统（过程、设备、计算机系统等）及其与人和其他系统（行动者）之间的交互方式。应急应对策略 可以设计一些仅在特定事件发生时才采用的应对措施。对于某些风险，如果项目团队相信其发生会有充分的预警信号，那么就应该制定仅在某些预定条件出现时才执行的应对计划。应该定义并跟踪应急应对策略的触发条件，例如，未实现中间的里程碑，或获得卖方更高程度的重视。成本汇总 先把成本估算汇总到 WBS 中的工作包，再由工作包汇总至 WBS 的更高层次（如控制账户），最终得出整个项目的总成本。关键路径法 关键路径法用于在进度模型中估算项目最短工期，确定逻辑网络路径的进度灵活性大小。这种进度网络分析技术在不考虑任何资源限制的情况下，沿进度网络路径使用顺推与逆推法，计算出所有活动的最早开始、最早结束、最晚开始和最晚法完成日期分解 Decomposition: 把项目范围和项目可交付成果逐步划分为更小、更便于管理的组成部分的技术。确定和整合依赖关系 依赖关系可能是强制或选择的，内部或外部的。这四种依赖关系可以组合成强制性外部依赖关系、强制性内部依赖关系、选择性外部依赖关系或选择性内部依赖关系。面向X的设计 面向 X 的设计 (DfX) 是产品设计期间可采用的一系列技术指南，旨在优化设计的特定方面，可以控制或提高产品最终特性。 DfX 中的“X”可以是产品开发的不同方面，例如可靠性、调配、装配、制造、成本、服务、可用性、安全性和质量。使用 DfX 可以降低成本、改进质量、提高绩效和客户满意度。专家判断 Expert Judgment: 基于某应用领域、知识领域、学科和行业等的专业知识而做出的，关于当前活动的合理判断。这些专业知识可来自具有专业学历、知识、技能、经验或培训经历的任何小组或个人。融资 融资是指为项目获取资金。长期的基础设施、工业和公共服务项目通常会寻求外部融资。如果项目使用外部资金，出资实体可能会提出一些必须满足的要求。资金限制平衡 根据对项目资金的任何限制，来平衡资金支出。如果发现资金限制与计划支出之间的差异，则可能需要调整工作的进度计划，以平衡资金支出水平。这可以通过在项目进度计划中添加强制日期来实现。基本规则 根据团队章程中定义的基本规则，来明确项目团队成员和其他相关方应该采取什么行为去引导相关方参与。历史信息审核 审核历史信息有助于进行参数估算或类比估算。历史信息可包括各种项目特征（参数），它们用于建立数学模型预测项目总成本。个人和团队评估 个人和团队评估工具能让项目经理和项目团队洞察成员的优势和劣势。这些工具可帮助项目经理评估团队成员的偏好和愿望、团队成员如何处理和整理信息、如何制定决策，以及团队成员如何与他人打交道。 有各种可用的工具，如态度调查、专项评估、结构化访谈、能力测试及焦点小组。 这些工具有利于增进团队成员间的理解、信任、承诺和沟通，在整个项目期间不断提高团队成效。信息管理 信息管理工具和技术用于创建人们与知识之间的联系，可以有效促进简单、明确的显性知识的分享，包括（但不限于）： 编撰显性知识的方法，例如，如何确定经验教训登记册的条目； 经验教训登记册； 图书馆服务； 信息收集，例如搜索网络和阅读已发表的文章； 项目管理信息系统 (PMIS)。项目管理信息系统通常包括文档管理系统。检查 检查是指开展测量、审查与确认等活动，来判断工作和可交付成果是否符合需求和产品验收标准。检查有时也被称为审查、产品审查和巡检等。 检查是指检验工作产品，以确定是否符合书面标准。检查的结果通常包括相关的测量数据，可在任何层面上进行。可以检查单个活动的成果，也可以检查项目的最终产品。检查也可称为审查、同行审查、审计或巡检等，而在某些应用领域，这些术语的含义比较狭窄和具体。检查也可用于确认缺陷补救。 检查是指对承包商正在执行的工作进行结构化审查，可能涉及对可交付成果的简单审查，或对工作本身的实地审查。在施工、工程和基础设施建设项目中，检查包括买方和承包商联合巡检现场，以确保双方对正在进行的工作有共同的认识。知识管理 知识管理工具和技术将员工联系起来，使他们能够合作生成新知识、分享隐性知识，以及集成不同团队成员所拥有的知识。适用于项目的工具和技术取决于项目的性质，尤其是创新程度、项目复杂性，以及团队的多元化（包括学科背景多元化）程度。提前量和滞后量 提前量是相对于紧前活动，紧后活动可以提前的时间量。 滞后量是相对于紧前活动，紧后活动需要推迟的时间量。会议 指有组织、有领导、有目的的议事活动，它是在限定的时间和地点，按照一定的程序进行的。它可以是面对面或虚拟会议，正式或非正式会议。参会者可以包括项目团队成员和其他合适的项目相关方；会议的类型包括（但不限于）用于小组会议和用户审查会议。组织理论 组织理论阐述个人、团队和组织部门的行为方式。有效利用组织理论中的常用技术，可以节约规划资源管理过程的时间、成本及人力投入，提高规划工作的效率。此外，可以根据相关的组织理论灵活使用领导风格，以适应项目生命周期中团队成熟度的变化。重要的是要认识到，组织的结构和文化影响项目组织结构。参数估算 参数估算是一种基于历史数据和项目参数，使用某种算法来计算成本或持续时间的估算技术。 它是指利用历史数据之间的统计关系和其他变量（如建筑施工中的平方英尺），来估算诸如成本、预算和持续时间等活动参数。预分派 预分派指事先确定项目的实物或团队资源，可在下列情况下发生：在竞标过程中承诺分派特定人员进行项目工作；项目取决于特定人员的专有技能；在完成资源管理计划的前期工作之前，制定项目章程过程或其他过程已经指定了某些团队成员的工作分派。紧前关系绘图法 紧前关系绘图法（PDM）是创建进度模型的一种技术，用节点表示活动，用一种或多种逻辑关系连接活动，以显示活动的实施顺序。 PDM 包括四种依赖关系或逻辑关系（FS、FF、SS、SF）问题解决 问题解决发现解决问题或应对挑战的解决方案。它包括收集其他信息、具有批判性思维的、创造性的、量化的和/或逻辑性的解决方法。有效和系统化地解决问题是质量保证和质量改进的基本要素。问题可能在控制质量过程或质量审计中发现，也可能与过程或可交付成果有关。使用结构化的问题解决方法有助于消除问题和制定长久有效的解决方案。 问题解决可能会用到一系列工具，有助于项目经理解决控制资源过程中出现的问题。产品分析 在以产品为可交付成果的项目上，用来定义范围的一种工具。通常，针对产品提问并回答，形成对将要生产的产品的用途、特征和其他方面的描述。项目管理信息系统 即PMIS，有收集、整合和传播项目管理过程成果的工具和技术所组成的信息系统。质量报告 质量报告可能是图形、数据或定性文件，其中包含的信息可帮助其他过程和部门采取纠正措施，以实现项目质量期望。质量报告的信息可以包含团队上报的质量管理问题，针对过程、项目和产品的改善建议，纠正措施建议（包括返工、缺陷/漏洞补救、100% 检查等），以及在控制质量过程中发现的情况的概述。提示清单 提示清单是关于可能引发单个项目风险以及可作为整体项目风险来源的风险类别的预设清单。 如 PESTLE（政治、经济、社会、技术、法律、环境）、TECOP（技术、环境、商业、运营、政治），或 VUCA（易变性、不确定性、复杂性、模糊性）原型法 原型法是指在实际制造预期产品之前，先造出该产品的模型，并据此征求对需求的早期反馈。 故事板是一种原型技术，通过一系列的图像或图示来展示顺序或导航路径。质量改进方法 质量改进的开展，可基于质量控制过程的发现和建议、质量审计的发现，或管理质量过程的问题解决。 计划 — 实施 — 检查 — 行动和六西格玛是最常用于分析和评估改进机会的两种质量改进工具。认可与奖励 在建设项目团队过程中，需要对成员的优良行为给予认可与奖励。最初的奖励计划是在规划资源管理过程中编制的，只有能满足被奖励者的某个重要需求的奖励，才是有效的奖励。在管理项目团队过程中，可以正式或非正式的方式做出奖励决定，但在决定认可与奖励时，应考虑文化差异。不确定性表现方式 要开展定量风险分析，就需要建立能反映单个项目风险和其他不确定性来源的定量风险分析模型，并为之提供输入。 概率分布可能有多种形式，最常用的有三角分布、正态分布、对数正态分布、贝塔分布、均匀分布或离散分布。资源优化 资源优化用于调整活动的开始和完成日期，以调整计划使用的资源，使其等于或少于可用的资源。资源优化技术是根据资源供需情况，来调整进度模型的技术，包括（但不限于）：资源平衡、资源平滑。 资源优化技术是在同时考虑资源可用性和项目时间的情况下，对活动和活动所需资源进行的进度规划。风险分类 项目风险可依据风险来源（如采用风险分解结构 [RBS]）、受影响的项目领域（如采用工作分解结构 [WBS]），以及其他实用类别（如项目阶段、项目预算、角色和职责）来分类，确定哪些项目领域最容易被不确定性影响；风险还可以根据共同的根本原因进行分类。应该在风险管理计划中规定可用于项目的风险分类方法。滚动式规划 滚动式规划是一种迭代式的规划技术，即详细规划近期要完成的工作，同时在较高层级上粗略规划远期工作。它是一种渐进明细的规划方式，适用于工作包、规划包以及采用敏捷或瀑布式方法的发布规划。进度压缩 进度压缩技术是指在不缩减项目范围的前提下，缩短或加快进度工期，以满足进度制约因素、强制日期或其他进度目标。 采用进度压缩技术使进度落后的项目活动赶上计划，可以对剩余工作使用快速跟进或赶工方法。进度网络分析 进度网络分析是创建项目进度模型的一种综合技术，它采用了其他几种技术，例如关键路径法、资源优化技术和建模技术。其他分析包括： 当多个路径在同一时间点汇聚或分叉时，评估汇总进度储备的必要性，以减少出现进度落后的可能性。 审查网络，看看关键路径是否存在高风险活动或具有较多提前量的活动，是否需要使用进度储备或执行风险应对计划来降低关键路径的风险。供方选择分析 在确定选择方法前，有必要审查项目竞争性需求的优先级。由于竞争性选择方法可能要求卖方在事前投入大量时间和资源，因此，应该在采购文件中写明评估方法，让投标人了解将会被如何评估。 常用的选择方法包括： 最低成本。 仅凭资质。 基于质量或技术方案得分。 基于质量和成本。 独有来源。 固定预算。机会应对策略 上报、开拓、分享、提高、接受。整体项目风险应对策略 规避、开拓、转移或分享、减轻或提高、接受。威胁应对策略 上报、规避、转移、减轻、接受。测试与检查的规划 在规划阶段，项目经理和项目团队决定如何测试或检查产品、可交付成果或服务，以满足相关方的需求和期望，以及如何满足产品的绩效和可靠性目标。测试/产品评估 测试是一种有组织的、结构化的调查，旨在根据项目需求提供有关被测产品或服务质量的客观信息。测试的目的是找出产品或服务中存在的错误、缺陷、漏洞或其他不合规问题。用于评估各项需求的测试的类型、数量和程度是项目质量计划的一部分，具体取决于项目的性质、时间、预算或其他制约因素。测试可以贯穿于整个项目，可以随着项目的不同组成部分变得可用时进行，也可以在项目结束（即交付最终可交付成果）时进行。早期测试有助于识别不合规问题，帮助减少修补不合规组件的成本。三点估算 一种估算技术。当单个活动的成本或持续时间估算不易确定时，取其乐观估算、悲观估算和最可能估算的平均值或加权平均值。完工尚需绩效指数 完工尚需绩效指数（TCPI）是一种为了实现特定的管理目标，剩余资源的使用必须达到的成本绩效指标，是完成剩余工作所需的成本与剩余预算之比。TCPI 是指为了实现具体的管理目标（如BAC 或 EAC），剩余工作的实施必须达到的成本绩效指标。如果 BAC 已明显不再可行，则项目经理应考虑使用预测的 EAC。经过批准后，就用 EAC 取代 BAC。 基于 BAC 的 TCPI 公式：TCPI =（BAC – EV）/（BAC – AC）。 基于 EAC 的 TCPI 公式：TCPI =（BAC – EV）/（EAC – AC）。培训 培训包括旨在提高项目团队成员能力的全部活动，可以是正式或非正式的，方式包括课堂培训、在线培训、计算机辅助培训、在岗培训（由其他项目团队成员提供）、辅导及训练虚拟团队 虚拟团队可定义为具有共同目标、在完成角色任务的过程中很少或没有时间面对面工作的一群人。","link":"/2021/03/31/Project-Tools/"},{"title":"Hexo常用命令","text":"简写指令:hexo n “我的第一篇文章” 等价于hexo new “我的第一篇文章” 还等价于hexo new post “我的第一篇文章”hexo p 等价于 hexo publishhexo g 等价于 hexo generatehexo s等价于 hexo serverhexo d 等价于 hexo deployhexo deploy -g 等价于 hexo deploy –generatehexo generate -d等价于hexo generate –deploy 注: hexo clean 没有 简写, git –version 没有简写 指令说明:hexo server #Hexo 会监视文件变动并自动更新，除修改站点配置文件外,无须重启服务器,直接刷新网页即可生效。hexo server -s #以静态模式启动hexo server -p 5000 #更改访问端口 (默认端口为4000，’ctrl + c’关闭server)hexo server -i IP地址 #自定义 IPhexo clean #清除缓存 ,网页正常情况下可以忽略此条命令,执行该指令后,会删掉站点根目录下的public文件夹hexo g #生成静态网页 (执行 $ hexo g后会在站点根目录下生成public文件夹, hexo会将”/blog/source/“ 下面的.md后缀的文件编译为.html后缀的文件,存放在”/blog/public/ “ 路径下)hexo d #将本地数据部署到远端服务器(如github)hexo init 文件夹名称 #初始化XX文件夹名称npm update hexo -g#升级npm install hexo -g#安装node-v #查看node.js版本号npm -v #查看npm版本号git –version #查看git版本号hexo -v #查看hexo版本号 一条命令实现所有内容初始化并发布（包含豆瓣相关内容）hexo clean &amp;&amp; hexo douban -bgm &amp;&amp; hexo generate &amp;&amp; hexo server &amp;&amp; hexo deploy Icarus使用范例1.按钮 Info Success Warning Danger 2.显示一言显示一言 ↑↑↑ 试着点击“显示一言”！ function showHitokoto (event) { event.target.classList.add('is-loading'); $.ajax({ type: 'GET', url: 'https://v1.hitokoto.cn/', success: function (data) { $('.hitokoto').text(data.hitokoto); event.target.classList.remove('is-loading'); } }); } 3.进度条 4.标签页 Pictures Music Videos Documents Pixabay 是全球知名的图库网站及充满活力的创意社区,拥有上百万张免费正版高清照片素材,涵盖风景、人物、动态、静物等多种分类,你可以在任何地方使用 Pixabay 图库中的素材… 网易云音乐 是一款专注于发现与分享的音乐产品,依托专业音乐人、DJ、好友推荐及社交功能,为用户打造全新的音乐生活。 哔哩哔哩 是国内知名的视频弹幕网站,这里有最及时的动漫新番,最棒的ACG氛围,最有创意的Up主。大家可以在这里找到许多欢乐。 石墨文档 是全新一代云 Office 办公软件,支持多人在线协作编辑文档和表格,独有内容级安全,全过程留痕可追溯。PC 端和移动端全覆盖,随时随地远程办公。即写即存… .content .tabs ul { margin: 0; } .tab-content { display: none; } function onTabClick (event) { var tabTitle = $(event.currentTarget).children('span:last-child').text(); $('.article .content .tab-content').css('display', 'none'); $('.article .content .tabs li').removeClass('is-active'); $('#' + tabTitle).css('display', 'block'); $(event.currentTarget).parent().addClass('is-active'); } 5.彩色标识 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 活用 Bulma 美化 Icarus 文章 Icarus 主题以白色的简洁为主，但有时候我们希望在文章中用特别的样式注明一些内容，markdown 语法就不够用了，所以在此分享一下我的高级玩法。 6.点击展开代码点击展开代码 >foldedconsole.log('I love Icarus!'); 7.你知道的太多了 .heimu { color: #000; background-color: #000; } .heimu:hover { color: #fff; } iMaeGoo 出自独立游戏 World of Goo 里小粘球的叫声，读作 /ɪ’mæɡu/ 不是爱妹狗啊，在家里电脑还是个大头（CRT）的时候就在玩了，其实头像也是在当时设定的，一直沿用至今。找不到女朋友誓不改头像 8.让简介不出现在正文这里的内容会出现在 简介和正文 这里的内容只会出现在 简介 .post-summary { display: none; } 这里的内容只会出现在 正文 9.封面图来源说明 &nbsp;&nbsp; Vector Landscape Vectors by Vecteezy 使用范例内容转自iMaeGoo虹墨空间站","link":"/2021/03/20/Hello-World/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"ACP","slug":"ACP","link":"/tags/ACP/"},{"name":"PgMP","slug":"PgMP","link":"/tags/PgMP/"},{"name":"PMP","slug":"PMP","link":"/tags/PMP/"}],"categories":[{"name":"Others","slug":"Others","link":"/categories/Others/"},{"name":"项目管理","slug":"项目管理","link":"/categories/%E9%A1%B9%E7%9B%AE%E7%AE%A1%E7%90%86/"}]}